nakhonthai/ESP32APRS_LoRa/src/main.cpp
/*
 Name:		ESP32APRS LoRa
 Created:	1-Feb-2024
 Author:	HS5TQA/Atten
 Support APRS-IS: host:aprs.dprns.com port:14580
 Support APRS-CB: host:aprs.dprns.com port:24580
 Support IS monitor: http://aprs.dprns.com:14501
*/

#include <Arduino.h>
#include <esp_task_wdt.h>
#include "main.h"
#include <LibAPRSesp.h>
#include <limits.h>
#include <KISS.h>
#include "webservice.h"
#include <WiFiUdp.h>
#include "ESP32Ping.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClient.h>
#include <NetworkUdp.h>
#include "cppQueue.h"
#include "digirepeater.h"
#include "igate.h"
#include "message.h"
#include "wireguardif.h"
#include "wireguard.h"
#include "driver/pcnt.h"

#include "driver/adc.h"
#include "esp_adc_cal.h"
#include <TinyGPS++.h>
#include <pbuf.h>
#include <parse_aprs.h>

#include "wireguard_vpn.h"

#include <WiFiClientSecure.h>

#include <SoftwareSerial.h>

#include <ModbusMaster.h>

#include "handleATCommand.h"

// #include <EEPROM.h>

// #include "IP5306_I2C.h"

#include "sensor.h"

#include <rom/spi_flash.h>
#include "FS.h"
#include <LITTLEFS.h>

#include <time.h>

#ifdef MQTT
#include <PubSubClient.h>
#endif

WiFiClient aprsClient;
NetworkUDP aprsUDP;

#ifdef APRS_LORA_HT
// #include "AiEsp32RotaryEncoder.h"
#define ROTARY_ENCODER_A_PIN 1
#define ROTARY_ENCODER_B_PIN 2
#define ROTARY_ENCODER_BUTTON_PIN 0

// #define ROTARY_ENCODER_STEPS 4
// AiEsp32RotaryEncoder rotaryEncoder = AiEsp32RotaryEncoder(ROTARY_ENCODER_A_PIN, ROTARY_ENCODER_B_PIN, ROTARY_ENCODER_BUTTON_PIN, -1, ROTARY_ENCODER_STEPS);
const int8_t KNOBDIR[] = {
    0, -1, 1, 0,
    1, 0, 0, -1,
    -1, 0, 0, 1,
    0, 1, -1, 0};

volatile int8_t _oldState;

volatile long _position;        // Internal position (4 times _positionExt)
volatile long _positionExt;     // External position
volatile long _positionExtPrev; // External position (used only for direction checking)

portMUX_TYPE muxKey = portMUX_INITIALIZER_UNLOCKED;
unsigned long keyPeriadTime;
int encoder0Pos = 0;
int encoder0PosPrev = 0;
int posNow = 0;
void IRAM_ATTR doEncoder()
{
    portENTER_CRITICAL_ISR(&muxKey);
    int sig1 = digitalRead(ROTARY_ENCODER_A_PIN);
    int sig2 = digitalRead(ROTARY_ENCODER_B_PIN);
    int8_t thisState = sig1 | (sig2 << 1);

    if (_oldState != thisState)
    {
        _position += KNOBDIR[thisState | (_oldState << 2)];
        _oldState = thisState;
        // Serial.printf("Key:%d\n", _position >> 2);
        _positionExt = _position >> 2;
        if (_positionExtPrev != _positionExt)
        {
            if (_positionExtPrev > _positionExt)
            {
                encoder0Pos--;
            }
            else if (_positionExtPrev < _positionExt)
            {
                encoder0Pos++;
            }
            _positionExtPrev = _positionExt;
            // Serial.printf("Key:%d\n", _positionExt);
        }
    }
    portEXIT_CRITICAL_ISR(&muxKey);
}
#endif

#ifdef PPPOS
#include <PPP.h>
#define PPP_MODEM_APN "internet"
#define PPP_MODEM_PIN "0000" // or NULL
#endif
// WaveShare SIM7600 HW Flow Control
// #define PPP_MODEM_RST       25
// #define PPP_MODEM_RST_LOW   false  //active HIGH
// #define PPP_MODEM_RST_DELAY 200
// #define PPP_MODEM_TX        21
// #define PPP_MODEM_RX        22
// #define PPP_MODEM_RTS       26
// #define PPP_MODEM_CTS       27
// #define PPP_MODEM_FC        ESP_MODEM_FLOW_CONTROL_HW
// #define PPP_MODEM_MODEL     PPP_MODEM_SIM7600

#ifdef NAWS4
#define PPP_MODEM_RST_DELAY 500
#define PPP_MODEM_RST 39
#define PPP_MODEM_RST_LOW true // active LOW
#define PPP_MODEM_TX 41
#define PPP_MODEM_RX 42
#define PPP_MODEM_RTS -1
#define PPP_MODEM_CTS -1
#define PPP_MODEM_FC ESP_MODEM_FLOW_CONTROL_NONE
#define PPP_MODEM_MODEL PPP_MODEM_SIM7000
#else
#ifdef PPPOS
// SIM800 basic module with just TX,RX and RST
#define PPP_MODEM_RST_DELAY 500
#define PPP_MODEM_RST 13
#define PPP_MODEM_RST_LOW true // active LOW
#define PPP_MODEM_TX 12
#define PPP_MODEM_RX 11
#define PPP_MODEM_RTS -1
#define PPP_MODEM_CTS -1
#define PPP_MODEM_FC ESP_MODEM_FLOW_CONTROL_NONE
#define PPP_MODEM_MODEL PPP_MODEM_SIM800
#endif

#endif

// #if !defined(CONFIG_IDF_TARGET_ESP32C3) && !defined(CONFIG_IDF_TARGET_ESP32C6)

#ifdef T_BEAM_S3_SUPREME
#include <XPowersLib.h>
#define PMU_I2C_SDA (42)
#define PMU_I2C_SCL (41)
#define PMU_IRQ (40)
XPowersAXP2101 PMU;
#elif T_BEAM_S3_BPF
#include <XPowersLib.h>
#define PMU_I2C_SDA (8)
#define PMU_I2C_SCL (9)
#define PMU_IRQ (4)
XPowersAXP2101 PMU;
#endif

#ifdef NAWS4
#include <XPowersLib.h>
#define PMU_I2C_SDA (13)
#define PMU_I2C_SCL (14)
#define PMU_IRQ (-1)
XPowersAXP152 PMU;
#endif

#ifdef TTGO_T_Beam_V1_2
#include <XPowersLib.h>
#define PMU_I2C_SDA (21)
#define PMU_I2C_SCL (22)
#define PMU_IRQ (35)
XPowersAXP2101 PMU;
#endif

// #define EEPROM_SIZE 4096

#ifdef APRS_LORA_DONGLE
#define PIXELS_PIN 45
#elif BV5DJ_BOARD
#define PIXELS_PIN 12
#endif

#ifdef HELTEC_V3_GPS
#define LED_TX 35
#elif defined(TTGO_LORA32_V21)
#define LED_TX 25
#elif defined(HELTEC_HTIT_TRACKER)
#define LED_TX 18
#elif defined(TTGO_LORA32_V21)
#define LED_TX 25
#elif defined(HELTEC_HTIT_TRACKER)
#define LED_TX 18
#else
#define LED_TX -1
#endif

#if defined(HELTEC_HTIT_TRACKER)
#define LED_RX 18
#else
#define LED_RX -1
#endif

#ifdef STRIP_PIN
#include <Adafruit_NeoPixel.h>
Adafruit_NeoPixel strip = Adafruit_NeoPixel(1, STRIP_PIN, NEO_GRB + NEO_KHZ800);
// portMUX_TYPE ledMux = portMUX_INITIALIZER_UNLOCKED;
void IRAM_ATTR LED_Status(uint8_t r, uint8_t g, uint8_t b)
{
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    strip.setPixelColor(0, strip.Color(r, g, b));
    strip.show();
    // portEXIT_CRITICAL_ISR(&ledMux);
}
#elif defined(APRS_LORA_DONGLE)
#include <Adafruit_NeoPixel.h>
Adafruit_NeoPixel strip = Adafruit_NeoPixel(1, PIXELS_PIN, NEO_GRB + NEO_KHZ800);
// portMUX_TYPE ledMux = portMUX_INITIALIZER_UNLOCKED;
void IRAM_ATTR LED_Status(uint8_t r, uint8_t g, uint8_t b)
{
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    strip.setPixelColor(0, strip.Color(r, g, b));
    strip.show();
    // portEXIT_CRITICAL_ISR(&ledMux);
}
#elif defined(BV5DJ_BOARD)
#include <Adafruit_NeoPixel.h>
Adafruit_NeoPixel strip = Adafruit_NeoPixel(2, PIXELS_PIN, NEO_GRB + NEO_KHZ800);

// portMUX_TYPE ledMux = portMUX_INITIALIZER_UNLOCKED;
void LED_Status(uint8_t r, uint8_t g, uint8_t b)
{
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    strip.setPixelColor(0, strip.Color(r, g, b));
    strip.show();
    // portEXIT_CRITICAL_ISR(&ledMux);
}
#else
void LED_Status(uint8_t r, uint8_t g, uint8_t b)
{
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    if (LED_TX > -1)
    {
        if (r > 0)
            digitalWrite(LED_TX, HIGH);
        else
            digitalWrite(LED_TX, LOW);
    }
    if (LED_RX > -1)
    {
        if (g > 0)
            digitalWrite(LED_RX, HIGH);
        else
            digitalWrite(LED_RX, LOW);
    }
    // portEXIT_CRITICAL_ISR(&ledMux);
}
#endif

bool i2c_busy = false;
#include <Wire.h>

