nakhonthai/ESP32APRS_LoRa/src/main.cpp
#include <Fonts/FreeSansBold9pt7b.h>
#include <Fonts/FreeSerifItalic9pt7b.h>
#include "Font/Seven_Segment24pt7b.h"

#ifdef OLED
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>

#if defined(SSD1306_72x40)
#define SCREEN_WIDTH 72  // OLED display width, in pixels
#define SCREEN_HEIGHT 40 // OLED display height, in pixels
#else
#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
#endif

// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
#ifdef SH1106
#include <Adafruit_SH1106.h>
#define OLED_RESET -1
#define SCREEN_ADDRESS 0x3C ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SH1106 display(OLED_RESET);
#else
#include <Adafruit_SSD1306.h>
#if defined(TTGO_LORA32_V1)
#define OLED_RESET 16 // Reset pin # (or -1 if sharing Arduino reset pin)
#elif defined(HELTEC_V3_GPS)
#define OLED_RESET 21
#else
#define OLED_RESET -1
#endif
#ifdef SSD1306_72x40
#define SSD1306_NO_SPLASH
#define SCREEN_ADDRESS 0x3C
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
#else
#define SCREEN_ADDRESS 0x3C //(0x3C for 32-pixel-tall displays, 0x3D for all others).
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
#endif

#endif

#endif

#if defined(ST7735_160x80) || defined(NV3022B3)
#include <Adafruit_GFX_Buffer.h>
#include <Adafruit_GFX.h>    // Core graphics library
#include <Adafruit_ST7735.h> // Hardware-specific library for ST7735
#include "Adafruit_miniTFTWing.h"

#define SCREEN_WIDTH 160
#define SCREEN_HEIGHT 80

// SPIClass hspi;
Adafruit_miniTFTWing ss;

#define BLACK ST77XX_BLACK
#define WHITE ST77XX_WHITE

/* Heltec Wireless Tracker V1.1 */

//
// TFT data from HT_st7735.h
//
#define ST7735_CS_Pin 38
#define ST7735_REST_Pin 39
#define ST7735_DC_Pin 40
#define ST7735_SCLK_Pin 41
#define ST7735_MOSI_Pin 42
#define ST7735_VTFT_CTRL_Pin 3
#define ST7735_WIDTH SCREEN_WIDTH
#define ST7735_HEIGHT SCREEN_HEIGHT
#ifdef NV3022B3
#define ST7735_MODEL INITR_MINI160x80
#else
// mini 160x80, rotate left (INITR_MINI160x80_PLUGIN)
#define ST7735_MODEL INITR_MINI160x80_PLUGIN
#endif

SPIClass TFT_SPI(HSPI);
typedef Adafruit_ST7735 display_t;
typedef Adafruit_GFX_Buffer<display_t> GFXBuffer_t;
GFXBuffer_t display = GFXBuffer_t(SCREEN_HEIGHT, SCREEN_WIDTH, display_t(&TFT_SPI, ST7735_CS_Pin, ST7735_DC_Pin, ST7735_REST_Pin));

#endif

#define FORMAT_LITTLEFS_IF_FAILED true
extern fs::LITTLEFSFS LITTLEFS;

struct pbuf_t aprs;
ParseAPRS aprsParse;

TinyGPSPlus gps;

// instantiate ModbusMaster object
ModbusMaster modbus;

#ifndef BV5DJ_BOARD
#define VBAT_PIN 35
#else
#define VBAT_PIN 36
#endif

#define PPP_APN "internet"
#define PPP_USER ""
#define PPP_PASS ""

// #ifdef __XTENSA__
// #define BOOT_PIN 0
// #else
// #define BOOT_PIN 9
// #endif

#ifdef BV5DJ_BOARD
#define BUTTON_LEFT 27
#define BUTTON_RIGHT 32
#define BUTTON_UP 34
#define BUTTON_DOWN 35
#define KEEP_ALIVE 25 // Trigger -pad in PCB
#define SD_CS 13      // MicroSD card SlaveSelect
#define GPS_PPS 26    // GPS PPS pin
#endif

const char *str_status[] = {
    "IDLE_STATUS",
    "NO_SSID_AVAIL",
    "SCAN_COMPLETED",
    "CONNECTED",
    "CONNECT_FAILED",
    "CONNECTION_LOST",
    "DISCONNECTED"};

WiFiMulti wifiMulti;

time_t systemUptime = 0;
time_t wifiUptime = 0;

uint8_t Sleep_Activate = 0;
unsigned long StandByTick = 0;

bool lastHeard_Flag = 0;
unsigned long lastHeardTimeout = 0;

RTC_DATA_ATTR bool gps_mode;

boolean KISS = false;
bool aprsUpdate = false;

long timeSleep = 0;

boolean gotPacket = false;
AX25Msg incomingPacket;

bool lastPkg = false;
bool afskSync = false;
String lastPkgRaw = "";
float rssi = 0;
float snr = 0;
float freqErr = 0;

long timeNetwork, timeAprs, timeGui;

long autoResetTimeout = 0;

cppQueue PacketBuffer(sizeof(AX25Msg), 5, IMPLEMENTATION); // Instantiate queue
#if defined OLED || defined ST7735_160x80
cppQueue dispBuffer(300, 3, IMPLEMENTATION);
cppQueue queTxDisp(sizeof(txDisp), 5, IMPLEMENTATION); // Instantiate queue

void pushTxDisp(uint8_t ch, const char *name, char *info)
{
    if (!config.tx_display)
        return;

    size_t name_len = strlen(name);
    size_t info_len = strlen(info);
    if ((name_len > 1 && name_len < 12) && (info_len > 1 && info_len < 50))
    {
        txDisp pkg;
        pkg.tx_ch = ch;
        memset(pkg.name, 0, 12);
        memset(pkg.info, 0, 50);
        strncpy(pkg.name, name, name_len);
        strncpy(pkg.info, info, info_len);
        queTxDisp.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
    }
}
#endif

statusType status;
//RTC_DATA_ATTR igateTLMType igateTLM;
RTC_DATA_ATTR dataTLMType systemTLM;
txQueueType *txQueue;
RTC_DATA_ATTR double LastLat, LastLng;
RTC_DATA_ATTR time_t lastTimeStamp;
RTC_DATA_ATTR uint32_t COUNTER0_RAW;
RTC_DATA_ATTR uint32_t COUNTER1_RAW;

extern msgType *msgQueue;

extern RTC_DATA_ATTR uint8_t digiCount;

String RF_VERSION;

Configuration config;

RTC_DATA_ATTR pkgListType *pkgList;

RTC_DATA_ATTR TelemetryType *Telemetry;

RTC_DATA_ATTR double VBat;
RTC_DATA_ATTR double TempNTC;

RTC_NOINIT_ATTR uint16_t TLM_SEQ;
RTC_NOINIT_ATTR uint16_t IGATE_TLM_SEQ;
RTC_NOINIT_ATTR uint16_t DIGI_TLM_SEQ;

TaskHandle_t taskNetworkHandle;
TaskHandle_t taskAPRSHandle;
TaskHandle_t taskAPRSPollHandle;
TaskHandle_t taskSerialHandle;
TaskHandle_t taskGPSHandle;
TaskHandle_t taskSensorHandle;

unsigned long timerNetwork, timerNetwork_old;
unsigned long timerAPRS, timerAPRS_old;
unsigned long timerGPS, timerGPS_old;
unsigned long timerSerial, timerSerial_old;

unsigned long timeLEDoff = 500, timeLEDon = 10;

bool firstGpsTime = true;
time_t startTime = 0;

#ifdef BLUETOOTH
#if !defined(CONFIG_IDF_TARGET_ESP32)
#include <NuSerial.hpp>
#include <NimBLEDevice.h>
#else
#include "BluetoothSerial.h"
BluetoothSerial SerialBT;
#endif
#endif // !defined(CONFIG_IDF_TARGET_ESP32)

int pkgTNC_count = 0;

xQueueHandle pcnt_evt_queue;              // A queue to handle pulse counter events
pcnt_isr_handle_t user_isr_handle = NULL; // user's ISR service handle

/* A sample structure to pass events from the PCNT
 * interrupt handler to the main program.
 */
typedef struct
{
    int unit;                // the PCNT unit that originated an interrupt
    uint32_t status;         // information on the event type that caused the interrupt
    unsigned long timeStamp; // The time the event occured
} pcnt_evt_t;

