nakhonthai/ESP32APRS_LoRa/src/main.cpp
#ifdef NAWS4
bool setupPower()
{
    Wire.begin(PMU_I2C_SDA, PMU_I2C_SCL,100000);
    delay(10);
    Wire.beginTransmission(0x30);
    byte error = Wire.endTransmission();
    if (error != 0)
    {
        pinMode(3, OUTPUT);
        log_d("AXP152 Power OFF");
        digitalWrite(3, LOW);
        delay(7000);
        digitalWrite(3, HIGH);
        delay(1000);
        log_d("AXP152 Power ON");
        digitalWrite(3, LOW);
        delay(1000);
        digitalWrite(3, HIGH);
    }
    //     log_d("Scanning...");
    //     byte error, address;
    //     int nDevices = 0;
    //     Wire.begin(PMU_I2C_SDA, PMU_I2C_SCL,100000);
    // for (address = 1; address < 127; address++) {
    // Wire.beginTransmission(address);
    // error = Wire.endTransmission();

    // if (error == 0) {
    //     log_d("I2C device found at address 0x");
    // //if (address < 16) Serial.print("0");
    // switch(address) {
    //     case 0x30:
    //         log_d("30 (AXP152 PMU)");
    //         break;
    //     case 0x40:
    //         log_d("40 (INA219 Power Monitor)");
    //         break;
    //     case 0x68:
    //         log_d("68 (MCP3424 ADC)");
    //         break;
    //     default:
    //         log_d("Found=%02X", address);
    //         break;
    // }
    // nDevices++;
    // } else if (error == 4) {
    //     log_d("Unknown error at address 0x");
    // if (address < 16) Serial.print("0");
    // log_d("Found=%0X", address);
    // }
    // }
    // delay(1000);
    // Initialize the PMU with I2C communication
    // AXP152_SLAVE_ADDRESS is the I2C address for the AXP152 PMU
    // PMU_I2C_SDA and PMU_I2C_SCL are the GPIO pins used for I2C communication
    bool result = PMU.begin(Wire, AXP152_SLAVE_ADDRESS, PMU_I2C_SDA, PMU_I2C_SCL);
    if (result == false)
    {
        // while (1)
        //{
        log_d("PMU is not online...");
        // delay(500);
        // }
        return false;
    }
    else
    {
        delay(1000);
        log_d("PMU is online");
        PMU.writeRegister(0x32, 0b00000100); //Power off
        PMU.writeRegister(0x36, 0); // PEK parameter
        PMU.writeRegister(0x93, 0b00001001); // GPIO3
        //PMU.disablePwrOk();               // Disable PWR_OK pin, not used
        PMU.setSysPowerDownVoltage(2600); // Set VSYS off voltage as 2800mV, Adjustment range 2600mV ~ 3300mV
        //PMU.setPowerKeyPressOnTime(0b10010101);
        delay(500);
        PMU.setDC1Voltage(3300); // Set DC1 voltage to 3300mV
        delay(500);
        PMU.setDC3Voltage(3500); // Set DC3 voltage to 3500mV ,VRF_V
        delay(500);
        PMU.setDC4Voltage(3500); // Set DC4 voltage to 3500mV ,VRF_U
        delay(500);
        PMU.setALDO1Voltage(3000); // Set ALDO1 voltage to 3000mV
        delay(500);
        PMU.setALDO2Voltage(3300); // Set ALDO2 voltage to 3300mV
        delay(500);
        PMU.setDLDO1Voltage(3300);           // Set DLDO1 voltage to 3300mV
        PMU.setDLDO2Voltage(3300);           // Set DLDO2 voltage to 3300mV
        PMU.writeRegister(0x90, 0b00000001); // GPIO0 GSM_PWR
        PMU.writeRegister(0x91, 0b00000011); // GPIO1
        PMU.writeRegister(0x92, 0b00000011); // GPIO2
        //PMU.writeRegister(0x93, 0b00001000); // GPIO3
        PMU.writeRegister(0x81, 0);
        PMU.writeRegister(0x36, 0b00001000); // PEK parameter
        delay(500);
        PMU.writeRegister(0x28, 0xFF);
        delay(500);
        // PMU.writeRegister(0x15, 0b10000001); // Set LDO0 voltage to 5000mV/1500mA
        PMU.writeRegister(0x15, 0b00000001); // Set LDO0 voltage to 5000mV/1500mA
        delay(500);
        PMU.writeRegister(0x12, 0xBF);

        // PMU.setDC1Voltage(3300); // Set DC1 voltage to 3300mV
        // PMU.enableDC1();         // Enable DC1
        // PMU.setDC2Voltage(3300); // Set DC2 voltage to 3300mV
        // PMU.enableDC2();         // Enable DC2
        //  PMU.setDC3Voltage(3300); // Set DC3 voltage to 3300mV
        //  PMU.enableDC3();         // Enable DC3
        //  PMU.setDC4Voltage(3300); // Set DC4 voltage to 3300mV
        //  PMU.enableDC4();         // Enable DC4
        //  PMU.setALDO1Voltage(3300); // Set ALDO1 voltage to 3300mV
        //  PMU.enableALDO1();         // Enable ALDO1
        //  PMU.setALDO2Voltage(3300); // Set ALDO2 voltage to
        //  PMU.enableALDO2();         // Enable ALDO2
        //  PMU.setDLDO1Voltage(3300); // Set DLDO1 voltage to 3300mV
        //  PMU.enableDLDO1();         // Enable DLDO1
        //  PMU.setDLDO2Voltage(3300); // Set DLDO2 voltage to 3300mV
        //  PMU.enableDLDO2();         // Enable DLDO2

        delay(200);
        log_d("DCDC=======================================================================");
        log_d("DC1  : %s   Voltage:%u mV \n", PMU.isEnableDC1() ? "+" : "-", PMU.getDC1Voltage());
        // log_d("DC2  : %s   Voltage:%u mV \n", PMU.isEnableDC2() ? "+" : "-", PMU.getDC2Voltage());
        log_d("DC3  : %s   Voltage:%u mV \n", PMU.isEnableDC3() ? "+" : "-", PMU.getDC3Voltage());
        log_d("DC4  : %s   Voltage:%u mV \n", PMU.isEnableDC4() ? "+" : "-", PMU.getDC4Voltage());
        log_d("ALDO=======================================================================");
        log_d("ALDO1: %s   Voltage:%u mV\n", PMU.isEnableALDO1() ? "+" : "-", PMU.getALDO1Voltage());
        log_d("ALDO2: %s   Voltage:%u mV\n", PMU.isEnableALDO2() ? "+" : "-", PMU.getALDO2Voltage());
        // log_d("ALDO3: %s   Voltage:%u mV\n", PMU.isEnableLDO0 ? "+" : "-", PMU.getLDO0Voltage());
        log_d("BLDO=======================================================================");
        log_d("BLDO1: %s   Voltage:%u mV\n", PMU.isEnableDLDO1() ? "+" : "-", PMU.getDLDO1Voltage());
        log_d("BLDO2: %s   Voltage:%u mV\n", PMU.isEnableDLDO2() ? "+" : "-", PMU.getDLDO2Voltage());
        log_d("===========================================================================");
        return true;
    }
    return false;
}
#endif

#ifdef T_BEAM_S3_SUPREME
void setupPower()
{
    bool result = PMU.begin(Wire1, AXP2101_SLAVE_ADDRESS, PMU_I2C_SDA, PMU_I2C_SCL);
    if (result == false)
    {
        while (1)
        {
            log_d("PMU is not online...");
            delay(500);
        }
    }

