nakhonthai/ESP32APRS_LoRa/src/main.cpp
        dist = gps.distanceBetween(LastLng, LastLat, nowLng, nowLat);
        course = aprsParse.direction(LastLng, LastLat, nowLng, nowLat);
        if (dist > 50.0F)
            dist = 0;
        if (tdiff > 10 && (nowTime > lastTimeStamp))
            speed = dist / ((double)tdiff / 3600);
        else
            speed = 0.0F;

        if (speed > 5)
        {
            speed = gps.speed.kmph();
            course = gps.course.deg();
        }
    }
    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;
    // if (!waterTempFlag)
    // 		{
    // ds18b20.setWaitForConversion(false); // makes it async
    // ds18b20.requestTemperatures();
    // ds18b20.setWaitForConversion(true);
    // waterTemperature = ds18b20.getTempCByIndex(0);
    // if (waterTemperature > 0)
    // 	waterTempFlag = true;
    //}

    if (!LITTLEFS.exists(dfName))
    {
        header = true;
    }

    File f = LITTLEFS.open(dfName, "a");
#ifdef DEBUG
    log_d("====== Writing to data file =========");
    log_d("Open File %s", dfName);
#endif
    if (!f)
    {
#ifdef DEBUG
        log_d("Data file open failed");
#endif
    }
    else
    {
        if (header)
        {
            // col = "\"dd/mm/yyyy h:m\",\"Weight Origin(Kg)\",\"Weight(Kg)\",\"Water Drain(L)\",\"Water Height(mm)\",\"Temperature(C)\",\"Raw\"";
            col = "dd/mm/yyyy h:m:s";
            col += ",Latitude";
            col += ",Longitude";
            col += ",Speed(kph)";
            col += ",Course(°)";
            for (int i = 0; i < 5; i++)
            {
                if (config.trk_tlm_sensor[i] > 0)
                {
                    col += "," + String(config.trk_tlm_PARM[i]) + "(" + String(config.trk_tlm_UNIT[i]) + ")";
                }
            }
            f.println(col);
        }
        sprintf(datetime, "%d-%02d-%02d %02d:%02d:%02d", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        sprintf(data, "%s,%0.5f,%0.5f,%0.2f,%d", datetime, lat, lon, speed, (int)course);
        for (int s = 0; s < 5; s++)
        {
            if (config.trk_tlm_sensor[s] == 0)
            {
                continue;
                // strcat(tlm_data, "0");
            }
            else
            {
                strcat(data, ",");
                int sen_idx = config.trk_tlm_sensor[s] - 1;
                double val = 0;
                if (sen[sen_idx].visable)
                {
                    if (config.trk_tlm_avg[s] && (sen[sen_idx].timeAvg > 0))
                        val = sen[sen_idx].average;
                    else
                        val = sen[sen_idx].sample;
                }
                strcat(data, String(val, 2).c_str());
            }
        }
        f.println(data);
        f.close();
#ifdef DEBUG
        log_d("Data file updated");
#endif
    }
}

void logIGate(double lat, double lon, double speed, double course)
{
    char data[200];
    char datetime[30];
    char dfName[30];
    bool header = false;
    double dist;
    time_t nowTime;

    if (gps.time.isValid())
    {
        time_t timeGps = getGpsTime(); // Local gps time
        time(&nowTime);
        int tdiff = abs(timeGps - nowTime);
        if (timeGps > 1700000000 && tdiff > 2) // && timeGps < 2347462800)
        {
            nowTime = timeGps;
            setTime(nowTime);
            time_t rtc = nowTime - (time_t)(config.timeZone * (float)SECS_PER_HOUR);
            timeval tv = {rtc, 0};
            timezone tz = {(int)(config.timeZone * (float)SECS_PER_HOUR), 0};
            settimeofday(&tv, &tz);
        }
    }
    else
    {
        time(&nowTime);
    }

    String col;
    struct tm tmstruct;
    getLocalTime(&tmstruct, 100);
    sprintf(dfName, "/igate_%02d%d.csv", (tmstruct.tm_mon) + 1, (tmstruct.tm_year) + 1900);

    if (lastTimeStamp == 0)
        lastTimeStamp = nowTime;
    time_t tdiff = nowTime - lastTimeStamp;
    double nowLat = gps.location.lat();
    double nowLng = gps.location.lng();
    double spd = gps.speed.kmph();

    // dist = distance(LastLng, LastLat, nowLng, nowLat);

    if (spd < 5)
    {

        dist = gps.distanceBetween(LastLng, LastLat, nowLng, nowLat);
        course = aprsParse.direction(LastLng, LastLat, nowLng, nowLat);
        if (dist > 50.0F)
            dist = 0;
        if (tdiff > 10 && (nowTime > lastTimeStamp))
            speed = dist / ((double)tdiff / 3600);
        else
            speed = 0.0F;

        if (speed > 5)
        {
            speed = gps.speed.kmph();
            course = gps.course.deg();
        }
    }
    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;

    if (!LITTLEFS.exists(dfName))
    {
        header = true;
    }

    File f = LITTLEFS.open(dfName, "a");
#ifdef DEBUG
    log_d("====== Writing to data file =========");
    log_d("Open File %s", dfName);
#endif
    if (!f)
    {
#ifdef DEBUG
        log_d("Data file open failed");
#endif
    }
    else
    {
        if (header)
        {
            // col = "\"dd/mm/yyyy h:m\",\"Weight Origin(Kg)\",\"Weight(Kg)\",\"Water Drain(L)\",\"Water Height(mm)\",\"Temperature(C)\",\"Raw\"";
            col = "dd/mm/yyyy h:m:s";
            col += ",Latitude";
            col += ",Longitude";
            col += ",Speed(kph)";
            col += ",Course(°)";
            for (int i = 0; i < 5; i++)
            {
                if (config.igate_tlm_sensor[i] > 0)
                {
                    col += "," + String(config.igate_tlm_PARM[i]) + "(" + String(config.igate_tlm_UNIT[i]) + ")";
                }
            }
            f.println(col);
        }
        sprintf(datetime, "%d-%02d-%02d %02d:%02d:%02d", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        sprintf(data, "%s,%0.5f,%0.5f,%0.2f,%d", datetime, lat, lon, speed, (int)course);
        for (int s = 0; s < 5; s++)
        {
            if (config.igate_tlm_sensor[s] == 0)
            {
                continue;
                // strcat(tlm_data, "0");
            }
            else
            {
                strcat(data, ",");
                int sen_idx = config.igate_tlm_sensor[s] - 1;
                double val = 0;
                if (sen[sen_idx].visable)
                {
                    if (config.igate_tlm_avg[s] && (sen[sen_idx].timeAvg > 0))
                        val = sen[sen_idx].average;
                    else
                        val = sen[sen_idx].sample;
                }
                strcat(data, String(val, 2).c_str());
            }
        }
        f.println(data);
        f.close();
#ifdef DEBUG
        log_d("Data file updated");
#endif
    }
}

