nakhonthai/ESP32APRS_LoRa/src/main.cpp
    //--RF Module
    config.rf_en = false;
    config.rf_type = RF_SX1262;
    config.rf_freq = 433.775;
    config.rf_freq_offset = 0; //+-30,000Hz
    config.rf_bw = 125.0;
    config.rf_sf = 12;
    config.rf_cr = 5;
    config.rf_sync = 0x12;
    config.rf_power = 10;
    config.rf_preamable = 8;
    config.rf_lna = 1;
    config.rf_mode = 1;
    config.rf_ax25 = true;
    config.rf_br = 9.7;
    config.rf_dio2_gpio = -1;
    config.rf_shaping = 0x02; //RADIOLIB_SHAPING_0_5;
    config.rf_encoding = 0x00; //RADIOLIB_ENCODING_NRZ;
    config.rf_rx_boost = true;

#ifdef NAWS4
    config.rf_en = true;
    config.rf_type = RF_SX1278;
    config.rf_freq = 433.775;
    config.rf_freq_offset = 2500; //+-30,000Hz
    config.rf_bw = 125.0;
    config.rf_sf = 12;
    config.rf_cr = 5;
    config.rf_sync = 0x12;
    config.rf_power = 20;
    config.rf_preamable = 8;
    config.rf_lna = 1;
    config.rf_mode = 1;
    config.rf_ax25 = true;
    config.rf_br = 9.7;
    config.rf_shaping = 0x02; //RADIOLIB_SHAPING_0_5;
    config.rf_encoding = 0x00; //RADIOLIB_ENCODING_NRZ;
    config.rf_rx_boost = false;


    config.rf1_en = true;
    config.rf1_type = RF_SX1278;
    config.rf1_freq = 144.410;
    config.rf1_freq_offset = 1300;
    config.rf1_bw = 10.4F;
    config.rf1_sf = 8;
    config.rf1_cr = 5;
    config.rf1_power = 20;
    config.rf1_sync = 0x12;
    config.rf1_power = 20;
    config.rf1_preamable = 8;
    config.rf1_lna = 1;
    config.rf1_mode = 1;
    config.rf1_ax25 = true;
    config.rf1_br = 9.7;
    config.rf1_shaping = 0x02; //RADIOLIB_SHAPING_0_5;
    config.rf1_encoding = 0x00; //RADIOLIB_ENCODING_NRZ;
    config.rf1_rx_boost = false;

#endif

    // IGATE
    config.igate_bcn = false;
    config.igate_en = false;
    config.rf2inet = true;
    config.inet2rf = false;
    config.igate_loc2rf = false;
    config.igate_loc2inet = true;
    config.rf2inetFilter = 0xFFF; // All
    config.inet2rfFilter = config.digiFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX;
    //--APRS-IS
    config.igate_ssid = 1;
    config.aprs_port = 14580;
    sprintf(config.igate_mycall, "NOCALL");
    sprintf(config.igate_host, "aprs.nakhonthai.net");
    //memset(config.aprs_passcode, 0, sizeof(config.aprs_passcode));
    sprintf(config.igate_moniCall, "%s-%d", config.igate_mycall, config.igate_ssid);
    sprintf(config.igate_filter, "m/10");
    //--Position
    config.igate_gps = false;
    config.igate_lat = 13.7555;
    config.igate_lon = 100.4930;
    config.igate_alt = 0;
    config.igate_interval = 600;
    sprintf(config.igate_symbol, "Lz");
    memset(config.igate_object, 0, sizeof(config.igate_object));
    memset(config.igate_phg, 0, sizeof(config.igate_phg));
    config.igate_path = 8;
    sprintf(config.igate_comment, "");
    sprintf(config.igate_status, "https://github.com/nakhonthai/ESP32APRS_LoRa");
    config.igate_sts_interval = 1800;

    // DIGI REPEATER
    config.digi_en = false;
    config.digi_auto = false;
    config.digi_loc2rf = true;
    config.digi_loc2inet = false;
    config.digi_ssid = 3;
    config.digi_timestamp = false;
    sprintf(config.digi_mycall, "NOCALL");
    config.digi_path = 8;
    //--Position
    config.digi_gps = false;
    config.digi_lat = 13.7555;
    config.digi_lon = 100.4930;
    config.digi_alt = 0;
    config.digi_interval = 600;
    config.igate_timestamp = false;
    config.digi_delay = 0;
    config.digiFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX;

    sprintf(config.digi_symbol, "L#");
    memset(config.digi_phg, 0, sizeof(config.digi_phg));
    sprintf(config.digi_comment, "");
    sprintf(config.digi_status, "https://github.com/nakhonthai/ESP32APRS_LoRa");
    config.digi_sts_interval = 1800;

    // Tracker
    config.trk_en = false;
    config.trk_loc2rf = true;
    config.trk_loc2inet = false;
    config.trk_rssi = false;
    config.trk_sat = false;
    config.trk_dx = false;
    config.trk_ssid = 7;
    config.trk_timestamp = false;
    sprintf(config.trk_mycall, "NOCALL");
    config.trk_path = 2;

    //--Position
    config.trk_gps = true;
    config.trk_lat = 13.7555;
    config.trk_lon = 100.4930;
    config.trk_alt = 0;
    config.trk_interval = 600;
    // Smart beacon
    config.trk_smartbeacon = true;
    config.trk_compress = true;
    config.trk_altitude = true;
    config.trk_log = true;
    config.trk_hspeed = 120;
    config.trk_lspeed = 5;
    config.trk_maxinterval = 30;
    config.trk_mininterval = 5;
    config.trk_minangle = 25;
    config.trk_slowinterval = 600;

    sprintf(config.trk_symbol, "/[");
    sprintf(config.trk_symmove, "/>");
    sprintf(config.trk_symstop, "\\>");
    // sprintf(config.trk_btext, "");
    sprintf(config.trk_mycall, "NOCALL");
    sprintf(config.trk_comment, "");
    memset(config.trk_item, 0, sizeof(config.trk_item));
    sprintf(config.trk_status, "https://github.com/nakhonthai/ESP32APRS_LoRa");
    config.trk_sts_interval = 1800;

    // WX
    config.wx_en = false;
    config.wx_2rf = true;
    config.wx_2inet = true;
    // config.wx_channel = 0;
    config.wx_ssid = 13;
    sprintf(config.wx_mycall, "NOCALL");
    config.wx_path = 8;
    sprintf(config.wx_comment, "WX MODE");
    memset(config.wx_object, 0, sizeof(config.wx_object));

    // Telemetry_0
    config.tlm0_en = false;
    config.tlm0_2rf = true;
    config.tlm0_2inet = true;
    config.tlm0_ssid = 0;
    sprintf(config.tlm0_mycall, "NOCALL");
    config.tlm0_path = 0;
    config.tlm0_data_interval = 600;
    config.tlm0_info_interval = 3600;
    sprintf(config.tlm0_PARM[0], "RF->INET");
    sprintf(config.tlm0_PARM[1], "INET->RF");
    sprintf(config.tlm0_PARM[2], "Repeater");
    sprintf(config.tlm0_PARM[3], "AllCount");
    sprintf(config.tlm0_PARM[4], "AllDrop");
    sprintf(config.tlm0_PARM[5], "IGATE");
    sprintf(config.tlm0_PARM[6], "DIGI");
    sprintf(config.tlm0_PARM[7], "WX");
    sprintf(config.tlm0_PARM[8], "SAT");
    sprintf(config.tlm0_PARM[9], "INET");
    sprintf(config.tlm0_PARM[10], "VPN");
    sprintf(config.tlm0_PARM[11], "4G");
    sprintf(config.tlm0_PARM[12], "MQTT");

    for (int i = 0; i < 5; i++)
    {
        sprintf(config.tlm0_UNIT[i], "Pkts");
        config.tlm0_EQNS[i][0] = 0; // a av2 + bv + c
        config.tlm0_EQNS[i][1] = 1; // b
        config.tlm0_EQNS[i][2] = 0; // c
    }
    sprintf(config.tlm0_UNIT[5], "En");
    sprintf(config.tlm0_UNIT[6], "En");
    sprintf(config.tlm0_UNIT[7], "En");
    sprintf(config.tlm0_UNIT[8], "En");
    sprintf(config.tlm0_UNIT[9], "ON");
    sprintf(config.tlm0_UNIT[10], "ON");
    sprintf(config.tlm0_UNIT[11], "ON");
    sprintf(config.tlm0_UNIT[12], "ON");
    config.tlm0_BITS_Active = 0xFF;
    config.tml0_data_channel[0] = 2;
    config.tml0_data_channel[1] = 3;
    config.tml0_data_channel[2] = 4;
    config.tml0_data_channel[3] = 1;
    config.tml0_data_channel[4] = 5;
    config.tml0_data_channel[5] = 1;
    config.tml0_data_channel[6] = 2;
    config.tml0_data_channel[7] = 3;
    config.tml0_data_channel[8] = 4;
    config.tml0_data_channel[9] = 5;
    config.tml0_data_channel[10] = 6;
    config.tml0_data_channel[11] = 7;
    config.tml0_data_channel[12] = 8;
    sprintf(config.tlm0_comment, "SYSTEM STATUS");

    //--Position
    config.wx_gps = false;
    config.wx_lat = 13.7555;
    config.wx_lon = 100.4930;
    config.wx_alt = 0;
    config.wx_interval = 600;
    config.wx_flage = 0;
    // memset(config.wx_type, 0, sizeof(config.wx_type));

