nakhonthai/ESP32APRS_LoRa/src/main.cpp
    // config.uart2_enable = false;
    // config.uart2_baudrate = 9600;
    // config.uart2_rx_gpio = 16;
    // config.uart2_tx_gpio = 17;
    // config.uart2_rts_gpio = -1;

    config.modbus_enable = false;
    config.modbus_de_gpio = -1;
    config.modbus_address = 0;
    config.modbus_channel = 0;

    config.onewire_enable = false;
    config.onewire_gpio = -1;

    config.pwr_en = false;
    config.pwr_mode = MODE_A;        // A=Continue,B=Wait for receive,C=Send and sleep
    config.pwr_sleep_interval = 600; // sec
    config.pwr_stanby_delay = 300;   // sec
    config.pwr_sleep_activate = ACTIVATE_TRACKER | ACTIVATE_WIFI;
    config.pwr_gpio = -1;
    config.pwr_active = 1;

    for (int i = 0; i < 5; i++)
    {
        config.trk_tlm_avg[i] = false;
        config.trk_tlm_sensor[i] = 0;
        config.trk_tlm_precision[i] = 0;
        config.trk_tlm_offset[i] = 0;
        memset(config.trk_tlm_UNIT[i], 0, 8);
        memset(config.trk_tlm_PARM[i], 0, 10);
        config.trk_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.trk_tlm_EQNS[i][1] = 1; // b
        config.trk_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.digi_tlm_avg[i] = false;
        config.digi_tlm_sensor[i] = 0;
        config.digi_tlm_precision[i] = 0;
        config.digi_tlm_offset[i] = 0;
        memset(config.digi_tlm_UNIT[i], 0, 8);
        memset(config.digi_tlm_PARM[i], 0, 10);
        config.digi_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.digi_tlm_EQNS[i][1] = 1; // b
        config.digi_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.igate_tlm_avg[i] = false;
        config.igate_tlm_sensor[i] = 0;
        config.igate_tlm_precision[i] = 0;
        config.igate_tlm_offset[i] = 0;
        memset(config.igate_tlm_UNIT[i], 0, 8);
        memset(config.igate_tlm_PARM[i], 0, 10);
        config.igate_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.igate_tlm_EQNS[i][1] = 1; // b
        config.igate_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < WX_SENSOR_NUM; i++)
    {
        config.wx_sensor_enable[i] = false;
        config.wx_sensor_avg[i] = true;
        config.wx_sensor_ch[i] = 0;
    }

    // #ifdef OLED
    //     config.i2c_enable = true;
    //     config.i2c_sda_pin = -1;
    //     config.i2c_sck_pin = -1;
    // #else
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
    // #endif

    config.i2c_freq = 400000;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;
    config.i2c1_freq = 100000;

    #ifdef BLUETOOTH
    config.at_cmd_bluetooth = true;
    #else
    config.at_cmd_bluetooth = false;
    #endif
    #ifdef MQTT
    config.at_cmd_mqtt = true;
    #else
    config.at_cmd_mqtt = false;
    #endif
    config.at_cmd_msg = true;
    config.at_cmd_uart = 0;

    config.msg_enable = true;
    config.msg_encrypt = false;
    config.msg_rf = true;
    config.msg_inet = true;
    config.msg_retry = 3;
    config.msg_interval = 30; // second
    config.msg_path = 9;
    sprintf(config.msg_key, "8EC8233E91D59B0164C24E771BA66307");
    sprintf(config.msg_mycall, "NOCALL");

#ifdef TTGO_LORA32_V1
    config.rf_en = true;
    config.rf_type = RF_SX1276;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1; // HPDIO1->33
    config.rf_reset_gpio = 14;
    config.rf_dio0_gpio = 26;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 4;
    config.i2c_sck_pin = 15;
    config.pwr_gpio = -1;
    config.pwr_active = 0;
#elif defined(TTGO_LORA32_V1_6)
    config.rf_en = true;
    config.rf_type = RF_SX1276;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 33; // HPDIO1->33
    config.rf_dio2_gpio = 32; // HPDIO2->32
    config.rf_reset_gpio = 23;
    config.rf_dio0_gpio = 26;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 22;
    config.pwr_gpio = -1;
    config.pwr_active = 0;
#elif defined(TTGO_LORA32_V21)
    config.rf_en = true;
    config.rf_type = RF_SX1278;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio0_gpio = 26;
    config.rf_dio1_gpio = 33; // HPDIO1->33
    config.rf_dio2_gpio = 32; // HPDIO2->32
    config.rf_reset_gpio = 23;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 22;
    config.pwr_gpio = -1;
    config.pwr_active = 0;
#elif defined(LORA_TRACKER)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 3;
    config.rf_reset_gpio = 5;
    config.rf_dio0_gpio = 4;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 6;
    config.rf_mosi_gpio = 7;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.pwr_gpio = 2;
    config.pwr_active = 0;
    config.oled_enable = false;
    config.i2c_enable = false;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 20;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 19;
    config.uart1_tx_gpio = -1;
    config.uart1_rts_gpio = -1;
    config.uart0_enable = false;
    config.trk_gps = true;
    sprintf(config.wifi_ap_ssid, "LoRaTracker");
    config.sensor[0].enable = true;
    config.sensor[0].port = 2;
    config.sensor[0].address = 0;
    config.sensor[0].samplerate = 10;
    config.sensor[0].averagerate = 600;
    config.sensor[0].eqns[0] = 0; // a
    config.sensor[0].eqns[1] = 0.00768F; // b
    config.sensor[0].eqns[2] = 0; // c
    config.sensor[0].type = 27;
    sprintf(config.sensor[0].parm, "Battery");
    sprintf(config.sensor[0].unit, "V");

    config.sensor[1].enable = true;
    config.sensor[1].port = 18;
    config.sensor[1].address = 0;
    config.sensor[1].samplerate = 10;
    config.sensor[1].averagerate = 600;
    config.sensor[1].eqns[0] = 0; // a
    config.sensor[1].eqns[1] = 1; // b
    config.sensor[1].eqns[2] = 0; // c
    config.sensor[1].type = 25;
    sprintf(config.sensor[1].parm, "Satellite");
    config.sensor[1].unit[0]=0;
    
    config.trk_interval = 10;
    config.trk_tlm_avg[0] = false;
    config.trk_tlm_sensor[0] = 1;
    config.trk_tlm_precision[0] = 2;
    config.trk_tlm_offset[0] = 0;
    sprintf(config.trk_tlm_UNIT[0], "V");
    sprintf(config.trk_tlm_PARM[0], "BAT");
    config.trk_tlm_EQNS[0][0] = 0;    // a av2 + bv + c
    config.trk_tlm_EQNS[0][1] = 0.01; // b
    config.trk_tlm_EQNS[0][2] = 0;    // c

