nakhonthai/ESP32APRS_LoRa/src/main.cpp
    config.trk_tlm_avg[1] = false;
    config.trk_tlm_sensor[1] = 2;
    config.trk_tlm_precision[1] = 0;
    config.trk_tlm_offset[1] = 0;
    sprintf(config.trk_tlm_UNIT[1], "");
    sprintf(config.trk_tlm_PARM[1], "SAT");
    config.trk_tlm_EQNS[1][0] = 0;    // a av2 + bv + c
    config.trk_tlm_EQNS[1][1] = 1; // b
    config.trk_tlm_EQNS[1][2] = 0;    // c
    char strCID[13];
	uint64_t chipid = ESP.getEfuseMac();
	sprintf(strCID, "0%03X", (uint16_t)(chipid >> 28) & 0x000FFFFF);
    sprintf(config.igate_mycall,"%s",strCID);
    sprintf(config.trk_mycall,"%s",strCID);
    sprintf(config.digi_mycall,"%s",strCID);
    sprintf(config.msg_mycall,"%s",strCID);
    sprintf(config.tlm0_mycall,"%s",strCID);
    sprintf(config.wx_mycall,"%s",strCID);
#elif defined(HT_CT62)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 3;
    config.rf_reset_gpio = 5;
    config.rf_dio0_gpio = 4;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 6;
    config.rf_mosi_gpio = 7;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.pwr_gpio = -1;
    config.pwr_active = 1;
    config.oled_enable = false;
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
#elif defined(ESP32C3_MINI)
    config.rf_en = false;
    config.rf_type = RF_SX1268;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1;
    config.rf_reset_gpio = -1;
    config.rf_dio0_gpio = 7;
    config.rf_nss_gpio = 1;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 4;
    config.rf_mosi_gpio = 3;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 20;
    config.uart0_tx_gpio = 21;
    config.i2c_enable = true;
    config.i2c_sda_pin = 5;
    config.i2c_sck_pin = 6;
    config.pwr_gpio = 8;
    config.pwr_active = 0;
#elif defined(ESP32_C6_DEVKIT)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 3;
    config.rf_reset_gpio = 5;
    config.rf_dio0_gpio = 4;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 6;
    config.rf_mosi_gpio = 7;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.pwr_gpio = -1;
    config.pwr_active = 1;
#elif defined(ESP32_DIY_LoRa_GPS)
    config.rf_en = true;
    config.rf_type = RF_SX1278;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 33; // HPDIO1->33
    config.rf_reset_gpio = 14;
    config.rf_dio0_gpio = 26;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 4;
    config.i2c_sck_pin = 15;
    config.pwr_gpio = 21;
    config.pwr_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 12;
    config.uart1_tx_gpio = -1;
    config.uart1_rts_gpio = -1;
#elif defined(TTGO_T_Beam_V1_2)
    config.rf_en = true;
    config.rf_type = RF_SX1278;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1;
    config.rf_reset_gpio = 23;
    config.rf_dio0_gpio = 26;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    // config.gnss_enable = true;
    // config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 34;
    config.uart1_tx_gpio = 12;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 13;
    config.i2c_sck_pin = 14;
    config.i2c1_enable = true;
    config.i2c1_sda_pin = PMU_I2C_SDA;
    config.i2c1_sck_pin = PMU_I2C_SCL;
    config.at_cmd_msg = true;
    config.at_cmd_uart = 2;
#elif defined(T_BEAM_S3_SUPREME)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 1;
    config.rf_reset_gpio = 5;
    config.rf_dio0_gpio = 4;
    config.rf_nss_gpio = 10;
    config.rf_sclk_gpio = 12;
    config.rf_miso_gpio = 13;
    config.rf_mosi_gpio = 11;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 9;
    config.uart1_tx_gpio = 8;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
    config.i2c1_enable = true;
    config.i2c1_sda_pin = PMU_I2C_SDA;
    config.i2c1_sck_pin = PMU_I2C_SCL;
    config.at_cmd_msg = true;
    config.at_cmd_uart = 4;
#elif defined(T_BEAM_S3_BPF)
    config.rf_en = true;
    config.rf_type = RF_SX1278;
    config.rf_freq = 144.410;
    config.rf_freq_offset = 0;
    config.rf_bw = 10.4F;
    config.rf_sf = 8;
    config.rf_cr = 5;
    config.rf_power = 20;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 21;
    config.rf_reset_gpio = 18;
    config.rf_dio0_gpio = 14;
    config.rf_nss_gpio = 1;
    config.rf_sclk_gpio = 12;
    config.rf_miso_gpio = 13;
    config.rf_mosi_gpio = 11;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = false;
    config.uart0_rx_gpio = 44;
    config.uart0_tx_gpio = 43;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 5;
    config.uart1_tx_gpio = 6;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = PMU_I2C_SDA;
    config.i2c_sck_pin = PMU_I2C_SCL;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;    
    config.oled_enable = true;
    config.at_cmd_msg = true;
    config.at_cmd_uart = 4;
#elif defined(HELTEC_V3_GPS)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_dio0_gpio = 13;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 9;
    config.rf_miso_gpio = 11;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    // config.gnss_enable = true;
    // config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 19;
    config.uart1_tx_gpio = 20;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
    config.pwr_gpio = 36;
    config.pwr_active = 0;
    config.at_cmd_msg = true;
    config.at_cmd_uart = 2;
#elif defined(APRS_LORA_HT)
    config.rf_en = true;
    config.rf_type = RF_SX1268;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 45;
    config.rf_reset_gpio = 11;
    config.rf_dio0_gpio = 14;
    config.rf_nss_gpio = 17;
    config.rf_sclk_gpio = 18;
    config.rf_miso_gpio = 8;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 44;
    config.uart1_tx_gpio = 43;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 47;
    config.pwr_gpio = 41;
    config.pwr_active = 1;
    sprintf(config.wifi_ap_ssid, "LoRa_HT");
    sprintf(config.wifi_ap_pass, "aprsthnetwork");
    config.at_cmd_msg = true;
    config.at_cmd_uart = 4;
#elif defined(HELTEC_HTIT_TRACKER)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_dio0_gpio = 13;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 9;
    config.rf_miso_gpio = 11;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 115200;
    config.uart1_rx_gpio = 33;
    config.uart1_tx_gpio = 34;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
    config.pwr_gpio = 3;
    config.pwr_active = 1;
    config.at_cmd_msg = true;
    config.at_cmd_uart = 4;
#elif defined(APRS_LORA_DONGLE)
    config.rf_en = true;
    config.rf_type = RF_SX1278;
#ifdef VHF
    config.rf_freq = 144.410;
    config.rf_freq_offset = 1300;
    config.rf_bw = 10.4F;
    config.rf_sf = 8;
    config.rf_cr = 5;
    config.rf_power = 20;
#endif
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_dio0_gpio = 13;
    config.rf_nss_gpio = 11;
    config.rf_sclk_gpio = 18;
    config.rf_miso_gpio = 8;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart0_enable = true;
    config.uart0_baudrate = 9600;
    config.uart0_rx_gpio = 44;
    config.uart0_tx_gpio = 43;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 4;
    config.uart1_tx_gpio = 5;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 47;
    config.pwr_gpio = 17;
    config.pwr_active = 1;
    config.at_cmd_msg = true;
    config.at_cmd_uart = 4;
#elif defined(NAWS4)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1;
    config.rf_reset_gpio = 9;
    config.rf_dio0_gpio = 7;
    config.rf_nss_gpio = 17;
    config.rf_sclk_gpio = 11;
    config.rf_miso_gpio = 15;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.rf1_tx_gpio = -1; // LORA 2 ANTENNA TX ENABLE
    config.rf1_rx_gpio = -1;
    config.rf1_dio1_gpio = 5;
    config.rf1_reset_gpio = 46;
    config.rf1_dio0_gpio = 6;
    config.rf1_nss_gpio = 16;
    config.rf1_sclk_gpio = 11;
    config.rf1_miso_gpio = 15;
    config.rf1_mosi_gpio = 10;
    config.rf1_tx_active = 1;
    config.rf1_rx_active = 1;
    config.rf1_nss_active = 0;
    config.rf1_reset_active = 0;
    config.gnss_enable = false;
    config.gnss_channel = 3;
    config.uart0_enable = true;
    config.uart0_rx_gpio = 44;
    config.uart0_tx_gpio = 43;
    config.uart1_enable = false;
    config.uart1_baudrate = 115200;
    config.uart1_rx_gpio = 42;
    config.uart1_tx_gpio = 41;
    config.uart1_rts_gpio = -1;
    config.uart2_enable = true;
    config.uart2_baudrate = 9600;
    config.uart2_rx_gpio = 38;
    config.uart2_tx_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 13;
    config.i2c_sck_pin = 14;
    config.i2c1_enable = true;
    config.i2c1_sda_pin = 21;
    config.i2c1_sck_pin = 47;
    config.oled_enable = false;
    //"Sensor":true,15,0,60,600,0,1,0,6,"Temperature","°C",true,15,0,60,600,0,1,0,7,"Humidity","%RH",true,13,118,60,600,0,1,0,8,"Pressure","hPa",true,5,1,60,600,0,0.2,0,11,"Rain","mm",true,6,2,60,600,0,0.06,0,9,"WindSpeed","kPh",true,29,0,60,600,0,0.00271,0,10,"WindCourse","°",true,29,1,10,600,0,0.01412,0,12,"Luminosity","W/m³",true,27,0,60,600,0,1,0,19,"Voltage","V",true,27,0,60,600,0,0.001,0,20,"Current","A",true,29,3,10,600,0,0.00018,0,19,"Voltage","V"]
    config.sensor[0].enable = true;
    config.sensor[0].port = 15;
    config.sensor[0].address = 0;
    config.sensor[0].samplerate = 60;
    config.sensor[0].averagerate = 600;
    config.sensor[0].eqns[0] = 0; // a
    config.sensor[0].eqns[1] = 1; // b
    config.sensor[0].eqns[2] = 0; // c
    config.sensor[0].type = 6;
    sprintf(config.sensor[0].parm, "Temperature");
    sprintf(config.sensor[0].unit, "°C");
    config.sensor[1].enable = true;
    config.sensor[1].port = 15; 
    config.sensor[1].address = 1;
    config.sensor[1].samplerate = 60;
    config.sensor[1].averagerate = 600;
    config.sensor[1].eqns[0] = 0; // a
    config.sensor[1].eqns[1] = 1; // b
    config.sensor[1].eqns[2] = 0; // c
    config.sensor[1].type = 7;
    sprintf(config.sensor[1].parm, "Humidity");
    sprintf(config.sensor[1].unit, "%RH");
    config.sensor[2].enable = true;
    config.sensor[2].port = 13;
    config.sensor[2].address = 2;
    config.sensor[2].samplerate = 60;
    config.sensor[2].averagerate = 600;
    config.sensor[2].eqns[0] = 0; // a
    config.sensor[2].eqns[1] = 1; // b
    config.sensor[2].eqns[2] = 0; // c
    config.sensor[2].type = 8;
    sprintf(config.sensor[2].parm, "Pressure");
    sprintf(config.sensor[2].unit, "hPa");
    config.sensor[3].enable = true;
    config.sensor[3].port = 5;
    config.sensor[3].address = 1;
    config.sensor[3].samplerate = 60;
    config.sensor[3].averagerate = 600;
    config.sensor[3].eqns[0] = 0; // a
    config.sensor[3].eqns[1] = 0.2; // b
    config.sensor[3].eqns[2] = 0; // c
    config.sensor[3].type = 11;
    sprintf(config.sensor[3].parm, "Rain");
    sprintf(config.sensor[3].unit, "mm");
    config.sensor[4].enable = true; //Davis Anemometer PN#6410
    config.sensor[4].port = 6;
    config.sensor[4].address = 2;
    config.sensor[4].samplerate = 60;
    config.sensor[4].averagerate = 600;
    config.sensor[4].eqns[0] = 0; // a
    config.sensor[4].eqns[1] = 0.06; // b
    config.sensor[4].eqns[2] = 0; // c
    config.sensor[4].type = 9;
    sprintf(config.sensor[4].parm, "WindSpeed");
    sprintf(config.sensor[4].unit, "kPh");
    config.sensor[5].enable = true;
    config.sensor[5].port = 29;
    config.sensor[5].address = 0;
    config.sensor[5].samplerate = 60;
    config.sensor[5].averagerate = 600;
    config.sensor[5].eqns[0] = 0; // a
    config.sensor[5].eqns[1] = 0.00271; // b
    config.sensor[5].eqns[2] = 0; // c
    config.sensor[5].type = 10;
    sprintf(config.sensor[5].parm, "WindCourse");
    sprintf(config.sensor[5].unit, "°");
    config.sensor[6].enable = true;
    config.sensor[6].port = 29;
    config.sensor[6].address = 1;
    config.sensor[6].samplerate = 60;
    config.sensor[6].averagerate = 600;
    config.sensor[6].eqns[0] = 0; // a
    config.sensor[6].eqns[1] = 0.01412; // b
    config.sensor[6].eqns[2] = 0; // c
    config.sensor[6].type = 12;
    sprintf(config.sensor[6].parm, "Luminosity");
    sprintf(config.sensor[6].unit, "W/m³");
    config.sensor[7].enable = true;
    config.sensor[7].port = 27;
    config.sensor[7].address = 0;
    config.sensor[7].samplerate = 60;
    config.sensor[7].averagerate = 600;
    config.sensor[7].eqns[0] = 0; // a
    config.sensor[7].eqns[1] = 1; // b
    config.sensor[7].eqns[2] = 0; // c
    config.sensor[7].type = 19;
    sprintf(config.sensor[7].parm, "Voltage");
    sprintf(config.sensor[7].unit, "V");
    config.sensor[8].enable = true;
    config.sensor[8].port = 27;
    config.sensor[8].address = 0;
    config.sensor[8].samplerate = 60;
    config.sensor[8].averagerate = 600;
    config.sensor[8].eqns[0] = 0; // a
    config.sensor[8].eqns[1] = 1; // b
    config.sensor[8].eqns[2] = 0; // c
    config.sensor[8].type = 20;
    sprintf(config.sensor[8].parm, "Current");
    sprintf(config.sensor[8].unit, "A");
    config.sensor[9].enable = true;
    config.sensor[9].port = 29;
    config.sensor[9].address = 3;
    config.sensor[9].samplerate = 60;
    config.sensor[9].averagerate = 600;
    config.sensor[9].eqns[0] = 0; // a
    config.sensor[9].eqns[1] = 0.00018; // b
    config.sensor[9].eqns[2] = 0; // c
    config.sensor[9].type = 19;
    sprintf(config.sensor[9].parm, "Voltage");
    sprintf(config.sensor[9].unit, "V");

#endif

    config.counter0_enable = false;
    config.counter0_active = 0;
    config.counter0_gpio = -1;

    config.counter1_enable = false;
    config.counter1_active = 0;
    config.counter1_gpio = -1;

    config.ext_tnc_enable = false;
    config.ext_tnc_channel = 0;
    config.ext_tnc_mode = 2;

    sprintf(config.path[0], "TRACE2-2");
    sprintf(config.path[1], "WIDE1-1");
    sprintf(config.path[2], "WIDE1-1,WIDE2-1");
    sprintf(config.path[3], "RFONLY");

