nakhonthai/ESP32APRS_LoRa/src/main.cpp
bool pkgTxDuplicate(AX25Msg ax25)
{
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    char callsign[12];
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            if (txQueue[i].Channel & INET_CHANNEL)
                continue;

            if (ax25.src.ssid > 0)
                sprintf(callsign, "%s-%d", ax25.src.call, ax25.src.ssid);
            else
                sprintf(callsign, "%s", ax25.src.call);
            if (strncmp(&txQueue[i].Info[0], callsign, strlen(callsign)) >= 0) // Check duplicate src callsign
            {
                char *ecs1 = strstr(txQueue[i].Info, ":");
                if (ecs1 == NULL)
                    continue;
                ;
                if (strncmp(ecs1, (const char *)ax25.info, strlen(ecs1)) >= 0)
                { // Check duplicate aprs info
                    txQueue[i].Active = false;
                    psramBusy = false;
                    return true;
                }
            }
        }
    }

    psramBusy = false;
    return false;
}

int pkgTxCount()
{
    int count = 0;
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            count++;
        }
    }
    return count;
}

bool pkgTxPush(const char *info, size_t len, int dly, uint8_t Ch)
{
    char *ecs = strstr(info, ">");
    if (ecs == NULL)
        return false;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    // for (int i = 0; i < PKGTXSIZE; i++)
    // {
    //   if (txQueue[i].Active)
    //   {
    //     if ((strncmp(&txQueue[i].Info[0], info, info - ecs)==0)) //Check src callsign
    //     {
    //       // strcpy(&txQueue[i].Info[0], info);
    //       memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
    //       memcpy(&txQueue[i].Info[0], info, len);
    //       txQueue[i].Delay = dly;
    //       txQueue[i].timeStamp = millis();
    //       psramBusy = false;
    //       return true;
    //     }
    //   }
    // }

    // Add
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active == false)
        {
            if (len > sizeof(txQueue[i].Info))
                len = sizeof(txQueue[i].Info);
            memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
            memcpy(&txQueue[i].Info[0], info, len);
            txQueue[i].length = len;
            txQueue[i].Delay = dly;
            txQueue[i].Active = true;
            txQueue[i].timeStamp = millis();
            txQueue[i].Channel = Ch;
            break;
        }
    }
    psramBusy = false;
    return true;
}

bool pkgTxSend()
{
//   if (getReceive())
//     return false;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    // char info[300];
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            int decTime = millis() - txQueue[i].timeStamp;
            if (decTime > txQueue[i].Delay)
            {
                if (txQueue[i].Channel & INET_CHANNEL)
                {
                    if (config.igate_en == false)
                    {
                        txQueue[i].Channel &= ~INET_CHANNEL;
                    }
                    else
                    {
                        if (!(txQueue[i].Channel & RF_CHANNEL)) // Skip RF Channel
                        {
                            if (aprsClient.connected())
                            {
                                if((config.aprs_port != 24580) && (txQueue[i].Info[0] == '0' || txQueue[i].Info[0] == '1')) // unidentified callsign to use CB Radio
                                {
                                    String packet = "user APRSCB pass 9123\n" + String(txQueue[i].Info)+ "\r\n"; // Send packet to APRS-IS (tcp)
                                    aprsUDP.beginPacket("aprs.nakhonthai.net", 8081); // Send packet to APRS-IS (udp)
                                    aprsUDP.write((const uint8_t *)packet.c_str(), packet.length()); // Send binary frame packet to APRS-IS (udp)
                                    aprsUDP.endPacket();
                                }else{
                                    aprsClient.write(txQueue[i].Info, txQueue[i].length); // Send binary frame packet to APRS-IS (aprsc)
                                    aprsClient.write("\r\n");                             // Send CR LF the end frame packet
                                }
                                txQueue[i].Channel &= ~INET_CHANNEL;
                                log_d("TX->INET: %s", txQueue[i].Info);
                                continue;
                            }
                        }
                    }
                }

                if (config.rf_mode == RF_MODE_AIS) // AIS for RX Only
                {
                    txQueue[i].Channel &= ~RF_CHANNEL;
                }
                else
                {
                    if (txQueue[i].Channel & RF_CHANNEL)
                    {
                        if (config.rf_en)
                        {
                            char *info = (char *)calloc(txQueue[i].length + 1, sizeof(char));
                            if (info)
                            {
                                memset(info, 0, txQueue[i].length + 1);
                                memcpy(info, txQueue[i].Info, txQueue[i].length);
                                psramBusy = false;
                                // digitalWrite(config.rf_pwr_gpio, config.rf_power); // RF Power
                                status.txCount++;
                                log_d("TX->RF: %s", txQueue[i].Info);
                                // APRS_sendTNC2Pkt("<\xff\x01"+String(info)); // Send packet to RF
                                APRS_sendTNC2Pkt((uint8_t *)info, txQueue[i].length);                                
                                //igateTLM.TX++;
                                
                                if (config.trk_en)
                                {
                                    timeSleep = millis() + 5000;
                                    // Sleep_Activate &= ~ACTIVATE_TRACKER;
                                }

                                // digitalWrite(config.rf_pwr_gpio, 0); // set RF Power Low
                                free(info);
                                txQueue[i].Channel &= ~RF_CHANNEL;
                                // if (txQueue[i].Channel & INET_CHANNEL)
                                // {
                                // }
                            }
                        }
                    }
                }
            }

            if (decTime > 60000 || decTime < 0) // TX Timeout
            {
                txQueue[i].Channel = 0;
                txQueue[i].Active = false;
                txQueue[i].Delay = 0;
                txQueue[i].timeStamp = 0;
                memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
            }
        }
    }
    psramBusy = false;
    return true;
}

uint8_t *packetData;
// ฟังชั่นถูกเรียกมาจาก ax25_decode
void aprs_msg_callback(struct AX25Msg *msg)
{
    AX25Msg pkg;
    if (afskSync)
    {

        String info((const char *)msg->info);
        // info.getBytes(msg->info,strlen((const char*)msg->info),0);
        int idx = info.lastIndexOf("?RSSI");
        if (idx > 0)
        {
            info.remove(idx, 5);
            info += "[RSSI:" + String((int)rssi) + "dBm] ";
            info.toCharArray((char *)msg->info, info.length(), 0);
            msg->len = info.length() - 1;
        }
        info.clear();
    }
    memcpy(&pkg, msg, sizeof(AX25Msg));
    PacketBuffer.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
    status.rxCount++;
    status.allCount++;
    //igateTLM.RX++;
}

void printTime()
{
    struct tm tmstruct;
    getLocalTime(&tmstruct, 100);
    Serial.print("[");
    Serial.print(tmstruct.tm_hour);
    Serial.print(":");
    Serial.print(tmstruct.tm_min);
    Serial.print(":");
    Serial.print(tmstruct.tm_sec);
    Serial.print("]");
}

uint8_t gwRaw[PKGLISTSIZE][66];
uint8_t gwRawSize[PKGLISTSIZE];
int gwRaw_count = 0, gwRaw_idx_rd = 0, gwRaw_idx_rw = 0;

void pushGwRaw(uint8_t *raw, uint8_t size)
{
    if (gwRaw_count > PKGLISTSIZE)
        return;
    if (++gwRaw_idx_rw >= PKGLISTSIZE)
        gwRaw_idx_rw = 0;
    if (size > 65)
        size = 65;
    memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
    gwRawSize[gwRaw_idx_rw] = size;
    gwRaw_count++;
}

