nakhonthai/ESP32APRS_LoRa/src/main.cpp
uint8_t popGwRaw(uint8_t *raw)
{
    uint8_t size = 0;
    if (gwRaw_count <= 0)
        return 0;
    if (++gwRaw_idx_rd >= PKGLISTSIZE)
        gwRaw_idx_rd = 0;
    size = gwRawSize[gwRaw_idx_rd];
    memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
    if (gwRaw_count > 0)
        gwRaw_count--;
    return size;
}

boolean APRSConnect()
{
    // Serial.println("Connect TCP Server");
    String login = "";
    int cnt = 0;
    uint8_t con = aprsClient.connected();
    // Serial.println(con);
    if (con <= 0)
    {
        if (!aprsClient.connect(config.igate_host, config.aprs_port)) // เชื่อมต่อกับเซิร์ฟเวอร์ TCP
        {
            // Serial.print(".");
            delay(100);
            cnt++;
            if (cnt > 50) // วนร้องขอการเชื่อมต่อ 50 ครั้ง ถ้าไม่ได้ให้รีเทิร์นฟังค์ชั่นเป็น False
                return false;
        }
        // ขอเชื่อมต่อกับ aprsc
        login.clear();
        if (strlen(config.igate_object) >= 3)
        {
            uint16_t passcode = aprsParse.passCode(config.igate_object);
            login = "user " + String(config.igate_object) + " pass " + String(passcode, DEC) + " vers ESP32APRS_LoRa V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.igate_filter);
        }
        else
        {
            uint16_t passcode = aprsParse.passCode(config.igate_mycall);
            if (config.igate_ssid == 0)
                login = "user " + String(config.igate_mycall) + " pass " + String(passcode, DEC) + " vers ESP32APRS_LoRa V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.igate_filter);
            else
                login = "user " + String(config.igate_mycall) + "-" + String(config.igate_ssid) + " pass " + String(passcode, DEC) + " vers ESP32APRS_LoRa V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.igate_filter);
        }
        aprsClient.println(login);
        // Serial.println(login);
        // Serial.println("Success");
        delay(500);
    }
    return true;
}

long oledSleepTimeout = 0;
bool showDisp = false;
RTC_DATA_ATTR uint8_t curTab;

void preTransmission()
{
    pinMode(config.modbus_de_gpio, OUTPUT);
    digitalWrite(config.modbus_de_gpio, 1);
}

void postTransmission()
{
    pinMode(config.modbus_de_gpio, OUTPUT);
    digitalWrite(config.modbus_de_gpio, 0);
}

#ifdef BLUETOOTH
void bluetooth_init()
{
    if (config.bt_master == true)
    {
#if !defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32C6)
        // Initialize BLE stack and Nordic UART service
        NimBLEDevice::init(config.bt_name);
        NimBLEDevice::getAdvertising()->setName(config.bt_name);
        // BLE Auth
        if (config.bt_pin > 0)
        {
            NimBLEDevice::setSecurityAuth(true, true, true); /** bonding, MITM, BLE secure connections */
            NimBLEDevice::setSecurityPasskey(config.bt_pin);
            NimBLEDevice::setSecurityIOCap(BLE_HS_IO_DISPLAY_ONLY); /** Display only passkey */
            log_d("Bluetooth Security: Passkey %d", config.bt_pin);
        }
        NuSerial.begin_uuid(config.bt_uuid, config.bt_uuid_tx, config.bt_uuid_rx, 115200);
#else
#endif
    }
}
#endif

// 3 seconds WDT
#define WDT_TIMEOUT 30

bool AFSKInitAct = false;
unsigned long timeTask;
void setup()
{
    pinMode(19,INPUT);
    pinMode(20,INPUT);
    // byte *ptr;
    int BootReason = esp_reset_reason();
#ifdef BOARD_HAS_PSRAM
    if (psramInit())
    {
        psramAddToHeap();
        pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
        Telemetry = (TelemetryType *)ps_malloc(sizeof(TelemetryType) * TLMLISTSIZE);
        txQueue = (txQueueType *)ps_malloc(sizeof(txQueueType) * PKGTXSIZE);
        msgQueue = (msgType *)ps_malloc(sizeof(msgType) * PKGLISTSIZE);
        // TNC2Raw = (int *)ps_malloc(sizeof(int) * PKGTXSIZE);
    }
    else
    {
        pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
        Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
        txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
        msgQueue = (msgType *)malloc(sizeof(msgType) * PKGLISTSIZE);
    }
#else
    pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
    msgQueue = (msgType *)malloc(sizeof(msgType) * PKGLISTSIZE);
    // TNC2Raw = (int *)malloc(sizeof(int) * PKGTXSIZE);
#endif

    memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
    memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);
    memset(txQueue, 0, sizeof(txQueueType) * PKGTXSIZE);
    memset(msgQueue, 0, sizeof(msgType) * PKGLISTSIZE);

    // pinMode(9, INPUT_PULLUP); // BOOT Button
    if (LED_RX > -1)
        pinMode(LED_RX, OUTPUT);
    if (LED_TX > -1)
        pinMode(LED_TX, OUTPUT);

    // pinMode(0, INPUT);
    // pinMode(1, INPUT);
    //  Set the CPU frequency to 80 MHz for power optimization
    // setCpuFrequencyMhz(80);
    #ifdef NAWS4
    setCpuFrequencyMhz(160);
    #endif

#ifdef APRS_LORA_HT
    pinMode(0, INPUT);
    pinMode(1, INPUT);
    pinMode(2, INPUT);
    pinMode(38, INPUT);
    pinMode(40, INPUT);
    pinMode(48, INPUT);
    pinMode(45, INPUT);
    pinMode(3, ANALOG);
    pinMode(12, INPUT);
    pinMode(13, OUTPUT);
    pinMode(39, OUTPUT);
    digitalWrite(39, LOW);
    analogReadResolution(12);
    analogSetAttenuation(ADC_11db);
#endif

#ifdef HELTEC_HTIT_TRACKER
    pinMode(2, INPUT_PULLUP); // ADC_Ctl
    digitalWrite(2, HIGH);
#elif defined(HELTEC_V3_GPS)
    pinMode(37, INPUT_PULLUP); // ADC_Ctl
    digitalWrite(37, HIGH);
#endif

    // Set up serial port
    // #ifdef CORE_DEBUG_LEVEL
    //Serial.begin(115200); // debug
                          // #else
    //Serial.begin(9600);   // monitor
                          // #endif

    if (!LITTLEFS.begin(FORMAT_LITTLEFS_IF_FAILED))
    {
        log_d("LITTLEFS Mount Failed");
        // return;
    }
    else
    {
        log_d("File system mounted");
        log_d("Total space: %lu\n", LITTLEFS.totalBytes());
        log_d("Use space:  %lu\n\n", LITTLEFS.usedBytes());
    }

    log_d("Start ESP32APRS_LoRa V%s", VERSION);
    // log_d("Push BOOT after 3 sec for Factory Default config.");

    // if (!EEPROM.begin(EEPROM_SIZE))
    // {
    //     log_d("failed to initialise EEPROM"); // delay(100000);
    // }
    // ตรวจสอบคอนฟิกซ์ผิดพลาด
    // ptr = (byte *)&config;
    // EEPROM.readBytes(1, ptr, sizeof(Configuration));
    // uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    // log_d("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
    // if (EEPROM.read(0) != chkSum || EEPROM.read(0) == 0)
    // {
    //     log_d("CRC EEPROM Error!");
    //     log_d("Factory Default");
    //     defaultConfig();
    // }
#ifdef STRIP_PIN
    strip.begin();
    LED_Status(200,200,200);
#endif

