nakhonthai/ESP32APRS_LoRa/src/main.cpp
    if (!LITTLEFS.exists("/default.cfg"))
    {
        log_d("Factory Default");
        defaultConfig();
        saveConfiguration("/default.cfg", config);
    }
    else
    {
        if (!loadConfiguration("/default.cfg", config))
            defaultConfig();
    }
    pinMode(BOOT_PIN, INPUT_PULLUP);

    if (config.ppp_enable)
    {
        if (config.ppp_serial == 0)
        {
            config.uart0_enable = false;
        }
        else if (config.ppp_serial == 1)
        {
            config.uart1_enable = false;
        }
        else if (config.ppp_serial == 2)
        {
            config.uart2_enable = false;
        }
    }

#ifdef STRIP_PIN
    LED_Status(0,0,0);
#endif

#ifdef BUOY
    config.wifi_mode |= WIFI_AP_FIX;
    pinMode(BOOT_PIN, OUTPUT_OPEN_DRAIN);
    digitalWrite(BOOT_PIN, LOW);
    timeLEDoff = 500;
    timeLEDon = 10;
#else

#ifdef BV5DJ_BOARD
    pinMode(BUTTON_LEFT, INPUT_PULLUP);
    pinMode(BUTTON_RIGHT, INPUT_PULLUP);
    pinMode(BUTTON_UP, INPUT_PULLUP);
    pinMode(BUTTON_DOWN, INPUT_PULLUP);
    pinMode(SD_CS, OUTPUT);
    pinMode(GPS_PPS, INPUT_PULLUP);
    pinMode(KEEP_ALIVE, INPUT_PULLUP);
#endif
#endif

    // if (BootReason == ESP_RST_SW)
    // {
    //     delay(1000);
    //     // LED_Status(0, 0, 0);

    //     if (digitalRead(BOOT_PIN) == LOW)
    //     {
    //         defaultConfig();
    //         log_d("Manual Default configure!");
    //         while (digitalRead(BOOT_PIN) == LOW)
    //         {
    //             delay(500);
    //             // LED_Status(255, 255, 255);
    //             // delay(500);
    //             // LED_Status(0, 0, 0);
    //         }
    //     }
    // }

    Sleep_Activate = config.pwr_sleep_activate;
    PowerOn();
#if SOC_I2C_NUM > 1
    if (config.i2c1_enable)
    {
        Wire1.begin(config.i2c1_sda_pin, config.i2c1_sck_pin, config.i2c1_freq);
    }
#endif

#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2) || defined(NAWS4)
    setupPower();
#endif

    if (config.oled_enable)
    {
#ifdef OLED

        config.i2c_enable = true;
        // pinMode(OLED_RESET,OUTPUT);
        // digitalWrite(OLED_RESET,HIGH);
        // delay(300);
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);

        // int i2c_timeout = 0;
        // while (i2c_busy)
        // {
        //     delay(10);
        //     if (++i2c_timeout > 20)
        //         break;
        // }
        i2c_busy = true;
// by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
#ifdef SH1106
        display.begin(SH1106_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1);
#else
        display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1, false);
#endif

        // Initialising the UI will init the display too.
        if (BootReason != ESP_RST_DEEPSLEEP)
        {
            if (config.disp_flip)
                display.setRotation(2);
            else
                display.setRotation(0);
            display.clearDisplay();
            display.setTextColor(WHITE);

            display.setTextSize(1);
            display.setFont(&FreeSansBold9pt7b);

#ifdef SSD1306_72x40
            if (config.disp_flip)
                display.setRotation(2);
            else
                display.setRotation(0);
            display.clearDisplay();
            display.drawYBitmap(0, -4, LOGO, 48, 48, WHITE);
            display.display();
            delay(1000);
            LED_Status(255, 0, 0);
            display.fillRect(50, 28, 20, 10, WHITE);
            display.display();
            delay(1000);
            LED_Status(0, 255, 0);
            display.fillRect(50, 16, 20, 10, WHITE);
            display.display();
            delay(1000);
            display.fillRect(50, 4, 20, 10, WHITE);
            display.display();
            delay(1000);
            // display.clearDisplay();
            // display.setCursor(3, 19);
            // display.printf("V%s%c", VERSION, VERSION_BUILD);
            // display.setCursor(5, 38);
            // display.print("@2024");
            // display.display();
            // delay(1000);
// display.drawYBitmap(0, 0, LOGO, 48, 48, WHITE);
// delay(3000);
#else

            display.setCursor(0, 15);
            display.print("APRS");
            display.setCursor(65, 32);
            display.print("LoRa");
            display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
            display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

            display.setFont();
            display.setTextColor(WHITE);

            display.setCursor(60, 5);
            display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
            display.setCursor(52, 42);
            display.print("BOOT Wait");
            display.display();
            // display.setCursor(60, 40);
            // display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
            // display.setCursor(65, 5);
            // display.print("Copy@2024");
            // display.display();

            delay(1000);
            LED_Status(255, 0, 0);
            display.fillRect(49, 49, 78, 8, 0);
            display.setCursor(70, 52);
            display.print("After 3");
            display.display();
            delay(1000);
            LED_Status(0, 255, 0);
            display.fillRect(49, 49, 78, 8, 0);
            display.setCursor(70, 52);
            display.print("After 2");
            display.display();
            delay(1000);
            display.fillRect(49, 49, 78, 8, 0);
            display.setCursor(70, 52);
            display.print("After 1");
            display.display();
            delay(1000);
#endif

//             if (digitalRead(BOOT_PIN) == LOW)
//             {
//                 defaultConfig();
//                 log_d("Manual Default configure!");
// #ifdef OLED
//                 display.clearDisplay();
// #ifdef SSD1306_72x40
//                 display.setCursor(5, 25);
//                 display.print("RST!");
// #else
//                 display.setCursor(10, 22);
//                 display.print("Factory Reset!");
// #endif
//                 display.display();
// #endif
//                 while (digitalRead(BOOT_PIN) == LOW)
//                 {
//                     delay(500);
//                     LED_Status(255, 255, 255);
//                     delay(500);
//                     LED_Status(0, 0, 0);
//                 }
//             }
        }
        else
        {
            showDisp = true;
        }
        display.setFont();
        display.setTextColor(WHITE);
        i2c_busy = false;
#else
#ifdef ST7735_160x80
        if (config.i2c_enable)
        {
            Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
            i2c_busy = false;
        }
        TFT_SPI.begin(ST7735_SCLK_Pin, -1, ST7735_MOSI_Pin, ST7735_CS_Pin);
        TFT_SPI.setFrequency(40000000);
        ledcAttach(ST7735_LED_K_Pin, 10000, 8);
        ledcWrite(ST7735_LED_K_Pin, config.disp_brightness);
        display.initR(ST7735_MODEL); // initialize a ST7735S chip, mini display
        if (config.disp_flip)
            display.setRotation(3);
        else
            display.setRotation(1);
#ifdef NV3022B3
        uint8_t madctl = 0;
        madctl = ST77XX_MADCTL_MY | ST77XX_MADCTL_RGB;
        display.sendCommand(ST77XX_MADCTL, &madctl, 1);
        display.invertDisplay(true);
#else
        display.invertDisplay(false);
#endif
        display.setAddrWindow(0, 0, 160, 80);
        display.enableDisplay(true);
        if (BootReason != ESP_RST_DEEPSLEEP)
        {
            display.fillScreen(ST77XX_BLACK);
            display.setTextSize(1);
            display.setFont(&FreeSansBold9pt7b);

