nakhonthai/ESP32APRS_LoRa/src/main.cpp
            display.setTextColor(ST77XX_YELLOW);
            display.setCursor(10, 15);
            display.print("APRS");
            display.fillRoundRect(72, 16, 75, 22, 3, ST77XX_WHITE);
            display.setTextColor(ST77XX_RED);
            display.setCursor(85, 32);
            display.print("LoRa");
            display.drawYBitmap(10, 26, LOGO, 48, 48, ST77XX_BLUE);
            // display.drawRoundRect(72, 16, 75, 22, 3, ST77XX_WHITE);

            display.setFont();
            display.setTextColor(ST77XX_GREEN);

            display.setCursor(80, 50);
            display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
            display.setCursor(85, 5);
            display.print("Copy@2024");
            display.display();

            delay(1000);
            LED_Status(255, 0, 0);
            display.fillRect(69, 59, 50, 8, 0);
            display.setCursor(90, 60);
            display.print("3 Sec");
            display.display();

            delay(1000);
            //digitalWrite(LED_RX, HIGH);
            LED_Status(0, 255, 0);
            display.fillRect(69, 59, 50, 8, 0);
            display.setCursor(90, 60);
            display.print("2 Sec");
            display.display();

            delay(1000);
            LED_Status(0, 0, 255);
            display.fillRect(69, 59, 50, 8, 0);
            display.setCursor(90, 60);
            display.print("1 Sec");
            display.display();

            delay(1000);
            LED_Status(0, 0, 0);

//             if (digitalRead(BOOT_PIN) == LOW)
//             {
//                 defaultConfig();
//                 log_d("Manual Default configure!");
// #ifdef ST7735_160x80
//                 display.fillRect(69, 59, 50, 8, 0);
//                 display.setCursor(70, 60);
//                 display.print("Factory Reset!");
//                 display.display();
// #endif
//                 while (digitalRead(BOOT_PIN) == LOW)
//                 {
//                     delay(500);
//                     LED_Status(255, 255, 255);
//                     delay(500);
//                     LED_Status(0, 0, 0);
//                 }
//             }
        }
        else
        {
            showDisp = true;
        }
        LED_Status(0, 0, 0);
#endif

        
#endif
    }else{
        if (!config.pwr_en)
        {
            LED_Status(200, 0, 0);
            delay(1000);
            LED_Status(0, 200, 0);
            delay(1000);
            LED_Status(0, 0, 200);
            delay(1000);
        }
    }
    LED_Status(0, 0, 0);
    if (BootReason != ESP_RST_DEEPSLEEP)
    {
        pinMode(BOOT_PIN, INPUT_PULLUP);
                if (digitalRead(BOOT_PIN) == LOW)
                {
                    defaultConfig();
                    log_d("Manual Default configure!");
        #ifdef OLED
                display.clearDisplay();
#ifdef SSD1306_72x40
                display.setCursor(5, 25);
                display.print("RST!");
#else
                display.setCursor(10, 22);
                display.print("Factory Reset!");
#endif
                display.display();
#endif
                    while (digitalRead(BOOT_PIN) == LOW)
                    {
                        delay(500);
                        LED_Status(255, 255, 255);
                        delay(500);
                        LED_Status(0, 0, 0);
                    }
                }
    }
    LED_Status(0, 0, 0);

#if ARDUINO_USB_MODE
        Serial.begin(115200);
#endif

    if(config.uart0_enable)
    {
        
    pinMode(config.uart0_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
    pinMode(config.uart0_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
        Serial0.begin(config.uart0_baudrate, SERIAL_8N1, config.uart0_rx_gpio, config.uart0_tx_gpio);
    }
    if (config.uart1_enable)
    {
        
        pinMode(config.uart1_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
        pinMode(config.uart1_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
        Serial1.begin(config.uart1_baudrate, SERIAL_8N1, config.uart1_rx_gpio, config.uart1_tx_gpio);
    }
    #if SOC_UART_NUM > 2
    pinMode(config.uart2_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
    pinMode(config.uart2_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
    Serial2.begin(config.uart2_baudrate, SERIAL_8N1, config.uart2_rx_gpio, config.uart2_tx_gpio);
    #endif

    if (config.modbus_enable)
    {
        if (config.modbus_channel == 1)
        {
            modbus.begin(config.modbus_address, Serial);
        }
        else if (config.modbus_channel == 2)
        {
            modbus.begin(config.modbus_address, Serial1);
        }
        else if (config.modbus_channel == 3)
        {
            // modbus.begin(config.modbus_address, Serial2);
        }
        if (config.modbus_channel > 0 && config.modbus_channel < 4)
        {
            // Modbus slave ID 1
            if (config.modbus_de_gpio > -1)
            {
                pinMode(config.modbus_de_gpio, OUTPUT);
                // Callbacks allow us to configure the RS485 transceiver correctly
                modbus.preTransmission(preTransmission);
                modbus.postTransmission(postTransmission);
            }
        }
    }

    log_d("Free heap: %d", ESP.getHeapSize());

    if (config.oled_enable)
    {
#ifdef OLED
        int i2c_timeout = 0;
        while (i2c_busy)
        {
            delay(10);
            if (++i2c_timeout > 20)
                break;
        }
        i2c_busy = true;
        display.clearDisplay();
        display.setTextSize(1);
        display.display();
        i2c_busy = false;
#elif defined(ST7735_160x80)
        display.fillScreen(ST77XX_BLACK);
        display.setTextSize(1);
        display.display();
#endif
    }

    showDisp = true;
    oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    // enableLoopWDT();
    // enableCore0WDT();
    // enableCore1WDT();
//     esp_task_wdt_config_t twdt_config = {
//         .timeout_ms = 30000,                             // 30 seconds
//         .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Bitmask of all cores
//         .trigger_panic = false,
//     };
// #if !defined(CONFIG_IDF_TARGET_ESP32C6)
//     esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
// #else
//     esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
// #endif

    oledSleepTimeout = millis() + (config.oled_timeout * 1000);
    AFSKInitAct = false;

    if (config.gnss_enable)
    {
        if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
        {
            if (strstr("AT", config.gnss_at_command) != NULL)
            {
                if (config.gnss_channel == 1)
                {
                    Serial0.println(config.gnss_at_command);
                }
                else if (config.gnss_channel == 2)
                {
                    Serial1.println(config.gnss_at_command);
                }
                #if SOC_UART_NUM > 2
                else if (config.gnss_channel == 3)
                {
                    Serial2.println(config.gnss_at_command);
                }
                #endif
            }
        }
    }

