nakhonthai/ESP32APRS_LoRa/src/main.cpp
    StandByTick = millis() + (config.pwr_stanby_delay * 1000);

    // Task 1
    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        4096,            /* Stack size in words */
        NULL,            /* Task input parameter */
        2,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        0);              /* Core where the task should run */

// Task 2
#ifdef __XTENSA__
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        8192,               /* Stack size in words */
        NULL,               /* Task input parameter */
        0,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        1);                 /* Core where the task should run */

    xTaskCreatePinnedToCore(
        taskSensor,        /* Function to implement the task */
        "taskSensor",      /* Name of the task */
        4096,              /* Stack size in words */
        NULL,              /* Task input parameter */
        1,                 /* Priority of the task */
        &taskSensorHandle, /* Task handle. */
        1);                /* Core where the task should run */
#else
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        12000,              /* Stack size in words */
        NULL,               /* Task input parameter */
        1,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        0);                 /* Core where the task should run */

    xTaskCreatePinnedToCore(
        taskSensor,        /* Function to implement the task */
        "taskSensor",      /* Name of the task */
        4096,              /* Stack size in words */
        NULL,              /* Task input parameter */
        4,                 /* Priority of the task */
        &taskSensorHandle, /* Task handle. */
        0);                /* Core where the task should run */
#endif

    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        4096,                /* Stack size in words */
        NULL,                /* Task input parameter */
        3,                   /* Priority of the task */
        &taskAPRSPollHandle, /* Task handle. */
        0);                  /* Core where the task should run */

    if (config.gnss_enable)
    {
        xTaskCreatePinnedToCore(
            taskGPS,        /* Function to implement the task */
            "taskGPS",      /* Name of the task */
            3072,           /* Stack size in words */
            NULL,           /* Task input parameter */
            5,              /* Priority of the task */
            &taskGPSHandle, /* Task handle. */
            0);             /* Core where the task should run */
    }

    // if (config.ext_tnc_enable || (config.wx_en && (config.wx_channel > 0 && config.wx_channel < 4)))
    if (config.ext_tnc_enable)
    {
        xTaskCreatePinnedToCore(
            taskSerial,        /* Function to implement the task */
            "taskSerial",      /* Name of the task */
            2048,              /* Stack size in words */
            NULL,              /* Task input parameter */
            6,                 /* Priority of the task */
            &taskSerialHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

        pinMode(BOOT_PIN, INPUT_PULLUP);
    //esp_task_wdt_add(taskAPRSPollHandle);
    // esp_task_wdt_add(NULL);
    // esp_task_wdt_status(NULL);
#ifdef APRS_LORA_HT
    attachInterrupt(ROTARY_ENCODER_A_PIN, doEncoder, CHANGE);
    attachInterrupt(ROTARY_ENCODER_B_PIN, doEncoder, CHANGE);
#endif

    timeTask = millis() + 10000;
    autoResetTimeout = millis() + ((long)config.reset_timeout * 60000);

    if (config.gnss_enable)
        curTab = 0;
    else
        curTab = 6;
#ifdef APRS_LORA_HT
    encoder0PosPrev = encoder0Pos = curTab;
#endif
}

String getTimeStamp()
{
    char strtmp[50];
    time_t now;
    time(&now);
    struct tm *info = gmtime(&now);
    sprintf(strtmp, "%02d%02d%02dz", info->tm_mday, info->tm_hour, info->tm_min);
    return String(strtmp);
}

int pkgCount = 0;

float conv_coords(float in_coords)
{
    // Initialize the location.
    float f = in_coords;
    // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
    // firsttowdigits should be 77 at this point.
    int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
    float nexttwodigits = f - (float)(firsttwodigits * 100);
    float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
    return theFinalAnswer;
}

void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
{
    DD_DDDDD = abs(DD_DDDDD);
    *DD = (int)DD_DDDDD;
    *MM = (int)((DD_DDDDD - *DD) * 60);
    *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100;
}

String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)
{
    String str_comp = "";
    // String lat, lon;
    // lat = deg2lat(nowLat);
    // lon = deg2lon(nowLng);
    char lat[15], lon[15];
    memset(lat, 0, sizeof(lat));
    memset(lon, 0, sizeof(lon));
    deg2lat(lat, nowLat);
    deg2lon(lon, nowLng);
    // ESP_LOGE("GPS", "Aprs Compress");
    //  Translate from semicircles to Base91 format
    char aprs_position[15];
    long latitude = semicircles(lat, (nowLat < 0));
    long longitude = semicircles(lon, (nowLng < 0));
    long ltemp = 1073741824L - latitude; // 90 degrees - latitude
    // ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
    memset(aprs_position, 0, sizeof(aprs_position));

    base91encode(ltemp, aprs_position);
    ltemp = 1073741824L + (longitude >> 1); // 180 degrees + longitude
    base91encode(ltemp, aprs_position + 4);
    // Encode heading
    uint8_t c = (uint8_t)(course / 4);
    // Scan lookup table to encode speed
    uint8_t s = (uint8_t)(log(spdKnot + 1) / log(1.08));
    if ((spdKnot <= 5) && (alt_feed > 0) && config.trk_altitude)
    {
        if (gps)
        {
            // Send Altitude
            aprs_position[11] = '!' + 0x30; // t current,GGA
            int alt = (int)alt_feed;
            int cs = (int)(log(alt) / log(1.002));
            c = (uint8_t)(cs / 91);
            s = (uint8_t)(cs - ((int)c * 91));
            if (s > 91)
                s = 91;
            aprs_position[9] = '!' + c;  // c
            aprs_position[10] = '!' + s; // s
        }
        else
        {
            // Send Range
            aprs_position[11] = '!' + 0x00; //
            aprs_position[9] = '{';         // c = {
            if (!config.rf_power)
            {
                s = 10;
            }
            else
            {
                s = 30;
            }
            aprs_position[10] = '!' + s; // s
        }
    }
    else
    {
        // Send course and speed
        aprs_position[9] = '!' + c;  // c
        aprs_position[10] = '!' + s; // s

        if (gps)
        {
            aprs_position[11] = '!' + 0x20 + 0x18 + 0x06; // t 0x20 1=current,0x18 11=RMC,0x06 110=Other tracker
        }
        else
        {
            aprs_position[11] = '!' + 0x00 + 0x18 + 0x06; // t
        }
    }
    aprs_position[12] = 0;
    // waveFlag = false;
    aprs_position[8] = symbol; // Symbol
    str_comp = String(table) + String(aprs_position);
    return str_comp;
}

