nakhonthai/ESP32APRS_LoRa/src/main.cpp
#ifdef MQTT

WiFiClient espClient;
PubSubClient clientMQTT(espClient);

void mqtt_reconnect()
{
    // Loop until we're reconnected
    if (!clientMQTT.connected())
    {
        char strCID[13];
        uint64_t chipid = ESP.getEfuseMac();
        sprintf(strCID, "%04X%08X", (uint16_t)(chipid >> 32), (uint32_t)chipid);
        Serial.print("Attempting MQTT connection...");
        // Attempt to connect
        char idMqtt[50];
        sprintf(idMqtt, "%s", strCID);
        // if (strlen(config.wx_object) > 3)
        // {
        //     strcat(idMqtt, "_");
        //     strcat(idMqtt, config.wx_object);
        // }
        bool res=false;
        if(config.mqtt_user[0]!=0){
            res=clientMQTT.connect(idMqtt, config.mqtt_user, config.mqtt_pass);
        }else{
            res=clientMQTT.connect(idMqtt);
        }
        if (res)
        {
            log_d("MQTT Connected");
            // Once connected, publish an announcement...
            char payload[20];
            // char topic[50];
            // if (strlen(config.wx_object) > 3)
            //     sprintf(topic, "/%s/status", config.wx_object);
            // else
            //     sprintf(topic, "/%s/status", config.wx_mycall);
            sprintf(payload, "Connected");

            clientMQTT.publish(config.mqtt_topic, payload);
            // ... and resubscribe
            clientMQTT.subscribe(config.mqtt_subscribe);
            delay(3000);
        }
        else
        {
            log_d("MQTT Failed, rc=%d ", clientMQTT.state());
        }
    }
}

void mqtt_callback(char *topic, byte *payload, unsigned int length)
{
    byte *payload_ptr=(byte *)calloc(1,length+1);
    if(payload_ptr==NULL){
        log_d("MQTT No memory");
        return;
    }
    memset(payload_ptr,0,length+1);
    memcpy(payload_ptr, payload, length);
    log_d("MQTT Message arrived on topic [%s] with length %d", topic, length);
    if (payload_ptr[0] == 'A' && payload_ptr[1] == 'T')
    {
        if(config.at_cmd_mqtt){
            log_d("AT-Command received: %s", payload_ptr);
            String ret = handleATCommand(String((char *)payload_ptr));
            log_d("AT-Command response: %s", ret.c_str());
            clientMQTT.publish(config.mqtt_topic, ret.c_str());        
        }
    }
    else
    {
        pkgTxPush((const char *)payload_ptr, length, 0, RF_CHANNEL);
    }
    free(payload_ptr);
}

#endif // MQTT

// String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)

String compressMicE(char *destCallsign, float lat, float lon, uint16_t heading, uint16_t speed, uint8_t type, uint8_t *telem, size_t telemLen, char *grid, char *status, int32_t alt, char table, char symbol)
{
    String strRet = "";
    // sanity checks first
    if (((telemLen == 0) && (telem != NULL)) || ((telemLen != 0) && (telem == NULL)))
    {
        return strRet;
    }

    if ((telemLen != 0) && (telemLen != 2) && (telemLen != 5))
    {
        return strRet;
    }

    if ((telemLen > 0) && ((grid != NULL) || (status != NULL) || (alt != RADIOLIB_APRS_MIC_E_ALTITUDE_UNUSED)))
    {
        // can't have both telemetry and status
        return strRet;
    }

    // prepare buffers
    // char destCallsign[7];
#if !RADIOLIB_STATIC_ONLY
    size_t infoLen = 10;
    if (telemLen > 0)
    {
        infoLen += 1 + telemLen;
    }
    else
    {
        if (grid != NULL)
        {
            infoLen += strlen(grid) + 2;
        }
        if (status != NULL)
        {
            infoLen += strlen(status);
        }
        if (alt > RADIOLIB_APRS_MIC_E_ALTITUDE_UNUSED)
        {
            infoLen += 4;
        }
    }
    char *info = new char[infoLen];
#else
    char info[RADIOLIB_STATIC_ARRAY_SIZE];
#endif
    size_t infoPos = 0;

    // the following is based on APRS Mic-E implementation by https://github.com/omegat
    // as discussed in https://github.com/jgromes/RadioLib/issues/430

    // latitude first, because that is in the destination field
    float lat_abs = abs(lat);
    int lat_deg = (int)lat_abs;
    int lat_min = (lat_abs - (float)lat_deg) * 60.0f;
    int lat_hun = (((lat_abs - (float)lat_deg) * 60.0f) - lat_min) * 100.0f;
    destCallsign[0] = lat_deg / 10;
    destCallsign[1] = lat_deg % 10;
    destCallsign[2] = lat_min / 10;
    destCallsign[3] = lat_min % 10;
    destCallsign[4] = lat_hun / 10;
    destCallsign[5] = lat_hun % 10;

    // next, add the extra bits
    if (type & 0x04)
    {
        destCallsign[0] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
    }
    if (type & 0x02)
    {
        destCallsign[1] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
    }
    if (type & 0x01)
    {
        destCallsign[2] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
    }
    if (lat >= 0)
    {
        destCallsign[3] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
    }
    if (lon >= 100 || lon <= -100)
    {
        destCallsign[4] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
    }
    if (lon < 0)
    {
        destCallsign[5] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
    }
    destCallsign[6] = '\0';

    // now convert to Mic-E characters to get the "callsign"
    for (uint8_t i = 0; i < 6; i++)
    {
        if (destCallsign[i] <= 9)
        {
            destCallsign[i] += '0';
        }
        else
        {
            destCallsign[i] += ('A' - 10);
        }
    }

    // setup the information field
    info[infoPos++] = RADIOLIB_APRS_MIC_E_GPS_DATA_CURRENT;

    // encode the longtitude
    float lon_abs = abs(lon);
    int32_t lon_deg = (int32_t)lon_abs;
    int32_t lon_min = (lon_abs - (float)lon_deg) * 60.0f;
    int32_t lon_hun = (((lon_abs - (float)lon_deg) * 60.0f) - lon_min) * 100.0f;

    if (lon_deg <= 9)
    {
        info[infoPos++] = lon_deg + 118;
    }
    else if (lon_deg <= 99)
    {
        info[infoPos++] = lon_deg + 28;
    }
    else if (lon_deg <= 109)
    {
        info[infoPos++] = lon_deg + 8;
    }
    else
    {
        info[infoPos++] = lon_deg - 72;
    }

    if (lon_min <= 9)
    {
        info[infoPos++] = lon_min + 88;
    }
    else
    {
        info[infoPos++] = lon_min + 28;
    }

    info[infoPos++] = lon_hun + 28;

    // now the speed and heading - this gets really weird
    int32_t speed_hun_ten = speed / 10;
    int32_t speed_uni = speed % 10;
    int32_t head_hun = heading / 100;
    int32_t head_ten_uni = heading % 100;

    if (speed <= 199)
    {
        info[infoPos++] = speed_hun_ten + 'l';
    }
    else
    {
        info[infoPos++] = speed_hun_ten + '0';
    }

    info[infoPos++] = speed_uni * 10 + head_hun + 32;
    info[infoPos++] = head_ten_uni + 28;
    info[infoPos++] = symbol;
    info[infoPos++] = table;

    // onto the optional stuff - check telemetry first
    if (telemLen > 0)
    {
        if (telemLen == 2)
        {
            info[infoPos++] = RADIOLIB_APRS_MIC_E_TELEMETRY_LEN_2;
        }
        else
        {
            info[infoPos++] = RADIOLIB_APRS_MIC_E_TELEMETRY_LEN_5;
        }
        for (uint8_t i = 0; i < telemLen; i++)
        {
            sprintf(&(info[infoPos]), "%02X", telem[i]);
            infoPos += 2;
        }
    }
    else
    {
        if (grid != NULL)
        {
            memcpy(&(info[infoPos]), grid, strlen(grid));
            infoPos += strlen(grid);
            info[infoPos++] = '/';
            info[infoPos++] = 'G';
        }
        if (status != NULL)
        {
            info[infoPos++] = ' ';
            memcpy(&(info[infoPos]), status, strlen(status));
            infoPos += strlen(status);
        }
        if (alt > RADIOLIB_APRS_MIC_E_ALTITUDE_UNUSED)
        {
            // altitude is offset by -10 km
            int32_t alt_val = alt + 10000;

            // ... and encoded in base 91 for some reason
            info[infoPos++] = (alt_val / 8281) + 33;
            info[infoPos++] = ((alt_val % 8281) / 91) + 33;
            info[infoPos++] = ((alt_val % 8281) % 91) + 33;
            info[infoPos++] = '}';
        }
    }
    info[infoPos++] = '\0';

    strRet = String(info);
    return strRet;
}

String trk_gps_postion(String comment)
{
    String rawData = "";
    String lat, lon;
    double nowLat, nowLng;
    char rawTNC[300];
    char aprs_table, aprs_symbol;
    // char timestamp[10];
    struct tm tmstruct;
    double dist, course, speed;
    time_t nowTime;

    memset(rawTNC, 0, sizeof(rawTNC));
    // getLocalTime(&tmstruct, 5000);
    // sprintf(timestamp, "%02d%02d%02d%02d", (tmstruct.tm_mon + 1), tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min);
    time(&nowTime);
    // nowTime = gps.time.value();
    if (lastTimeStamp == 0)
        lastTimeStamp = nowTime;

    // lastTimeStamp=10000;
    // nowTime=lastTimeStamp+1800;
    time_t tdiff = nowTime - lastTimeStamp;

    // aprs_table = config.aprs_table;
    // aprs_symbol = config.aprs_symbol;
    if (config.trk_smartbeacon)
    {
        if (SB_SPEED < config.trk_lspeed)
        {
            aprs_table = config.trk_symstop[0];
            aprs_symbol = config.trk_symstop[1];
            SB_SPEED = 0;
        }
        else
        {
            aprs_table = config.trk_symmove[0];
            aprs_symbol = config.trk_symmove[1];
        }
    }
    else
    {
        aprs_table = config.trk_symbol[0];
        aprs_symbol = config.trk_symbol[1];
    }

    if (gps.location.isValid()) // && (gps.hdop.hdop() < 10.0))
    {
        nowLat = gps.location.lat();
        nowLng = gps.location.lng();

        uint16_t spdKnot;
        if (LastLng == 0 || LastLat == 0)
        {
            course = gps.course.deg();
            spdKnot = (uint16_t)gps.speed.knots();
        }
        else
        {
            dist = aprsParse.distance(LastLng, LastLat, nowLng, nowLat);
            course = aprsParse.direction(LastLng, LastLat, nowLng, nowLat);
            if (dist > 50.0F)
                dist = 0;
            if (tdiff > 10 && (nowTime > lastTimeStamp))
                speed = dist / ((double)tdiff / 3600);
            else
                speed = 0.0F;

            if (speed > 999)
                speed = 999.0F;
            // uint16_t spdMph=(uint16_t)(speed / 1.609344);
            spdKnot = (uint16_t)(speed * 0.53996F);
            if (spdKnot > 94)
                spdKnot = 0;
        }

