nakhonthai/ESP32APRS_LoRa/src/main.cpp
        if (strlen(config.trk_item) >= 3)
        {
            char object[10];
            memset(object, 0x20, 10);
            memcpy(object, config.trk_item, strlen(config.trk_item));
            object[9] = 0;
            if (config.trk_timestamp)
            {
                String timeStamp = getTimeStamp();
                sprintf(loc, ";%s*%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", object, timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, config.trk_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.trk_symbol[1]);
            }
            else
            {
                sprintf(loc, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", config.trk_item, lat_dd, lat_mm, lat_ss, lat_ns, config.trk_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.trk_symbol[1]);
            }
        }
        else
        {
            if (config.trk_timestamp)
            {
                String timeStamp = getTimeStamp();
                sprintf(loc, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, config.trk_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.trk_symbol[1]);
            }
            else
            {
                sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.trk_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.trk_symbol[1]);
            }
        }

        if (config.trk_alt > 0)
        {
            char strAltitude[12];
            memset(strAltitude, 0, sizeof(strAltitude));
            sprintf(strAltitude, "/A=%06d", (int)(config.trk_alt * 3.28F));
            strcat(loc, strAltitude);
        }
    }

    char *strtmp = (char *)calloc(300, sizeof(char));
    if (strtmp)
    {
        memset(strtmp, 0, 300);
        if (config.trk_ssid == 0)
            sprintf(strtmp, "%s>APE32L", config.trk_mycall);
        else
            sprintf(strtmp, "%s-%d>APE32L", config.trk_mycall, config.trk_ssid);
        tnc2Raw = String(strtmp);
        free(strtmp);
    }
    if (config.trk_path < 5)
    {
        if (config.trk_path > 0)
            tnc2Raw += "-" + String(config.trk_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.trk_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    tnc2Raw += comment + String(config.trk_comment);
    return tnc2Raw;
}

String igate_position(double lat, double lon, double alt, String comment)
{
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char loc[100];
    char lon_ew = 'E';
    char lat_ns = 'N';
    if (lat < 0)
        lat_ns = 'S';
    if (lon < 0)
        lon_ew = 'W';
    memset(loc, 0, sizeof(loc));
    DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
    char strAltitude[12];
    memset(strAltitude, 0, sizeof(strAltitude));
    if (alt > 0)
    {
        sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
    }
    if (strlen(config.igate_object) >= 3)
    {
        char object[10];
        memset(object, 0x20, 10);
        memcpy(object, config.igate_object, strlen(config.igate_object));
        object[9] = 0;
        if (config.igate_timestamp)
        {
            String timeStamp = getTimeStamp();
            sprintf(loc, ";%s*%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", object, timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, config.igate_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.igate_symbol[1]);
        }
        else
        {
            sprintf(loc, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", config.igate_object, lat_dd, lat_mm, lat_ss, lat_ns, config.igate_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.igate_symbol[1]);
        }
    }
    else
    {
        if (config.igate_timestamp)
        {
            String timeStamp = getTimeStamp();
            sprintf(loc, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", timeStamp.c_str(), lat_dd, lat_mm, lat_ss, lat_ns, config.igate_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.igate_symbol[1]);
        }
        else
        {
            sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.igate_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.igate_symbol[1]);
        }
    }
    char *strtmp = (char *)calloc(300, sizeof(char));
    if (strtmp)
    {
        memset(strtmp, 0, 300);
        if (config.igate_ssid == 0)
            sprintf(strtmp, "%s>APE32L", config.igate_mycall);
        else
            sprintf(strtmp, "%s-%d>APE32L", config.igate_mycall, config.igate_ssid);
        tnc2Raw = String(strtmp);
        free(strtmp);
    }
    if (config.igate_path < 5)
    {
        if (config.igate_path > 0)
            tnc2Raw += "-" + String(config.igate_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.igate_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    tnc2Raw += String(config.igate_phg) + String(strAltitude);
    return tnc2Raw;
}

String digi_position(double lat, double lon, double alt, String comment)
{
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char loc[100];
    char lon_ew = 'E';
    char lat_ns = 'N';
    if (lat < 0)
        lat_ns = 'S';
    if (lon < 0)
        lon_ew = 'W';
    memset(loc, 0, sizeof(loc));
    DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
    char strAltitude[12];
    memset(strAltitude, 0, sizeof(strAltitude));
    if (alt > 0)
    {
        sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
    }
    if (config.digi_timestamp)
    {
        String timeStamp = getTimeStamp();
        sprintf(loc, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
    }
    else
    {
        sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
    }
    char *strtmp = (char *)calloc(300, sizeof(char));
    if (strtmp)
    {
        memset(strtmp, 0, 300);
        if (config.digi_ssid == 0)
            sprintf(strtmp, "%s>APE32L", config.digi_mycall);
        else
            sprintf(strtmp, "%s-%d>APE32L", config.digi_mycall, config.digi_ssid);
        tnc2Raw = String(strtmp);
        free(strtmp);
    }
    if (config.digi_path < 5)
    {
        if (config.digi_path > 0)
            tnc2Raw += "-" + String(config.digi_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.digi_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    tnc2Raw += String(config.digi_phg) + String(strAltitude);
    return tnc2Raw;
}

void tracker_status(char *text)
{
    char name[50];
    memset(name, 0, 50);
    if (config.trk_ssid > 0)
        sprintf(name, "%s-%d>APE32L", config.trk_mycall, config.trk_ssid);
    else
        sprintf(name, "%s>APE32L", config.trk_mycall);

    String tnc2Raw = String(name);
    if (config.trk_path < 5)
    {
        if (config.trk_path > 0)
            tnc2Raw += "-" + String(config.trk_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.trk_path);
    }
    tnc2Raw += ":>";
    tnc2Raw += String(text);

    uint8_t SendMode = 0;
    if (config.trk_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.trk_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, SendMode);
}

void igate_status(char *text)
{
    char name[50];
    memset(name, 0, 50);
    if (config.igate_ssid > 0)
        sprintf(name, "%s-%d>APE32L", config.igate_mycall, config.igate_ssid);
    else
        sprintf(name, "%s>APE32L", config.igate_mycall);

    String tnc2Raw = String(name);
    if (config.igate_path < 5)
    {
        if (config.igate_path > 0)
            tnc2Raw += "-" + String(config.igate_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.igate_path);
    }
    tnc2Raw += ":>";
    tnc2Raw += String(text);

    uint8_t SendMode = 0;
    if (config.igate_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.igate_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, SendMode);
}

void digi_status(char *text)
{
    char name[50];
    memset(name, 0, 50);
    if (config.digi_ssid > 0)
        sprintf(name, "%s-%d>APE32L", config.digi_mycall, config.digi_ssid);
    else
        sprintf(name, "%s>APE32L", config.digi_mycall);

    String tnc2Raw = String(name);
    if (config.digi_path < 5)
    {
        if (config.digi_path > 0)
            tnc2Raw += "-" + String(config.digi_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.digi_path);
    }
    tnc2Raw += ":>";
    tnc2Raw += String(text);

    uint8_t SendMode = 0;
    if (config.digi_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.digi_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, SendMode);
}

String wx_report(double lat, double lon, double alt, String comment)
{
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char loc[100];
    char lon_ew = 'E';
    char lat_ns = 'N';
    if (lat < 0)
        lat_ns = 'S';
    if (lon < 0)
        lon_ew = 'W';
    memset(loc, 0, sizeof(loc));
    DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
    // char strAltitude[12];
    // memset(strAltitude, 0, sizeof(strAltitude));
    // if (alt > 0)
    // {
    //     sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
    // }
    if (config.wx_gps)
    {
        if (gps.satellites.value() > 5 && gps.hdop.hdop() < 5)
            mslAltitude = alt;
    }
    else
    {
        mslAltitude = alt;
    }
    if (strlen(config.wx_object) >= 3)
    {
        char object[10];
        memset(object, 0x20, 10);
        memcpy(object, config.wx_object, strlen(config.wx_object));
        object[9] = 0;
        config.wx_timestamp = true; // Force timestamp for wx report
                                    // if (config.wx_timestamp)
                                    // {
        String timeStamp = getTimeStamp();
        sprintf(loc, ";%s*%s%02d%02d.%02d%c/%03d%02d.%02d%c_", object, timeStamp.c_str(), lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        // }
        // else
        // {
        //     sprintf(loc, ")%s!%02d%02d.%02d%c/%03d%02d.%02d%c_", config.wx_object, lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        // }
    }
    else
    {
        if (config.wx_timestamp)
        {
            String timeStamp = getTimeStamp();
            sprintf(loc, "@%s%02d%02d.%02d%c/%03d%02d.%02d%c_", timeStamp.c_str(), lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        }
        else
        {
            sprintf(loc, "!%02d%02d.%02d%c/%03d%02d.%02d%c_", lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        }
    }
    char *strtmp = (char *)calloc(500, sizeof(char));
    if (strtmp)
    {
        memset(strtmp, 0, 500);
        if (config.wx_ssid == 0)
            sprintf(strtmp, "%s>APE32L", config.wx_mycall);
        else
            sprintf(strtmp, "%s-%d>APE32L", config.wx_mycall, config.wx_ssid);
        tnc2Raw = String(strtmp);
        free(strtmp);
    }

    if (config.wx_path < 5)
    {
        if (config.wx_path > 0)
            tnc2Raw += "-" + String(config.wx_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.wx_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    char WxRaw[500];
    memset(WxRaw, 0, 500);
    getRawWx(&WxRaw[0]);
    tnc2Raw += String(WxRaw);
    tnc2Raw += comment + String(config.wx_comment);
    return tnc2Raw;
}

int packet2Raw(String &tnc2, AX25Msg &Packet)
{
    if (Packet.len < 5)
        return 0;
    tnc2 = String(Packet.src.call);
    if (Packet.src.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.src.ssid);
    }
    tnc2 += String(F(">"));
    tnc2 += String(Packet.dst.call);
    if (Packet.dst.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.dst.ssid);
    }
    for (int i = 0; i < Packet.rpt_count; i++)
    {
        tnc2 += String(",");
        tnc2 += String(Packet.rpt_list[i].call);
        if (Packet.rpt_list[i].ssid > 0)
        {
            tnc2 += String("-");
            tnc2 += String(Packet.rpt_list[i].ssid);
        }
        if (Packet.rpt_flags & (1 << i))
            tnc2 += "*";
    }
    tnc2 += String(F(":"));
    tnc2 += String((const char *)Packet.info, Packet.len + 1);

    return tnc2.length();
}

uint8_t led_pin = BOOT_PIN;

#ifdef BUOY
// Declare an array named letters that holds addresses of string literals
// (i.e. an array of pointers to strings composed of dots and dashes)
// Done to preserve memory because strings are not equal in size. A 2D array
// would be a waste of space.
const char *letters[] = {
    // The letters A-Z in Morse code
    ".-", "-...", "-.-.", "-..", ".", "..-.", "--.", "....", "..",
    ".---", "-.-", ".-..", "--", "-.", "---", ".--.", "--.-", ".-.",
    "...", "-", "..-", "...-", ".--", "-..-", "-.--", "--.."};

const char *numbers[] = {
    // The numbers 0-9 in Morse code
    "-----", ".----", "..---", "...--", "....-", ".....", "-....",
    "--...", "---..", "----."};

