nakhonthai/ESP32APRS_LoRa/src/main.cpp
unsigned int dot_duration = 100;
bool done = false;

/**
 *  Flashes the dot or dash in the Morse code
 *  @param dot_or_dash character that is a dot or a dash
 */
void flash_dot_or_dash(char dot_or_dash)
{

    // Make the LED shine
    digitalWrite(led_pin, LOW);

    if (dot_or_dash == '.')
    { // If it is a dot
        // delay(dot_duration);
        vTaskDelay(dot_duration / portTICK_PERIOD_MS);
    }
    else
    { // Has to be a dash...equal to three dots
        // delay(dot_duration * 3);
        vTaskDelay(dot_duration * 3 / portTICK_PERIOD_MS);
    }

    // Turn the LED off
    digitalWrite(led_pin, HIGH);

    // Give space between parts of the same letter...equal to one dot
    // delay(dot_duration);
    vTaskDelay(dot_duration / portTICK_PERIOD_MS);
}

/**
 *  Flashes the Morse code for the input letter or number
 *  @param morse_code pointer to the morse code
 */
void flash_morse_code(const char *morse_code)
{

    unsigned int i = 0;

    // Read the dots and dashes and flash accordingly
    while (morse_code[i] != '\0')
    {
        flash_dot_or_dash(morse_code[i]);
        i++;
        if (i > 7)
            break;
    }

    // Space between two letters is equal to three dots
    // delay(dot_duration * 3);
    vTaskDelay(dot_duration * 3 / portTICK_PERIOD_MS);
}

void flash_morse_text(char *text, size_t len)
{
    char ch;
    for (int i = 0; i < len; i++)
    {
        ch = text[i];
        // Check for uppercase letters
        if (ch >= 'A' && ch <= 'Z')
        {
            // Serial.println(ch);
            flash_morse_code(letters[ch - 'A']);
        }
        // Check for lowercase letters
        else if (ch >= 'a' && ch <= 'z')
        {
            // Serial.println(ch);
            flash_morse_code(letters[ch - 'a']);
        }
        // Check for numbers
        else if (ch >= '0' && ch <= '9')
        {
            // Serial.println(ch);
            flash_morse_code(numbers[ch - '0']);
        }
        // Check for space between words
        else if (ch == ' ')
        {
            // Put space between two words in a message...equal to seven dots
            // delay(dot_duration * 7);
            vTaskDelay(dot_duration * 7 / portTICK_PERIOD_MS);
        }
        // esp_task_wdt_reset();
    }
}
#endif

long sendTimer = 0;
int btn_count = 0;
int timeHalfSec = 0;

unsigned long timeSec;

char nmea[100];
int nmea_idx = 0;
char morse[50];
uint8_t morseState = 0;
long int sleep_timer = 0;
bool save_mode = false;
bool save_act = false;
bool manualWiFi = false;
uint8_t heapCount = 0;

void msgBox(String msg)
{
#ifdef OLED
    int x = msg.length() * 6;
    int x1 = (SCREEN_WIDTH / 2) - (x / 2);
    int y1 = (SCREEN_HEIGHT / 2);

    display.fillRect(x1 - 7, y1 - 6, x + 14, 28, BLACK);
    display.drawRect(x1 - 5, y1 - 4, x + 10, 24, WHITE);
    display.drawLine(x1 - 3, y1 + 21, x1 + (x + 10) - 4, y1 + 21, WHITE);
    display.drawLine(x1 + (x + 10) - 4, y1 - 2, x1 + (x + 10) - 4, y1 + 21, WHITE);
    display.setCursor(x1, y1 + 5);
    display.print(msg);
    display.display();
#endif
}

void loop()
{
    if (millis() > timeTask)
    {
        timeTask = millis() + 30000;
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
        VBat = (double)PMU.getBattVoltage() / 1000;
#elif defined(HELTEC_HTIT_TRACKER)
        analogReadResolution(12);
        analogSetAttenuation(ADC_11db);
        digitalWrite(2, HIGH);
        VBat = (double)analogReadMilliVolts(1) / 201.15357F;
#elif defined(HELTEC_V3_GPS)
        analogReadResolution(12);
        analogSetAttenuation(ADC_11db);
        digitalWrite(37, HIGH);
        VBat = (double)analogReadMilliVolts(1) / 201.15357F;
#elif defined(APRS_LORA_HT)
        VBat = (double)analogReadMilliVolts(3) / 595.24F;
#elif defined(BUOY)
        // #ifdef BUOY
        VBat = (double)analogReadMilliVolts(0) * 0.0028F;
        // TempNTC = getTempNTC();

        // if (WiFi.isConnected() || WiFi.softAPgetStationNum()){
        //     sprintf(morse,"B%dT%dS%dW",(int)(VBat*100),(int)(TempNTC*100),gps.satellites.value());
        //     if(WiFi.softAPgetStationNum()) strcat(morse,"A");
        //     if(WiFi.isConnected()) strcat(morse,"S");
        //     //strcat(morse," ");
        // }else{
        //     sprintf(morse," B%dT%dS%d ",(int)(VBat*100),(int)(TempNTC*100),gps.satellites.value());
        // }
        morseState++;
        if (morseState == 1)
        {
            sprintf(morse, "B%d", (int)(VBat * 100));
        }
        else if (morseState == 2)
        {
            sprintf(morse, "T%d", (int)(TempNTC * 100));
        }
        else if (morseState == 3)
        {
            sprintf(morse, "S%d", gps.satellites.value());
        }
        else if (morseState > 5)
        {
            morseState = 0;
        }
        if (morseState > 0 && morseState < 4)
            flash_morse_text(morse, strlen(morse));

        if (VBat < 3.3F)
        {
            PowerOff();
            if (VBat < 3.0F)
            {
                esp_sleep_enable_timer_wakeup(600 * uS_TO_S_FACTOR);
                esp_deep_sleep_start();
            }
        }
#endif
#ifdef APRS_LORA_HT
        // VBat = (double)analogReadMilliVolts(3) / 595.24F;
        // log_d("mV=%.3f",analogReadMilliVolts(3));
#endif
        //float tempCpu;
        // temp_sensor_start();
        // delay(1);
        // temp_sensor_read_celsius(&tempCpu);
        // temp_sensor_stop();
        log_d("Task process APRS=%iuS\t NETWORK=%iuS\t GPS=%iuS\t SERIAL=%iuS\t \n", timerAPRS, timerNetwork, timerGPS, timerSerial);
        log_d("Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm", String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str());
        // log_d("Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm ,BAT: %0.3fV ,Temp: %0.2fC", String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str(), VBat, TempNTC);
#ifdef NAWS4
// int i2c_timeout = 0;
//         while (i2c_busy)
//         {
//             delay(10);
//             if (++i2c_timeout > 20)
//                 break;
//         }
//         i2c_busy = true;
//     Wire.beginTransmission(0x30);
//     byte error = Wire.endTransmission();
//     if(error!=0){
//         if(setupPower())
//         {
//             APRS_init(&config);
//         }
//     }
//     i2c_busy = false;
#endif
        // bool result = PMU.begin(Wire, AXP152_SLAVE_ADDRESS, PMU_I2C_SDA, PMU_I2C_SCL);
        // if (result == false)
        // {
        //     //while (1)
        //     //{
        //         log_d("PMU is not online...");
        //         //delay(500);
        //     //}
        // }else
        // if(1){
        //     log_d("PMU is online");
        //     PMU.setDC1Voltage(3300); // Set DC1 voltage to 3300mV
        //     PMU.setDC3Voltage(3300); // Set DC3 voltage to 3300mV ,VRF_V
        //      PMU.setDC4Voltage(3400); // Set DC4 voltage to VRF_U
        //      PMU.setALDO1Voltage(3300); // Set ALDO1 voltage to 3300mV
        //     PMU.setALDO2Voltage(3300); // Set ALDO2 voltage to
        //     PMU.setDLDO1Voltage(3300); // Set DLDO1 voltage to 3300mV
        //     PMU.setDLDO2Voltage(3300); // Set DLDO2 voltage to 3300mV
        //     PMU.writeRegister(0x12,0xBF);
        //     //PMU.enableDC1();         // Enable DC1
        //     //PMU.setDC2Voltage(3300); // Set DC2 voltage to 3300mV
        //     //PMU.enableDC2();         // Enable DC2
        //     //PMU.setDC3Voltage(3300); // Set DC3 voltage to 3300mV
        //     //PMU.enableDC3();         // Enable DC3
        //      //PMU.enableDC4();         // Enable DC4
        //     // PMU.setALDO1Voltage(3300); // Set ALDO1 voltage to 3300mV
        //     // PMU.enableALDO1();         // Enable ALDO1
        //     // PMU.setALDO2Voltage(3300); // Set ALDO2 voltage to
        //     // PMU.enableALDO2();         // Enable ALDO2
        //     // PMU.setDLDO1Voltage(3300); // Set DLDO1 voltage to 3300mV
        //     // PMU.enableDLDO1();         // Enable DLDO1
        //     // PMU.setDLDO2Voltage(3300); // Set DLDO2 voltage to 3300mV
        //     // PMU.enableDLDO2();         // Enable DLDO2
        //     // PMU.disableDC2(); // Disable DC2
        //     // PMU.disableDC3(); // Disable DC3
        //     // PMU.disableALDO1(); // Disable ALDO1
        //     // PMU.disableALDO2(); // Disable ALDO2
        //     // PMU.disableDLDO1(); // Disable DLDO1
        //     // PMU.disableDLDO2(); // Disable DLDO2

