nakhonthai/ESP32APRS_LoRa/src/main.cpp
        //     delay(100);
        //     log_d("DCDC=======================================================================");
        //     log_d("DC1  : %s   Voltage:%u mV \n", PMU.isEnableDC1() ? "+" : "-", PMU.getDC1Voltage());
        //     //log_d("DC2  : %s   Voltage:%u mV \n", PMU.isEnableDC2() ? "+" : "-", PMU.getDC2Voltage());
        //     log_d("DC3  : %s   Voltage:%u mV \n", PMU.isEnableDC3() ? "+" : "-", PMU.getDC3Voltage());
        //     log_d("DC4  : %s   Voltage:%u mV \n", PMU.isEnableDC4() ? "+" : "-", PMU.getDC4Voltage());
        //     log_d("ALDO=======================================================================");
        //     log_d("ALDO1: %s   Voltage:%u mV\n", PMU.isEnableALDO1() ? "+" : "-", PMU.getALDO1Voltage());
        //     log_d("ALDO2: %s   Voltage:%u mV\n", PMU.isEnableALDO2() ? "+" : "-", PMU.getALDO2Voltage());
        //     //log_d("ALDO3: %s   Voltage:%u mV\n", PMU.isEnableLDO0 ? "+" : "-", PMU.getLDO0Voltage());
        //     log_d("BLDO=======================================================================");
        //     log_d("BLDO1: %s   Voltage:%u mV\n", PMU.isEnableDLDO1() ? "+" : "-", PMU.getDLDO1Voltage());
        //     log_d("BLDO2: %s   Voltage:%u mV\n", PMU.isEnableDLDO2() ? "+" : "-", PMU.getDLDO2Voltage());
        //     log_d("===========================================================================");
        // }

        if((config.reset_timeout > 0) && (millis() > autoResetTimeout)){
            autoResetTimeout=millis() + (config.reset_timeout*60000);
            log_d("Auto Reset System");
            vTaskSuspendAll();
            WiFi.disconnect(true); // Disconnect from the network
            WiFi.persistent(false);
            WiFi.mode(WIFI_OFF); // Switch WiFi off
            PowerOff();
            esp_restart();
        }

        // Automatic Restart when heap memory not enough
        if (ESP.getFreeHeap() < 60000)
        {
            if (++heapCount > 60)
            {
                heapCount = 0;
                vTaskSuspendAll();
                WiFi.disconnect(true); // Disconnect from the network
                WiFi.persistent(false);
                WiFi.mode(WIFI_OFF); // Switch WiFi off
                PowerOff();
                esp_restart();
            }
        }
        else
        {
            if (heapCount > 0)
                heapCount--;
        }

        if (!((WiFi.isConnected() == true) || (WiFi.softAPgetStationNum() > 0)))
        {
            Sleep_Activate &= ~ACTIVATE_WIFI;
        }

        if ((config.pwr_mode == MODE_B) && config.gnss_enable) // expand sleep delay from GPS moving
        {
            if ((gps.satellites.value() > 3) && (gps.hdop.hdop() < 5) && (gps.speed.kmph() > 10))
            {
                if (config.trk_en)
                {
                    if (config.trk_gps)
                    {
                        if (SB_SPEED > 10)
                            StandByTick = millis() + (config.trk_slowinterval * 1000);
                    }
                    else
                    {
                        StandByTick = millis() + (config.trk_interval * 1000) + 1000;
                        if (save_mode)
                            save_act = true;
                    }
                }
                else if (config.igate_en)
                {
                    if (config.igate_gps)
                    {
                        StandByTick = millis() + (config.igate_interval * 1000) + 1000;
                        if (save_mode)
                            save_act = true;
                    }
                }
                else if (config.digi_en)
                {
                    if (config.digi_gps)
                    {
                        StandByTick = millis() + (config.digi_interval * 1000) + 1000;
                        if (save_mode)
                            save_act = true;
                    }
                }
            }
        }
    }

#ifdef BUOY
    if (gps.location.isValid() && gps.location.isUpdated())
    {
        if (VBat > 4.1F)
            sprintf(morse, "U "); // Bat Full & GPS
        else
            sprintf(morse, "I ");
    }
    else
    {
        if (VBat > 4.1F)
            sprintf(morse, "A "); // Bat Full & NoGPS
        else
            sprintf(morse, "E ");
    }
    flash_morse_text(morse, strlen(morse));
#endif

    vTaskDelay(10 / portTICK_PERIOD_MS);

#ifndef BUOY
#ifdef APRS_LORA_HT
    if (encoder0PosPrev != encoder0Pos)
    {
        if (encoder0Pos > 7)
        {
            encoder0Pos = 0;
        }
        if (encoder0Pos < 0)
        {
            encoder0Pos = 7;
        }
        curTab = (uint8_t)encoder0Pos; // Set current tab
        encoder0PosPrev = encoder0Pos;
        showDisp = true;
        timeSec = timeHalfSec = millis();
    }
#endif
    if (digitalRead(BOOT_PIN) == LOW)
    {
        btn_count++;
        if (btn_count > 200) // Push BOOT >2sec
        {
            btn_count = 0;
            if (curTab == 0)
            {
                showDisp = true;
                timeSec = timeHalfSec = millis();
                if (gps_mode)
                    gps_mode = false;
                else
                    gps_mode = true;
                msgBox("GPS SWAP");
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
            }
            else if (curTab == 4) // System display
            {
                msgBox("POWER OFF");
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
                PowerOff();
                esp_deep_sleep_start();
            }
            else if (curTab == 6) // Wifi display
            {
                if (manualWiFi)
                {
                    manualWiFi = false;
                    msgBox("WiFi OFF");
                    vTaskSuspend(taskNetworkHandle);
                    WiFi.disconnect(true); // Disconnect from the network
                    WiFi.persistent(false);
                    WiFi.mode(WIFI_OFF); // Switch WiFi off
                }
                else
                {
                    manualWiFi = true;
                    msgBox("WiFi ON");
                    vTaskResume(taskNetworkHandle);
                }
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
            }
            else if (curTab == 1) // Status display
            {
                msgBox("MANUAL TX");
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
                EVENT_TX_POSITION = 6;
                tx_interval = config.trk_interval;
            }
        }
        else
        {
        }
    }
    else
    {
        if (btn_count > 0)
        {
            log_d("btn_count=%d", btn_count);
            if (btn_count > 25) // Push BOOT 10sec to Factory Default
            {
                // digitalWrite(LED_RX, LOW);
                // digitalWrite(LED_TX, LOW);
                // defaultConfig();
                // log_d("SYSTEM REBOOT NOW!");
                // esp_restart();
            }
            else
            {
                StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                if (save_mode)
                    save_act = true;
                showDisp = true;
                timeSec = timeHalfSec = millis();
#ifdef ST7735_LED_K_Pin
                ledcWrite(ST7735_LED_K_Pin, (uint32_t)config.disp_brightness);
#endif

#ifndef APRS_LORA_HT
                // if (oledSleepTimeout > 0)
                //{
                curTab++;
                if (curTab > 7)
                    curTab = 0;
                //}
                log_d("curTab=%d", curTab);
#endif
            }
        }
        btn_count = 0;
    }
#endif

#if defined OLED || defined ST7735_160x80
    // Popup Display
    if ((config.oled_enable == true) && (save_mode == false))
    {
        if (dispBuffer.getCount() > 0)
        {
            if (millis() > timeHalfSec)
            {
                int i2c_timeout = 0;
                while (i2c_busy)
                {
                    delay(10);
                    if (++i2c_timeout > 20)
                        break;
                }
                i2c_busy = true;
                char tnc2[300];
                dispBuffer.pop(&tnc2);
                // log_d("dispWindow info=%s",tnc2);
                dispWindow(String(tnc2), 0, false);
                i2c_busy = false;
                timeHalfSec = millis() + (config.dispDelay * 1000);
                oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            }
        }
        else
        {
            // if (!getTransmit())
            // {
            if (queTxDisp.getCount() > 0)
            { // have tx info display
                txDisp txs;
                if (queTxDisp.pop(&txs))
                {
                    dispTxWindow(txs);
                    delay(1000);
                    // if (menuSel == 0)
                    //     curTabOld = curTab + 1;
                }
            }
            // }

            // Sleep display
            if (millis() > timeHalfSec)
            {
                if (millis() > timeSec && timeHalfSec > 0)
                {
                    timeSec = millis() + 10000;
                    showDisp = true;
                    // if(curTab<4)
                    //  curTab++;
                    //  if (curTab > 4)
                    //      curTab = 0;
                    //  timeHalfSec = 0;
                    //  oledSleepTimeout = millis() + (config.oled_timeout * 1000);
                }
                else
                {
                    if (config.oled_enable)
                    {
                        if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
                        {
                            showDisp = false;
                            timeHalfSec = 0;
                            oledSleepTimeout = 0;
                            int i2c_timeout = 0;
                            while (i2c_busy)
                            {
                                delay(10);
                                if (++i2c_timeout > 20)
                                    break;
                            }
                            i2c_busy = true;
#ifdef OLED
                            display.clearDisplay();
                            display.display();
#elif defined(ST7735_160x80)
                            ledcWrite(ST7735_LED_K_Pin, 5);
#endif
                            i2c_busy = false;
                        }
                    }
                    else
                    {
                        showDisp = false;
                    }
                }
            }
        }

        if (showDisp)
        {
            showDisp = false;
            timeHalfSec = millis();
            // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            switch (curTab)
            {
            case 1:
                statisticsDisp();
                timeSec = millis() + 10000;
                break;
            case 2:
                pkgLastDisp();
                timeSec = millis() + 10000;
                break;
            case 3:
                pkgCountDisp();
                timeSec = millis() + 10000;
                break;
            case 4:
                systemDisp();
                timeSec = millis() + 10000;
                break;
            case 5:
                radioDisp();
                timeSec = millis() + 10000;
                break;
            case 6:
                wifiDisp();
                timeSec = millis() + 10000;
                break;
            case 7:
                sensorDisp();
                timeSec = millis() + 10000;
                break;
            case 0:
                gpsDisp();
                timeSec = millis() + 1000;
            }
        }
    }
#endif

    // Tick one secound
    if (millis() > timeSleep)
    {
        // esp_task_wdt_reset();
        timeSleep = millis() + 1000;

        if (config.pwr_en)
        {
            if (config.pwr_mode == MODE_A) // CPU and Radio active, power down control
            {
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                if (PMU.isCharging())
                {
                    StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                }
#endif
                if (((millis() > StandByTick) || (save_act)) && (pkgTxCount() == 0))
                {
                    save_act = false;
                    if (save_mode == false)
                    {
                        save_mode = true;
                        log_d("System to save mode A %d Sec", config.pwr_sleep_interval);
                        StandByTick = millis() + (config.pwr_sleep_interval * 1000);
                        vTaskSuspend(taskSensorHandle);
                        // Power OFF
                        PowerOff();

#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                        PMU.disableDC5();
                        PMU.disableALDO1(); // QMC6310,BME280,OLED
                        // PMU.disableALDO3(); //LoRa
                        PMU.disableBLDO2();
                        PMU.disableALDO2();
                        // PMU.disableALDO4(); //GNSS,
                        PMU.disableBLDO1(); // TF Card
                        PMU.disableDC3();
#endif
                        setCpuFrequencyMhz(80);
                        // esp_task_wdt_reset();
                        delay(100);
                    }
                    else
                    {
                        // Wakeup
                        save_mode = false;
                        log_d("System to Wakeup save mode A %d Sec", config.pwr_sleep_interval);
                        // sleep_timer = millis() + (config.pwr_sleep_interval * 1000);
                        StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                        // #if defined(__XTENSA__)
                        //                         setCpuFrequencyMhz(240);
                        // #else
                        setCpuFrequencyMhz(160);
                        // #endif
                        PowerOn();
                        sensorInit(false);
                        delay(100);
                        vTaskResume(taskSensorHandle);
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                        PMU.enableDC5();
                        PMU.enableALDO1();
                        PMU.enableALDO3();
                        PMU.enableBLDO2();
                        PMU.enableALDO2();
                        PMU.enableALDO4();
                        PMU.enableBLDO1();
                        PMU.enableDC3();
#endif
                    }
                }
            }
            else if (config.pwr_mode == MODE_B) // Wake up and wait for delay time to sleepp
            {
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                if (PMU.isCharging())
                {
                    StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                }
#endif
                if (((millis() > StandByTick) || (save_act)) && (pkgTxCount() == 0))
                {
                    save_act = false;
                    if (!save_mode)
                    {
                        save_mode = true;
                        log_d("System to light sleep Mode B %d Sec", config.pwr_sleep_interval);
                        // sleep_timer = millis() + (config.pwr_sleep_interval * 1000);
                        StandByTick = millis() + (config.pwr_sleep_interval * 1000);
                        vTaskDelete(taskSensorHandle);
                        PowerOff();
                        // adc_power_off();
                        vTaskDelete(taskNetworkHandle);
                        WiFi.disconnect(true); // Disconnect from the network
                        WiFi.persistent(false);
                        WiFi.mode(WIFI_OFF); // Switch WiFi off

                        // vTaskSuspend(taskNetworkHandle);
                        // delay(100);
                        setCpuFrequencyMhz(80);
// esp_task_wdt_deinit();
#ifdef __XTENSA__
#if SOC_PM_SUPPORT_RTC_SLOW_MEM_PD
                        esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_SLOW_MEM, ESP_PD_OPTION_ON);
#endif
                        esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
#endif
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                        PMU.disableDC5();
                        PMU.disableALDO1(); // QMC6310,BME280,OLED
                        // PMU.disableALDO3(); //LoRa
                        PMU.disableBLDO2();
                        PMU.disableALDO2();
                        PMU.disableALDO4(); // GNSS,
                        PMU.disableBLDO1(); // TF Card
                        PMU.disableDC3();
                        // esp_sleep_enable_ext0_wakeup((gpio_num_t)PMU_IRQ, LOW);
                        gpio_wakeup_enable((gpio_num_t)PMU_IRQ, GPIO_INTR_LOW_LEVEL);
#else
#if defined(__XTENSA__)
                        esp_sleep_enable_ext0_wakeup((gpio_num_t)config.rf_dio1_gpio, HIGH);
                        // gpio_wakeup_enable ((gpio_num_t)config.rf_dio1_gpio, GPIO_INTR_HIGH_LEVEL);
#else
                        // esp_sleep_enable_ext1_wakeup(0x200, ESP_EXT1_WAKEUP_ALL_LOW);
                        esp_deep_sleep_enable_gpio_wakeup((1 << config.rf_dio1_gpio), ESP_GPIO_WAKEUP_GPIO_HIGH);
#endif
#endif

