nakhonthai/ESP32APRS_LoRa/src/main.cpp
                        delay(100);
#ifdef __XTENSA__
                        esp_sleep_enable_ext1_wakeup(0x1, ESP_EXT1_WAKEUP_ALL_LOW);
                        // gpio_wakeup_enable ((gpio_num_t)0, GPIO_INTR_LOW_LEVEL);
#else
                        // esp_deep_sleep_enable_gpio_wakeup((1<<9), ESP_GPIO_WAKEUP_GPIO_LOW);
                        gpio_wakeup_enable((gpio_num_t)9, GPIO_INTR_LOW_LEVEL);
#endif
                        esp_sleep_enable_timer_wakeup((uint64_t)config.pwr_sleep_interval * uS_TO_S_FACTOR);
                        esp_sleep_enable_gpio_wakeup();
                        esp_light_sleep_start();
                        save_mode = true;
                        save_act = true;
                        StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                    }
                    else
                    {
                        // Wakeup
                        save_mode = false;
                        log_d("System to wakeup sleep Mode B %d Sec", config.pwr_sleep_interval);
                        // sleep_timer = millis() + (config.pwr_sleep_interval * 1000);
                        StandByTick = millis() + (config.pwr_stanby_delay * 1000);
#if defined(__XTENSA__)
                        setCpuFrequencyMhz(240);
#else
                        setCpuFrequencyMhz(160);
#endif
                        // esp_task_wdt_reset();
                        //  esp_task_wdt_init(WDT_TIMEOUT, true); // enable panic so ESP32 restarts
                        //  esp_task_wdt_add(NULL);               // add current thread to WDT watch
                        //  esp_task_wdt_reset();
                        //  adc_power_on();
                        //  WiFi.disconnect(false);  // Reconnect the network
                        //  WiFi.mode(WIFI_STA);    // Switch WiFi off
                        PowerOn();
                        sensorInit(false);
                        delay(100);
                        vTaskResume(taskSensorHandle);
#ifdef __XTENSA__
                        xTaskCreatePinnedToCore(
                            taskNetwork,        /* Function to implement the task */
                            "taskNetwork",      /* Name of the task */
                            12000,              /* Stack size in words */
                            NULL,               /* Task input parameter */
                            0,                  /* Priority of the task */
                            &taskNetworkHandle, /* Task handle. */
                            1);                 /* Core where the task should run */
                        xTaskCreatePinnedToCore(
                            taskSensor,        /* Function to implement the task */
                            "taskSensor",      /* Name of the task */
                            4096,              /* Stack size in words */
                            NULL,              /* Task input parameter */
                            1,                 /* Priority of the task */
                            &taskSensorHandle, /* Task handle. */
                            1);                /* Core where the task should run */
#else
                        xTaskCreatePinnedToCore(
                            taskNetwork,        /* Function to implement the task */
                            "taskNetwork",      /* Name of the task */
                            12000,              /* Stack size in words */
                            NULL,               /* Task input parameter */
                            1,                  /* Priority of the task */
                            &taskNetworkHandle, /* Task handle. */
                            0);                 /* Core where the task should run */
                        xTaskCreatePinnedToCore(
                            taskSensor,        /* Function to implement the task */
                            "taskSensor",      /* Name of the task */
                            4096,              /* Stack size in words */
                            NULL,              /* Task input parameter */
                            4,                 /* Priority of the task */
                            &taskSensorHandle, /* Task handle. */
                            0);                /* Core where the task should run */
#endif
                        // vTaskResume(taskNetworkHandle);
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                        PMU.enableDC5();
                        PMU.enableALDO1();
                        PMU.enableALDO3();
                        PMU.enableBLDO2();
                        PMU.enableALDO2();
                        PMU.enableALDO4();
                        PMU.enableBLDO1();
                        PMU.enableDC3();
#endif
                    }
                }
            }
            else if (config.pwr_mode == MODE_C) // Wake up and wait for event to sleep
            {
                if ((Sleep_Activate == ACTIVATE_OFF) && (millis() > StandByTick) && (pkgTxCount() == 0))
                {
                    log_d("System to SLEEP Mode %d Sec", config.pwr_sleep_interval);
                    // radioSleep();
                    // esp_deep_sleep_enable_gpio_wakeup(BIT(DEFAULT_WAKEUP_PIN), DEFAULT_WAKEUP_LEVEL));
                    PowerOff();
                    // delay(100);
                    // esp_sleep_enable_ext0_wakeup(GPIO_NUM_14,LOW);
                    radioSleep();
#if defined(T_BEAM_S3_SUPREME) || defined(T_BEAM_S3_BPF) || defined(TTGO_T_Beam_V1_2)
                    PMU.disableDC5();
                    PMU.disableALDO1();
                    PMU.disableALDO3();
                    PMU.disableBLDO2();
                    PMU.disableALDO2();
                    PMU.disableALDO4();
                    PMU.disableBLDO1();
                    PMU.disableDC3();
#endif

                    delay(100);
#ifdef __XTENSA__
                    esp_sleep_enable_ext1_wakeup(0x1, ESP_EXT1_WAKEUP_ALL_LOW);
#else
                    esp_deep_sleep_enable_gpio_wakeup((1 << 9), ESP_GPIO_WAKEUP_GPIO_LOW);
#endif
                    esp_sleep_enable_timer_wakeup((uint64_t)config.pwr_sleep_interval * uS_TO_S_FACTOR);
                    esp_deep_sleep_start();
                }
            }
        }
        // if (ESP.getFreeHeap() < 60000)
        //     esp_restart();
        // Serial.println(String(ESP.getFreeHeap()));
    }
}

String sendIsAckMsg(String toCallSign, int msgId)
{
    char str[250];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    sprintf(call, "%s-%d", config.igate_mycall, config.igate_ssid);
    strcpy(&call[0], toCallSign.c_str());
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;
    memset(&str[0], 0, 250);

    sprintf(str, "%s-%d>APE32L%s::%s:ack%d", config.igate_mycall, config.igate_ssid, VERSION, call, msgId);
    //	client.println(str);
    return String(str);
}

