nakhonthai/ESP32APRS_LoRa/src/main.cpp
                //  log_d("Ext Yaesu Packet >> %s",info.c_str());
                int ed = info.indexOf(" [");
                if (info != "" && ed > 10)
                {
                    raw.clear();
                    raw = info.substring(0, ed);
                    int st = info.indexOf(">:");
                    if (st > ed)
                    {
                        int idx = 0;
                        st += 2;
                        for (int i = 0; i < 5; i++)
                        {
                            if (info.charAt(st + i) == 0x0A || info.charAt(st + i) == 0x0D)
                            {
                                idx++;
                            }
                            else
                            {
                                break;
                            }
                        }
                        st += idx;
                        ed = info.indexOf(0x0D, st + 1);
                        if (ed > info.length())
                            ed = info.length();
                        if (ed > st)
                        {
                            raw += ":" + info.substring(st, ed);

                            String src_call = raw.substring(0, raw.indexOf('>'));
                            if ((src_call != "") && (src_call.length() < 11) && (raw.length() < sizeof(rawP)))
                            {
                                memset(call, 0, sizeof(call));
                                strcpy(call, src_call.c_str());
                                memset(rawP, 0, sizeof(rawP));
                                strcpy(rawP, raw.c_str());
                                log_d("Yaesu Packet: CallSign:%s RAW:%s", call, rawP);
                                // String hstr="";
                                // for(int i=0;i<raw.length();i++){
                                //     hstr+=" "+String(rawP[i],HEX);
                                // }
                                // log_d("HEX: %s",hstr.c_str());
                                uint16_t type = pkgType((const char *)rawP);
                                pkgListUpdate(call, rawP, type, 1);
                                if (config.rf2inet && aprsClient.connected())
                                {
                                    // RF->INET
                                    aprsClient.write(&rawP[0], strlen(rawP)); // Send binary frame packet to APRS-IS (aprsc)
                                    aprsClient.write("\r\n");                 // Send CR LF the end frame packet
                                    status.rf2inet++;
                                    //igateTLM.RF2INET++;
                                    //igateTLM.RX++;
                                }
                            }
                        }
                    }
                }
            }
            //}
        }

        if(config.at_cmd_uart>0){
            if(config.at_cmd_uart == 1){ // UART0
                if(Serial0.available()){
                    String cmd=Serial0.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if(ret!="") Serial0.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
            else if(config.at_cmd_uart == 2){ // UART1
                if(Serial1.available()){
                    String cmd=Serial1.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if(ret!="") Serial1.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
            #if SOC_UART_NUM > 2
            else if(config.at_cmd_uart == 3){ // UART2
                if(Serial2.available()){
                    String cmd=Serial2.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if(ret!="") Serial2.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
            #endif
            else if(config.at_cmd_uart == 4){ // USB-CDC
                if(Serial.available()){
                    String cmd=Serial.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if(ret!="") Serial.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
        }
    }
}

long timeSlot;
unsigned long iGatetickInterval;
unsigned long WxInterval;
unsigned long WxIntervalAvg = 0;
unsigned long msgInterval;
bool initInterval = true;
int trkTlmInvCount = 0;
int igateTlmInvCount = 0;
int digiTlmInvCount = 0;

void taskAPRS(void *pvParameters)
{
    char sts[50];
    unsigned long tickInterval = 0;
    unsigned long DiGiInterval = 0;

    unsigned long igateSTSInterval = 0;
    unsigned long digiSTSInterval = 0;
    unsigned long trkSTSInterval = 0;

    log_d("Task APRS has been start");
    PacketBuffer.clean();

    #ifdef T_BEAM_S3_BPF
    pinMode(16,OUTPUT);
    digitalWrite(16,HIGH);
    #endif
    APRS_init(&config);
    #ifdef RF2
    APRS_init2(&config);
    #endif
    // APRS_setCallsign(config.igate_mycall, config.igate_ssid);
    sendTimer = millis() - (config.igate_interval * 1000) + 30000;
    //igateTLM.TeleTimeout = millis() + 60000; // 1Min

    timeSlot = millis();
    timeAprs = 0;

    timeSlot = millis();

    msgInterval=millis()+30000;

    tx_interval = config.trk_interval;
    initInterval = true;
    AFSKInitAct = true;
    WxIntervalAvg = millis() + (600 * 1000);
    WxInterval= millis() + (config.wx_interval * 1000);
    log_d("Task APRS init susses....");
    for (;;)
    {
        long now = millis();
        // wdtSensorTimer = now;
        time_t timeStamp;
        time(&timeStamp);
        if (initInterval)
        {
            tickInterval = DiGiInterval = iGatetickInterval = millis() + 10000;
            igateSTSInterval = digiSTSInterval = trkSTSInterval = millis() + 15000;
            systemTLM.ParmTimeout = millis() + 20000;
            systemTLM.TeleTimeout = millis() + 30000;
            initInterval = false;
            // tx_interval = config.trk_interval;
            //  if (config.pwr_en)
            //  {
            //      if (config.pwr_mode == MODE_A || config.pwr_mode == MODE_B) // CPU and Radio active, power down control
            //      {
            //              tx_interval = config.pwr_stanby_delay;
            //              tx_counter = 10;
            //      }
            //  }else{
            tx_counter = tx_interval - 10;
            //}
        }
        timerAPRS = micros() - timerAPRS_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerAPRS_old = micros();

        if(now>msgInterval)
        {
            msgInterval=millis()+config.msg_interval;
            sendAPRSMessageRetry();
        }

#ifdef BLUETOOTH
#if !defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32C6)
        if (NuSerial.isConnected())
        {
            if (NuSerial.available())
            {
                log_d("Bluetooth RX Data: %d Byte", NuSerial.available());
                if (config.bt_mode == 1)
                { // TNC2RAW MODE
                    String rxValue = NuSerial.readString();
                    uint8_t SendMode = TNC_CHANNEL;
                    if (config.igate_loc2rf)
                        SendMode |= RF_CHANNEL;
                    if (config.igate_loc2inet)
                        SendMode |= INET_CHANNEL;
                    pkgTxPush(rxValue.c_str(), rxValue.length(), 1, SendMode);
                }
                else if (config.bt_mode == 2)
                {
                    // KISS MODE
                    size_t num = NuSerial.available();
                    for (int i = 0; i < num; i++)
                    {
                        kiss_serial((uint8_t)NuSerial.read());
                    }
                }
                else if (config.bt_mode == 3)
                { // AT COMMAND
                        String cmd=NuSerial.readStringUntil('\n');
                        cmd.trim();
                        String ret = handleATCommand(String((char *)cmd.c_str()));
                        if(ret!="") NuSerial.println(ret);
                        log_d("AT-Command response: %s", ret.c_str());
                }
            }
        }
#else
        if (SerialBT.available())
        {
            log_d("Bluetooth RX Data: %d Byte", SerialBT.available());
            if (config.bt_mode == 1)
            { // TNC2RAW MODE
                String rxValue = SerialBT.readString();
                uint8_t SendMode = TNC_CHANNEL;
                if (config.igate_loc2rf)
                    SendMode |= RF_CHANNEL;
                if (config.igate_loc2inet)
                    SendMode |= INET_CHANNEL;
                pkgTxPush(rxValue.c_str(), rxValue.length(), 1, SendMode);
            }
            else if (config.bt_mode == 2)
            {
                // KISS MODE
                size_t num = SerialBT.available();
                for (int i = 0; i < num; i++)
                {
                    kiss_serial((uint8_t)SerialBT.read());
                }
            }
            else if (config.bt_mode == 3)
            { // AT COMMAND
                String cmd=SerialBT.readStringUntil('\n');
                cmd.trim();
                String ret = handleATCommand(String((char *)cmd.c_str()));
                if(ret!="") SerialBT.println(ret);
                log_d("AT-Command response: %s", ret.c_str());
            }
        }
#endif
#endif

