nakhonthai/ESP32APRS_LoRa/src/main.cpp
                if (config.trk_rssi)
                {
                    cmn += " ?RSSI";
                }

                if (config.trk_gps) // TRACKER by GPS
                {
                    rawData = trk_gps_postion(cmn);
                    #ifdef LOG_FILE
                    if (config.log & LOG_TRACKER)
                    {
                        logTracker(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                    }
                    #endif
                }
                else // TRACKER by FIX position
                {
                    rawData = trk_fix_position(cmn);
                    #ifdef LOG_FILE
                    if (config.log & LOG_TRACKER)
                    {
                        logTracker(config.trk_lat, config.trk_lon, 0, 0);
                    }
                    #endif
                }

                log_d("TRACKER RAW: %s\n", rawData.c_str());
                log_d("TRACKER EVENT_TX_POSITION=%d\t INTERVAL=%d\n", EVENT_TX_POSITION, tx_interval);
                tx_counter = 0;
                EVENT_TX_POSITION = 0;
                last_heading = SB_HEADING;
#if defined OLED || defined ST7735_160x80
                if (config.trk_gps)
                {
                    // if (gps.location.isValid() && (gps.hdop.hdop() < 10.0))
                    sprintf(sts, "POSITION GPS\nSPD %dkPh/%d\nINTERVAL %ds", SB_SPEED, SB_HEADING, tx_interval);
                    // else
                    //     sprintf(sts, "POSITION GPS\nGPS INVALID\nINTERVAL %ds", tx_interval);
                }
                else
                {
                    sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);
                }
                char name[12];
                if (strlen(config.trk_item) > 3)
                {
                    sprintf(name, "%s", config.trk_item);
                }
                else
                {
                    if (config.trk_ssid > 0)
                        sprintf(name, "%s-%d", config.trk_mycall, config.trk_ssid);
                    else
                        sprintf(name, "%s", config.trk_mycall);
                }
#endif
                uint8_t SendMode = 0;
                if (config.trk_loc2rf)
                    SendMode |= RF_CHANNEL;
                if (config.trk_loc2inet)
                    SendMode |= INET_CHANNEL;
                pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);

#if defined OLED || defined ST7735_160x80
                pushTxDisp(TXCH_RF, name, sts);
#endif
                rawData.clear();
                cmn.clear();
            }
        }

        // LOAD DATA incomming
        bool newIGatePkg = false;
        bool newDigiPkg = false;
        if (PacketBuffer.getCount() > 0)
        {
            String tnc2 = "";
            // นำข้อมูลแพ็จเกจจาก TNC ออกจากคิว
            PacketBuffer.pop(&incomingPacket);
            packet2Raw(tnc2, incomingPacket);
            newIGatePkg = true;
            newDigiPkg = true;
            if (config.ext_tnc_enable)
            {
                if (config.ext_tnc_channel > 0 && config.ext_tnc_channel < 5)
                {
                    if (config.ext_tnc_mode == 1)
                    {
                        // KISS MODE
                        uint8_t pkg[500];
                        int sz = kiss_wrapper(pkg);
                        if (config.ext_tnc_channel == 1)
                        {
                            Serial0.write(pkg, sz);
                        }
                        else if (config.ext_tnc_channel == 2)
                        {
                            Serial1.write(pkg, sz);
                        }
                        #if SOC_UART_NUM > 2
                        else if (config.ext_tnc_channel == 3)
                        {
                            Serial2.write(pkg, sz);
                        }
                        #endif
                        else if (config.ext_tnc_channel == 4)
                        {
                            Serial.write(pkg, sz);
                        }
                    }
                    else if (config.ext_tnc_mode == 2)
                    {
                        // TNC2
                        if (config.ext_tnc_channel == 1)
                        {
                            Serial0.println(tnc2);
                        }
                        else if (config.ext_tnc_channel == 2)
                        {
                            Serial1.println(tnc2);
                        }
                        #if SOC_UART_NUM > 2
                        else if (config.ext_tnc_channel == 3)
                        {
                            Serial2.println(tnc2);
                        }
                        #endif
                        else if (config.ext_tnc_channel == 4)
                        {
                            Serial.println(tnc2);
                        }
                    }
                }
            }
#ifdef BLUETOOTH
            if (config.bt_master)
            { // Output TNC2RAW to BT Serial
              // SerialBT.println(tnc2);
                if (config.bt_mode == 1 || config.bt_mode ==3)
                {
                    char *rawP = (char *)malloc(tnc2.length());
                    memcpy(rawP, tnc2.c_str(), tnc2.length());
#if defined(CONFIG_IDF_TARGET_ESP32) && !defined(CONFIG_IDF_TARGET_ESP32C6)
                    SerialBT.write((uint8_t *)rawP, tnc2.length());
#else
                    if (NuSerial.isConnected())
                    {
                        NuSerial.write((uint8_t *)rawP, tnc2.length());
                    }
#endif
                    free(rawP);
                }
                else if (config.bt_mode == 2)
                { // KISS
                    uint8_t pkg[500];
                    int sz = kiss_wrapper(pkg);
#if defined(CONFIG_IDF_TARGET_ESP32) && !defined(CONFIG_IDF_TARGET_ESP32C6)
                    SerialBT.write(pkg, sz);
#else
                    if (NuSerial.isConnected())
                    {
                        NuSerial.write(pkg, sz);
                    }
#endif
                }
            }
#endif

