nakhonthai/ESP32APRS_LoRa/src/main.cpp
#ifdef MQTT
                if (config.en_mqtt && clientMQTT.connected() && (config.mqtt_topic_flag & MQTT_TOPIC_TNC))
                {
                    log_d("Publish MQTT Topic: %s Payload: %s", config.mqtt_topic, tnc2.c_str());
                    clientMQTT.publish(config.mqtt_topic, tnc2.c_str());
                }
#endif

            log_d("RX: %s", tnc2.c_str());

            // SerialBT.println(tnc2);
            uint16_t type = pkgType((char *)incomingPacket.info);
            if (!(type & FILTER_THIRDPARTY))
            {
                char call[11];
                if (incomingPacket.src.ssid > 0)
                    sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
                else
                    sprintf(call, "%s", incomingPacket.src.call);

                char *rawP = (char *)calloc(tnc2.length()+1, sizeof(char));
                if (rawP)
                {
                    memset(rawP, 0, tnc2.length()+1);
                    tnc2.toCharArray(rawP, tnc2.length(), 0);
                    // memcpy(rawP, tnc2.c_str(), tnc2.length());
                    int idx = pkgListUpdate(call, rawP, type, 0);

#if defined OLED || defined ST7735_160x80
                    if (idx > -1)
                    {

                        if (config.rx_display && config.dispRF && (type & config.dispFilter))
                        {
                            dispBuffer.push(rawP);
                            log_d("RF_putQueueDisp:[pkgList_idx=%d,Type=%d RAW:%s] %s\n", idx, type, call, rawP);
                        }
                    }
#endif
                    free(rawP);
                }
            }
            if(config.msg_enable && (type & FILTER_MESSAGE))
            {
                handleIncomingAPRS(tnc2);
            }
            lastPkg = true;
            lastPkgRaw = tnc2;
            handle_ws();
            // ESP_BT.println(tnc2);
            tnc2.clear();
        }

        // IGate Process
        if (config.igate_en)
        {
            if (config.igate_sts_interval > 10)
            {
                if (millis() > igateSTSInterval)
                {
                    igateSTSInterval = millis() + (config.igate_sts_interval * 1000);
                    igate_status(config.igate_status);
                }
            }
            // IGATE Position
            if (config.igate_bcn)
            {
                if (millis() > iGatetickInterval)
                {

                    String rawData = "";
                    if (config.igate_gps)
                    { // IGATE Send GPS position
                        if (gps.location.isValid())
                        {
                            rawData = igate_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                            #ifdef LOG_FILE
                            if (config.log & LOG_IGATE)
                            {
                                logIGate(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                            }
                            #endif
                        }
                    }
                    else
                    { // IGATE Send fix position
                        rawData = igate_position(config.igate_lat, config.igate_lon, config.igate_alt, "");
                        #ifdef LOG_FILE
                        if (config.log & LOG_TRACKER)
                        {
                            logIGate(config.igate_lat, config.igate_lon, 0, 0);
                        }
                        #endif
                    }
                    if (rawData != "")
                    {
                        iGatetickInterval = millis() + (config.igate_interval * 1000);
                        Sleep_Activate &= ~ACTIVATE_IGATE;
                        StandByTick = millis() + (5000);
                        if (config.igate_tlm_interval > 0)
                        {
                            igateTlmInvCount++;
                            if ((igateTlmInvCount >= config.igate_tlm_interval) || (TLM_SEQ == 0))
                            {
                                igateTlmInvCount = 0;
                                if (config.igate_tlm_sensor[0] | config.igate_tlm_sensor[1] | config.igate_tlm_sensor[2] | config.igate_tlm_sensor[3] | config.igate_tlm_sensor[4])
                                {
                                    char tlm_result[100];
                                    char tlm_data[200];
                                    size_t tlm_sz;
                                    if ((IGATE_TLM_SEQ % 100) == 0)
                                    {
                                        char rawInfo[100];
                                        char name[10];
                                        sprintf(rawInfo, "PARM.");
                                        int i, c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.igate_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                sprintf(name, "%s", config.igate_tlm_PARM[i]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c + 8; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                        }
                                        sendTelemetry_igate(rawInfo, 3000);
                                        memset(rawInfo, 0, sizeof(rawInfo));
                                        sprintf(rawInfo, "UNIT.");
                                        c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.igate_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                sprintf(name, "%s", config.igate_tlm_UNIT[i]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c + 8; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                        }
                                        sendTelemetry_igate(rawInfo, 6000);
                                        memset(rawInfo, 0, sizeof(rawInfo));
                                        sprintf(rawInfo, "EQNS.");
                                        c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.igate_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                if (fmod(config.igate_tlm_EQNS[i][0], 1) == 0)
                                                    sprintf(name, "%0.f", config.igate_tlm_EQNS[i][0]);
                                                else
                                                    sprintf(name, "%.3f", config.igate_tlm_EQNS[i][0]);
                                                strcat(rawInfo, name);
                                                if (fmod(config.igate_tlm_EQNS[i][1], 1) == 0)
                                                    sprintf(name, ",%0.f", config.igate_tlm_EQNS[i][1]);
                                                else
                                                    sprintf(name, ",%.3f", config.igate_tlm_EQNS[i][1]);
                                                strcat(rawInfo, name);
                                                if (fmod(config.igate_tlm_EQNS[i][2], 1) == 0)
                                                    sprintf(name, ",%0.f", config.igate_tlm_EQNS[i][2]);
                                                else
                                                    sprintf(name, ",%.3f", config.igate_tlm_EQNS[i][2]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                            sprintf(name, "0");
                                            strcat(rawInfo, name);
                                            sprintf(name, ",1");
                                            strcat(rawInfo, name);
                                            sprintf(name, ",0");
                                            strcat(rawInfo, name);
                                        }
                                        // strcat(rawInfo, ",");
                                        sendTelemetry_igate(rawInfo, 9000);
                                    }

