nakhonthai/ESP32APRS_LoRa/src/main.cpp
                                    if (++IGATE_TLM_SEQ > 8279)
                                        IGATE_TLM_SEQ = 0;
                                    memset(tlm_data, 0, 200);
                                    memset(tlm_result, 0, 100);
                                    int n = 0;
                                    sprintf(tlm_data, "%i", IGATE_TLM_SEQ);
                                    for (int s = 0; s < 5; s++)
                                    {
                                        if (config.igate_tlm_sensor[s] == 0)
                                        {
                                            continue;
                                            // strcat(tlm_data, "0");
                                        }
                                        else
                                        {
                                            strcat(tlm_data, ",");
                                            int sen_idx = config.igate_tlm_sensor[s] - 1;
                                            double data = 0;
                                            if (sen[sen_idx].visable)
                                                data = sen[sen_idx].sample;
                                            double precision = pow(10.0f, (double)config.igate_tlm_precision[s]);
                                            int val = (int)((data + config.igate_tlm_offset[s]) * precision);
                                            // log_d("s:%d Data:%.2f /tPresion:%.5f /tOffset:%.5f/t Val:%d",s,sen[sen_idx].sample,precision,config.trk_tlm_offset[s],val);
                                            if (val > 8280)
                                                val = 8280;
                                            if (val < 0)
                                                val = 0;
                                            char strVal[10];
                                            sprintf(strVal, "%i", val);
                                            strcat(tlm_data, strVal);
                                        }
                                    }
                                    // log_d("TLM_DATA:%s",tlm_data);
                                    //  sprintf(tlm_data, "%i,%i,%i,%i", TLM_SEQ, (int)(VBat * 100), int(TempNTC * 100), gps.satellites.value());
                                    telemetry_base91(tlm_data, tlm_result, tlm_sz);
                                    rawData += String(tlm_result);
                                }
                            }
                        }
                        if (strlen(config.igate_comment) > 0)
                        {
                            rawData += String(config.igate_comment);
                        }

                        log_d("IGATE_POSITION: %s", rawData.c_str());

                        if (config.igate_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);

                        uint8_t SendMode = 0;
                        if (config.igate_loc2rf)
                            SendMode |= RF_CHANNEL;
                        if (config.igate_loc2inet)
                            SendMode |= INET_CHANNEL;
                        pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);
#if defined OLED || defined ST7735_160x80
                        pushTxDisp(TXCH_RF, "TX IGATE", sts);
#endif
                    }
                }
            }
            // IGATE send to inet
            if ((newIGatePkg && aprsClient.connected()==true))
            {
                newIGatePkg = false;
                // if (config.rf2inet && aprsClient.connected())
                if (config.rf2inet)
                {
                    int ret = 0;
                    uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                    // IGate Filter RF->INET
                    if ((type & config.rf2inetFilter))
                        ret = igateProcess(incomingPacket);
                    if (ret == 0)
                    {
                        status.dropCount++;
                        //igateTLM.DROP++;
                    }
                    else
                    {
                        status.rf2inet++;
                        //igateTLM.RF2INET++;
                    }
                }
            }
            if(config.digi_auto){
               DiGiInterval = millis() + (config.digi_interval * 1000);
            }
        }

        // Digi Repeater Process
        if (config.digi_en || (config.digi_auto && (aprsClient.connected() == false)))
        {
            if (config.digi_sts_interval > 10)
            {
                if (millis() > digiSTSInterval)
                {
                    digiSTSInterval = millis() + (config.digi_sts_interval * 1000);
                    digi_status(config.digi_status);
                }
            }
            // DIGI Position
            if (config.digi_bcn)
            {
                if (millis() > DiGiInterval)
                {

                    String rawData;
                    if (config.digi_gps)
                    { // DIGI Send GPS position
                        if (gps.location.isValid())
                        {
                            rawData = digi_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                            #ifdef LOG_FILE
                            if (config.log & LOG_DIGI)
                            {
                                logDigi(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                            }
                            #endif
                        }
                    }
                    else
                    { // DIGI Send fix position
                        rawData = digi_position(config.digi_lat, config.digi_lon, config.digi_alt, "");
                        #ifdef LOG_FILE
                        if (config.log & LOG_DIGI)
                        {
                            logDigi(config.digi_lat, config.digi_lon, 0, 0);
                        }
                        #endif
                    }
                    if (rawData != "")
                    {
                        DiGiInterval = millis() + (config.digi_interval * 1000);
                        Sleep_Activate &= ~ACTIVATE_DIGI;
                        StandByTick = millis() + (5000);
                        if (config.digi_tlm_interval > 0)
                        {
                            digiTlmInvCount++;
                            if ((digiTlmInvCount >= config.digi_tlm_interval) || (TLM_SEQ == 0))
                            {
                                digiTlmInvCount = 0;
                                if (config.digi_tlm_sensor[0] | config.digi_tlm_sensor[1] | config.digi_tlm_sensor[2] | config.digi_tlm_sensor[3] | config.digi_tlm_sensor[4])
                                {
                                    char tlm_result[100];
                                    char tlm_data[200];
                                    size_t tlm_sz;
                                    if ((DIGI_TLM_SEQ % 100) == 0)
                                    {
                                        char rawInfo[100];
                                        char name[10];
                                        sprintf(rawInfo, "PARM.");
                                        int i, c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.digi_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                sprintf(name, "%s", config.digi_tlm_PARM[i]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c + 8; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                        }
                                        sendTelemetry_digi(rawInfo, 6000);
                                        memset(rawInfo, 0, sizeof(rawInfo));
                                        sprintf(rawInfo, "UNIT.");
                                        c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.digi_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                sprintf(name, "%s", config.digi_tlm_UNIT[i]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c + 8; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                        }
                                        sendTelemetry_digi(rawInfo, 11000);
                                        memset(rawInfo, 0, sizeof(rawInfo));
                                        sprintf(rawInfo, "EQNS.");
                                        c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.digi_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                if (fmod(config.digi_tlm_EQNS[i][0], 1) == 0)
                                                    sprintf(name, "%0.f", config.digi_tlm_EQNS[i][0]);
                                                else
                                                    sprintf(name, "%.3f", config.digi_tlm_EQNS[i][0]);
                                                strcat(rawInfo, name);
                                                if (fmod(config.digi_tlm_EQNS[i][1], 1) == 0)
                                                    sprintf(name, ",%0.f", config.digi_tlm_EQNS[i][1]);
                                                else
                                                    sprintf(name, ",%.3f", config.digi_tlm_EQNS[i][1]);
                                                strcat(rawInfo, name);
                                                if (fmod(config.digi_tlm_EQNS[i][2], 1) == 0)
                                                    sprintf(name, ",%0.f", config.digi_tlm_EQNS[i][2]);
                                                else
                                                    sprintf(name, ",%.3f", config.digi_tlm_EQNS[i][2]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                            sprintf(name, "0");
                                            strcat(rawInfo, name);
                                            sprintf(name, ",1");
                                            strcat(rawInfo, name);
                                            sprintf(name, ",0");
                                            strcat(rawInfo, name);
                                        }
                                        // strcat(rawInfo, ",");
                                        sendTelemetry_digi(rawInfo, 16000);
                                    }

                                    if (++DIGI_TLM_SEQ > 8279)
                                        DIGI_TLM_SEQ = 0;
                                    memset(tlm_data, 0, 200);
                                    memset(tlm_result, 0, 100);
                                    int n = 0;
                                    sprintf(tlm_data, "%i", DIGI_TLM_SEQ);
                                    for (int s = 0; s < 5; s++)
                                    {
                                        if (config.digi_tlm_sensor[s] == 0)
                                        {
                                            continue;
                                            // strcat(tlm_data, "0");
                                        }
                                        else
                                        {
                                            strcat(tlm_data, ",");
                                            int sen_idx = config.digi_tlm_sensor[s] - 1;
                                            double data = 0;
                                            if (sen[sen_idx].visable)
                                                data = sen[sen_idx].sample;
                                            double precision = pow(10.0f, (double)config.digi_tlm_precision[s]);
                                            int val = (int)((data + config.digi_tlm_offset[s]) * precision);
                                            // log_d("s:%d Data:%.2f /tPresion:%.5f /tOffset:%.5f/t Val:%d",s,sen[sen_idx].sample,precision,config.trk_tlm_offset[s],val);
                                            if (val > 8280)
                                                val = 8280;
                                            if (val < 0)
                                                val = 0;
                                            char strVal[10];
                                            sprintf(strVal, "%i", val);
                                            strcat(tlm_data, strVal);
                                        }
                                    }
                                    // log_d("TLM_DATA:%s",tlm_data);
                                    //  sprintf(tlm_data, "%i,%i,%i,%i", TLM_SEQ, (int)(VBat * 100), int(TempNTC * 100), gps.satellites.value());
                                    telemetry_base91(tlm_data, tlm_result, tlm_sz);
                                    rawData += String(tlm_result);
                                }
                            }
                        }
                        if (strlen(config.digi_comment) > 0)
                        {
                            rawData += String(config.digi_comment);
                        }

