nakhonthai/ESP32APRS_LoRa/src/main.cpp
                        log_d("DIGI_POSITION: %s", rawData.c_str());

                        if (config.digi_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);

                        uint8_t SendMode = 0;
                        if (config.digi_loc2rf)
                            SendMode |= RF_CHANNEL;
                        if (config.digi_loc2inet)
                            SendMode |= INET_CHANNEL;
                        pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);
#if defined OLED || defined ST7735_160x80
                        pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
#endif
                    }
                    rawData.clear();
                }
            }

            // Repeater packet
            if (newDigiPkg)
            {
                newDigiPkg = false;
                uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                Sleep_Activate &= ~ACTIVATE_DIGI;
                StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                // Digi repeater filter
                if ((type & config.digiFilter))
                {
                    // Packet recheck
                    pkgTxDuplicate(incomingPacket); // Search duplicate in tx and drop packet for renew
                    int dlyFlag = digiProcess(incomingPacket);
                    if (dlyFlag > 0)
                    {
                        int digiDelay;
                        status.digiCount++;
                        if (dlyFlag == 1)
                        {
                            digiDelay = 0;
                        }
                        else
                        {
                            if (config.digi_delay == 0)
                            { // Auto mode
                              // if (digiCount > 20)
                              //   digiDelay = random(5000);
                              // else if (digiCount > 10)
                              //   digiDelay = random(3000);
                              // else if (digiCount > 0)
                              //   digiDelay = random(1500);
                              // else
                                digiDelay = random(100);
                            }
                            else
                            {
                                digiDelay = random(config.digi_delay);
                            }
                        }

                        String digiPkg;
                        packet2Raw(digiPkg, incomingPacket);
                        log_d("DIGI_REPEAT: %s", digiPkg.c_str());
                        log_d("DIGI delay=%d ms.", digiDelay);
                        // char *rawP = (char *)calloc(digiPkg.length()+1, sizeof(char));
                        //  digiPkg.toCharArray(rawP, digiPkg.length());
                        // memcpy(rawP, digiPkg.c_str(), digiPkg.length());
                        pkgTxPush(digiPkg.c_str(), digiPkg.length(), digiDelay, RF_CHANNEL);
                        digiPkg.clear();
                        sprintf(sts, "--src call--\n%s\nDelay: %dms.", incomingPacket.src.call, digiDelay);
#if defined OLED || defined ST7735_160x80
                        pushTxDisp(TXCH_DIGI, "DIGI REPEAT", sts);
#endif
                        // free(rawP);
                    }
                }
            }
        }

        // Weather
        if (config.wx_en)
        {
            if (millis() > WxInterval)
            {

                String rawData = "";
                if (config.wx_gps)
                { // Wx Send GPS position
                    if (gps.location.isValid())
                    {
                        rawData = wx_report(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                        #ifdef LOG_FILE
                        if (config.log & LOG_WX)
                        {
                            logWeather(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                        }
                        #endif
                    }
                }
                else
                { // Wx Send fix position
                    rawData = wx_report(config.wx_lat, config.wx_lon, config.wx_alt, "");
                    #ifdef LOG_FILE
                    if (config.log & LOG_WX)
                    {
                        logWeather(config.wx_lat, config.wx_lon, 0, 0);
                    }
                    #endif
                }
                if (!rawData.isEmpty())
                {
                    WxInterval = millis() + (config.wx_interval * 1000);
                    Sleep_Activate &= ~ACTIVATE_WX;
                    StandByTick = millis() + (5000);
                    log_d("WX_REPORT: %s", rawData.c_str());
                    uint8_t SendMode = 0;
                    if (config.wx_2rf)
                        SendMode |= RF_CHANNEL;
                    if (config.wx_2inet)
                        SendMode |= INET_CHANNEL;
                    pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);
#ifdef OLED
                    sprintf(sts, "--src call--\n%s\nDelay: %dms.", config.wx_mycall, (config.wx_interval * 1000));
                    pushTxDisp(TXCH_RF, "WX REPORT", sts);
#endif
                }
                else
                {
                    WxInterval = millis() + (10 * 1000);
                }
#ifdef MQTT
                if (config.en_mqtt && (config.mqtt_topic_flag & MQTT_TOPIC_WX) && clientMQTT.connected())
                {
                    char payload[500];
                    char topic[100];
                    if(strlen(config.wx_object)<3)
                        sprintf(topic,"/%s/WEATHER/sample",config.wx_mycall);
                    else
                        sprintf(topic,"/%s/WEATHER/sample",config.wx_object);
                    getWxJson(&payload[0],false);
                    log_d("Publish MQTT Topic: %s Payload: %s", config.mqtt_topic, payload);
                    clientMQTT.publish(config.mqtt_topic, payload);
                }
#endif
            }
#ifdef MQTT            
            if (millis() > WxIntervalAvg)
            {
                WxIntervalAvg = millis() + (600 * 1000);
                if (config.en_mqtt && (config.mqtt_topic_flag & MQTT_TOPIC_WX) && clientMQTT.connected())
                {
                    char payload[500];
                    char topic[100];
                    if(strlen(config.wx_object)<3)
                        sprintf(topic,"/%s/WEATHER/average",config.wx_mycall);
                    else
                        sprintf(topic,"/%s/WEATHER/average",config.wx_object);
                    getWxJson(&payload[0],true);
                    log_d("Publish MQTT Topic: %s Payload: %s", topic, payload);
                    clientMQTT.publish(topic, payload);
                }
            }
#endif            
        }

        if (config.tlm0_en)
        {
            if (systemTLM.ParmTimeout < millis())
            {
                systemTLM.ParmTimeout = millis() + (config.tlm0_info_interval * 1000);
                char rawInfo[100];
                char name[10];
                sprintf(rawInfo, "PARM.");
                for (int i = 0; i < 13; i++)
                {
                    if (i > 0)
                        strcat(rawInfo, ",");
                    sprintf(name, "%s", config.tlm0_PARM[i]);
                    strcat(rawInfo, name);
                }
                sendTelemetry_0(rawInfo, true);
                memset(rawInfo, 0, sizeof(rawInfo));
                sprintf(rawInfo, "UNIT.");
                for (int i = 0; i < 13; i++)
                {
                    if (i > 0)
                        strcat(rawInfo, ",");
                    sprintf(name, "%s", config.tlm0_UNIT[i]);
                    strcat(rawInfo, name);
                }
                sendTelemetry_0(rawInfo, true);
                memset(rawInfo, 0, sizeof(rawInfo));
                sprintf(rawInfo, "EQNS.");
                for (int i = 0; i < 5; i++)
                {
                    if (i > 0)
                        strcat(rawInfo, ",");
                    if (fmod(config.tlm0_EQNS[i][0], 1) == 0)
                        sprintf(name, "%0.f", config.tlm0_EQNS[i][0]);
                    else
                        sprintf(name, "%.3f", config.tlm0_EQNS[i][0]);
                    strcat(rawInfo, name);
                    if (fmod(config.tlm0_EQNS[i][1], 1) == 0)
                        sprintf(name, ",%0.f", config.tlm0_EQNS[i][1]);
                    else
                        sprintf(name, ",%.3f", config.tlm0_EQNS[i][1]);
                    strcat(rawInfo, name);
                    if (fmod(config.tlm0_EQNS[i][2], 1) == 0)
                        sprintf(name, ",%0.f", config.tlm0_EQNS[i][2]);
                    else
                        sprintf(name, ",%.3f", config.tlm0_EQNS[i][2]);
                    strcat(rawInfo, name);
                }
                sendTelemetry_0(rawInfo, true);
                memset(rawInfo, 0, sizeof(rawInfo));
                sprintf(rawInfo, "BITS.");
                uint8_t b = 1;
                for (int i = 0; i < 8; i++)
                {
                    if (config.tlm0_BITS_Active & b)
                    {
                        strcat(rawInfo, "1");
                    }
                    else
                    {
                        strcat(rawInfo, "0");
                    }
                    b <<= 1;
                }
                strcat(rawInfo, ",");
                strcat(rawInfo, config.tlm0_comment);
                sendTelemetry_0(rawInfo, true);
            }

            if (systemTLM.TeleTimeout < millis())
            {
                systemTLM.TeleTimeout = millis() + (config.tlm0_data_interval * 1000);
                Sleep_Activate &= ~ACTIVATE_TELEMETRY;
                StandByTick = millis() + (5000);
                char rawTlm[100];
                if (systemTLM.Sequence > 999)
                    systemTLM.Sequence = 0;
                else
                    systemTLM.Sequence++;
                getTelemetry_0();
                sprintf(rawTlm, "T#%03d,%03d,%03d,%03d,%03d,%03d,", systemTLM.Sequence, systemTLM.A1, systemTLM.A2, systemTLM.A3, systemTLM.A4, systemTLM.A5);
                uint8_t b = 1;
                for (int i = 0; i < 8; i++)
                {
                    if (!((systemTLM.BITS & b) ^ (config.tlm0_BITS_Active & b)))
                    {
                        strcat(rawTlm, "1");
                    }
                    else
                    {
                        strcat(rawTlm, "0");
                    }
                    b <<= 1;
                }
                sendTelemetry_0(rawTlm, false);
            }
        }
    }
}

void taskAPRSPoll(void *pvParameters)
{
    // esp_task_wdt_config_t twdt_config = {
    //     .timeout_ms = 10000,                             // 10 seconds
    //     .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Bitmask of all cores
    //     .trigger_panic = false,
    // };
    // esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
    // esp_task_wdt_add(taskAPRSPollHandle);
    for (;;)
    {
        vTaskDelay(10 / portTICK_PERIOD_MS);
        if (AFSKInitAct == true)
        {
            //esp_task_wdt_reset();
            if (APRS_poll())
            {
                // StandByTick += millis() + 10000;
                StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                if (save_mode)
                    save_act = true;
            }
        }
    }
}

int mqttRetry = 0;
long wifiTTL = 0;

// WiFi connect timeout per AP. Increase when connecting takes longer.
const uint32_t connectTimeoutMs = 5000;
uint8_t APStationNum = 0;

#ifdef PPPOS
pppType pppStatus;
long int pppTimeout = 0;
#endif

IPAddress ap_ip(192, 168, 4, 1);
IPAddress ap_mask(255, 255, 255, 0);
IPAddress ap_leaseStart(192, 168, 4, 2);
IPAddress ap_dns(8, 8, 8, 8);

uint8_t wifiStatus = WL_DISCONNECTED;
bool vpnConnected = false;
bool wifiDisconnecting = false;
uint16_t wifiDisCount=0;
unsigned long vpnTimeout=0;
unsigned long mitiWifiTimeout=0;

void wifiConnection()
{
    WiFi.disconnect(true, true, 500);
                        WiFi.persistent(false);
                        WiFi.mode(WIFI_OFF); // Switch WiFi off

                        wifiTTL = 0;
                        delay(1000);
                        if (config.wifi_mode == WIFI_STA_FIX)
                        { /**< WiFi station mode */
                            WiFi.mode(WIFI_MODE_STA);
                            //WiFi.setTxPower((wifi_power_t)config.wifi_power);
                        }
                        else if (config.wifi_mode == WIFI_AP_FIX)
                        { /**< WiFi soft-AP mode */
                            WiFi.mode(WIFI_MODE_AP);
                            //WiFi.setTxPower((wifi_power_t)config.wifi_power);
                        }
                        else if (config.wifi_mode == WIFI_AP_STA_FIX)
                        { /**< WiFi station + soft-AP mode */
                            WiFi.mode(WIFI_MODE_APSTA);
                            //WiFi.setTxPower((wifi_power_t)config.wifi_power);
                        }
                        else
                        {
                            WiFi.mode(WIFI_MODE_NULL);
                        }
                        wifiMulti.APlistClean(); // Clean AP list        
                        for (int i = 0; i < 5; i++)
                        {
                            if (config.wifi_sta[i].enable)
                            {
                                wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
                            }
                        }
                        WiFi.setHostname(config.host_name);
                        if (wifiMulti.run() == WL_CONNECTED)
                        {
                            wifiDisCount=0;
                            pingTimeout = millis() + 60000;
                            NTP_Timeout = millis() + 2000;
                        }
}

void onEvent(arduino_event_id_t event, arduino_event_info_t info)
{
    switch (event)
    {
    #ifdef PPPOS
    case ARDUINO_EVENT_PPP_START:
        log_d("PPP Started");
        break;
    case ARDUINO_EVENT_PPP_CONNECTED:
        log_d("PPP Connected");
        if(!WiFi.isConnected()){
            if(config.vpn){
                log_d("Setup Wireguard VPN by PPP!");
                vpnConnected = false;
                vpnTimeout=millis()+3000;
            }
        
