nakhonthai/ESP32APRS_LoRa/src/main.cpp
        bool attached = PPP.attached();
        if (!attached)
        {
            int i = 0;
            unsigned int s = millis();
            log_d("Waiting to connect to network");
            while (!attached && ((++i) < 30))
            {
                log_d(".");
                delay(100);
                attached = PPP.attached();
            }
            log_d("%ds", (millis() - s) / 1000.0);
            attached = PPP.attached();
        }

        log_d("Attached: %d", attached);
        log_d("State: %d", PPP.radioState());
        if (attached)
        {
            sprintf(pppStatus.oper, "%s", PPP.operatorName().c_str());
            sprintf(pppStatus.imsi, "%s", PPP.IMSI().c_str());
            log_d("IMSI: %s", pppStatus.imsi);
            pppStatus.rssi = PPP.RSSI();
            log_d("Operator: %s", pppStatus.oper);
            log_d("RSSI: %d dBm", pppStatus.rssi);
            PPP.started(); // Start the PPP connection            
            //   if(PPP.sms("0984958488","Test SMS from ESP32")){
            //       log_d("SMS sent successfully!");
            //   } else {
            //       log_d("Failed to send SMS.");
            //   }
            int ber = PPP.BER();
            if (ber > 0)
            {
                log_d("BER: %i", ber);
                log_d("NetMode: %i", PPP.networkMode());
            }

            log_d("Switching to data mode...");
            PPP.mode(ESP_MODEM_MODE_DATA); // Data and Command mixed mode
            if (!PPP.waitStatusBits(ESP_NETIF_CONNECTED_BIT, 5000))
            {
                log_d("Failed to connect to internet!");
                PPP.mode(ESP_MODEM_MODE_COMMAND); // Switch back to command mode
            }
            else
            {
                log_d("Connected to internet!");
            }
        }
        else
        {
            log_d("Failed to connect to network!");
        }
    }
}
#endif

void taskNetwork(void *pvParameters)
{
    int c = 0;
    // char raw[500];
    log_d("Task Network has been start");
    manualWiFi = false;

    // Listen for modem events
    Network.onEvent(onEvent);

    // WiFi.onEvent(Wifi_connected,SYSTEM_EVENT_STA_CONNECTED);
    // WiFi.onEvent(Get_IPAddress, SYSTEM_EVENT_STA_GOT_IP);
    // WiFi.onEvent(Wifi_disconnected, SYSTEM_EVENT_STA_DISCONNECTED);

    if (config.wifi_mode == WIFI_STA_FIX)
    {
        /**< WiFi station mode */
        WiFi.mode(WIFI_MODE_STA);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    { /**< WiFi soft-AP mode */
        WiFi.mode(WIFI_MODE_AP);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    { /**< WiFi station + soft-AP mode */
        WiFi.mode(WIFI_MODE_APSTA);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else
    {
        WiFi.mode(WIFI_MODE_NULL);
    }

    if (config.wifi_mode & WIFI_STA_FIX)
    {
        manualWiFi = true; 
        wifiConnection();
        wifiMulti.setStrictMode(false);  // Default is true.  Library will disconnect and forget currently connected AP if it's not in the AP list.
        wifiMulti.setAllowOpenAP(true);  // Default is false.  True adds open APs to the AP list.
    }

    if (config.wifi_mode & WIFI_AP_FIX)
    {
        manualWiFi = true;
        // กำหนดค่าการทำงานไวไฟเป็นแอสเซสพ้อย
        // WiFi.softAP(config.wifi_ap_ssid, config.wifi_ap_pass); // Start HOTspot removing password will disable security
        // WiFi.softAPConfig(local_IP, gateway, subnet);
        log_d("Access point running. IP address: ");
        log_d("%s", WiFi.softAPIP().toString().c_str());
        // Start the Access Point
        WiFi.AP.begin();
        WiFi.AP.config(ap_ip, ap_ip, ap_mask, ap_leaseStart, ap_dns);
        WiFi.AP.create(config.wifi_ap_ssid, config.wifi_ap_pass);
        if (!WiFi.AP.waitStatusBits(ESP_NETIF_STARTED_BIT, 1000))
        {
            Serial.println("Failed to start AP!");
            // return;
        }
    }

    // WiFi.setSleep(false);
    //  if (config.uart1_enable)
    //  {
    //      PPPOS_init(config.uart1_tx_gpio, config.uart1_rx_gpio, config.uart1_baudrate, 1, ppp_user, ppp_pass);
    //  }

    pingTimeout = millis() + 10000;
    unsigned long timeNetworkOld = millis();
    timeNetwork = 0;

    #ifdef PPPOS
    PPPOS_Start(); // Start PPP connection if enabled
    pppTimeout = millis() + (600 * 1000);
    #endif

    #ifdef PPPOS
    if (config.ppp_enable || (config.wifi_mode & WIFI_AP_STA_FIX))
    #else
    if (config.wifi_mode & WIFI_AP_STA_FIX)
    #endif
        webService();
    #ifdef BLUETOOTH
    bluetooth_init(); // Initialize Bluetooth if enabled
    #endif

    for (;;)
    {
        unsigned long now = millis();
        timeNetwork = now - timeNetworkOld;
        timeNetworkOld = now;
        // wdtNetworkTimer = millis();
        //serviceHandle();
        timerNetwork = micros() - timerNetwork_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerNetwork_old = micros();

        #ifdef PPPOS
        if (config.ppp_enable)
        {
            if (!PPP.connected())
            {
                if (millis() > pppTimeout)
                {
                    log_d("PPP connection timeout!");
                    PPPOS_Start(); // Restart PPP connection
                    pppTimeout = millis() + (600 * 1000);
                }
            }
        }

        if (WiFi.isConnected() == true || WiFi.softAPgetStationNum() > 0 || PPP.connected())
        #else
        if (WiFi.isConnected() == true || WiFi.softAPgetStationNum())
        #endif
        {
            if (lastHeard_Flag && (millis() > lastHeardTimeout))
            {
                    lastHeard_Flag = false;
                    lastHeardTimeout = millis() + 1000;
                    event_lastHeard(false);                    
            }
        }

        if (config.wifi_mode & WIFI_AP_FIX)
        {
            APStationNum = WiFi.softAPgetStationNum();
            if (APStationNum > 0)
            {
                // config.pwr_sleep_activate |= ACTIVATE_WIFI;
                #ifdef PPPOS
                if ((WiFi.isConnected() == false) && (PPP.connected() == false))
                #else   
                if (WiFi.isConnected() == false)
                #endif
                {
                    vTaskDelay(9 / portTICK_PERIOD_MS);
                    continue;
                }
            }
        }
        wifiStatus = WL_DISCONNECTED;
        if (config.wifi_mode & WIFI_STA_FIX)
        {            
                if(WiFi.isConnected() == false)
                { 
                    if(millis()>mitiWifiTimeout){
                        mitiWifiTimeout=millis()+30000;                
                        log_d("WiFi Check Connection!");               
                        wifiStatus = wifiMulti.run();
                        vTaskDelay(2000 / portTICK_PERIOD_MS);
                    }
                }else{
                    wifiStatus = WL_CONNECTED;
                }
        }
        #ifdef PPPOS
        if ((wifiStatus == WL_CONNECTED) || (PPP.connected()))
        #else
        if ((wifiStatus == WL_CONNECTED))
        #endif
        {
            // config.pwr_sleep_activate |= ACTIVATE_WIFI;
            if (millis() > NTP_Timeout)
            {
                NTP_Timeout = millis() + 86400000;
                // setSyncProvider(getNtpTime);
                log_d("Contacting Time Server\n");
                configTime(3600 * config.timeZone, 0, config.ntp_host);
                vTaskDelay(1000 / portTICK_PERIOD_MS);
                struct tm tmstruct;
                if (getLocalTime(&tmstruct, 1000))
                {
                    time_t systemTime;
                    time(&systemTime);
                    setTime(systemTime);
                    if (systemUptime == 0)
                    {
                        systemUptime = time(NULL);
                    }
                    pingTimeout = millis() + 2000;
                    if (config.vpn)
                    {
                        // if (wireguard_up())
                        //     log_d("Wireguard UP Link");
                        // else
                        //     log_d("Wireguard Connect Fail!");
                        log_d("Setup Wireguard Setup!");
                        vpnTimeout=millis()+10000;
                        //if (wireguard_active()) wireguard_remove();
                        if (!wireguard_active())
                        {                            
                         //if (wireguard_active()) wireguard_remove();
                            log_d("Setup Wireguard VPN!");
                            if(WiFi.isConnected()){
                                wireguard_setup(NULL);
                                vpnConnected=true;
                            }else{
                                if(PPP.connected()){
                                    wireguard_setup((netif *)PPP.netif());
                                    vpnConnected=true;
                                }
                            }
                        }
                    }
                }
                else
                {
                    NTP_Timeout = millis() + 5000;                    
                }
            }

