nakhonthai/ESP32APRS_LoRa/src/main.cpp
            if(millis()>vpnTimeout && !vpnConnected && config.vpn){
                vpnTimeout=millis()+10000;                                
                log_d("RENEW Device Wireguard VPN!"); 
                wireguard_change_device();
                vpnConnected=true; 
            }

            if (config.igate_en)
            {
                if (aprsClient.connected() == false)
                {
                    APRSConnect();
                    if (config.igate_bcn)
                    {
                        iGatetickInterval = millis() + 10000; // send position after 10sec
                    }
                }
                else
                {
                    if (aprsClient.available())
                    {
                        pingTimeout = millis() + 300000;                // Reset ping timout
                        String line = aprsClient.readStringUntil('\n'); // อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
                        status.isCount++;
                        int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
                        if (start_val > 3)
                        {
                            String src_call = line.substring(0, start_val);
                            String msg_call = "::" + src_call;

                            status.allCount++;

                            log_d("INET: %s\n", line.c_str());
                            start_val = line.indexOf(":", 10); // Search of info in ax25
                            if (start_val > 5)
                            {
                                String info = line.substring(start_val + 1);
                                size_t rawSize = line.length();
                                char *raw = (char *)calloc(rawSize, sizeof(char));
                                if (raw)
                                {
                                    memset(raw, 0, rawSize);
                                    memcpy(raw, info.c_str(), info.length());

                                    uint16_t type = pkgType(&raw[0]);
                                    if(type & FILTER_MESSAGE)
                                    {
                                        handleIncomingAPRS(line);
                                    }
                                    int start_dstssid = line.indexOf("-", 1); // get SSID -
                                    if (start_dstssid < 0)
                                        start_dstssid = line.indexOf(" ", 1); // get ssid space
                                    char ssid = 0;
                                    if (start_dstssid > 0)
                                        ssid = line.charAt(start_dstssid + 1);

                                    if (ssid > 47 && ssid < 58)
                                    {
                                        size_t len = src_call.length();
                                        char call[15];
                                        memset(call, 0, sizeof(call));
                                        if (len > 15)
                                            len = 15;
                                        memcpy(call, src_call.c_str(), len);
                                        call[14] = 0;
                                        memset(raw, 0, rawSize);
                                        memcpy(raw, line.c_str(), line.length());
                                        int idx = pkgListUpdate(call, raw, type, 1);
                                        free(raw);
#if defined OLED || defined ST7735_160x80
                                        if (idx > -1)
                                        {
                                            // Put queue affter filter for display popup
                                            if (config.rx_display && config.dispINET && (type & config.dispFilter))
                                            {
                                                dispBuffer.push(line.c_str());
                                                log_d("INET_putQueueDisp:[pkgList_idx=%d/queue=%d,Type=%d] %s\n", idx, dispBuffer.getCount(), type, call);
                                            }
                                        }
#endif
                                        // INET2RF affter filter
                                        if (config.inet2rf)
                                        {
                                            if (type & config.inet2rfFilter)
                                            {
                                                String tnc2Raw = "";
                                                char *strtmp = (char *)calloc(350, sizeof(char));
                                                if (strtmp)
                                                {
                                                    memset(strtmp, 0, 350);
                                                    if (config.igate_ssid == 0)
                                                        sprintf(strtmp, "%s>APE32L", config.igate_mycall);
                                                    else
                                                        sprintf(strtmp, "%s-%d>APE32L", config.igate_mycall, config.igate_ssid);
                                                    tnc2Raw = String(strtmp);
                                                    tnc2Raw += ",RFONLY"; // fix path to rf only not send loop to inet
                                                    tnc2Raw += ":}";      // 3rd-party frame
                                                    tnc2Raw += line;
                                                    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, RF_CHANNEL);
                                                    char sts[50];
                                                    sprintf(sts, "--SRC CALL--\n%s\n", src_call.c_str());
#if defined OLED || defined ST7735_160x80
                                                    pushTxDisp(TXCH_3PTY, "TX INET->RF", sts);
#endif
                                                    status.inet2rf++;
                                                    //igateTLM.INET2RF++;
                                                    log_d("INET2RF: %s\n", line);
                                                    free(strtmp);
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }

