nakhonthai/ESP32APRS_LoRa/src/main.cpp
#ifdef MQTT
            if (config.en_mqtt)
            {
                if (!clientMQTT.connected())
                {
                    mqtt_reconnect();
                }
                else
                {
                    clientMQTT.loop();
                }
            }
#endif

            if (millis() > pingTimeout)
            {
                pingTimeout = millis() + 600000;
                if(config.wifi_mode & WIFI_STA_FIX)
                {
                    log_d("Ping WiFi to %s\n", WiFi.gatewayIP().toString().c_str());
                    IPAddress wifiIP;
                    wifiIP.fromString(String(WiFi.gatewayIP().toString()));
                    if (ping_start(wifiIP, 2, 0, 0, 10) == true)
                    {
                        log_d("Ping WiFi Success!!\n");
                    }
                    else
                    {
                        log_d("Ping WiFi Fail!\n");
                        wifiConnection();
                    }
                }
                // if (config.vpn)
                // {
                //     if (!wireguard_active())
                //     {
                //         log_d("Reconnection Wireguard VPN!");
                //         wireguard_remove();
                //         delay(1000);
                //         if(WiFi.isConnected()){
                //                 wireguard_setup(NULL);
                //             }else{
                //                 if(PPP.connected()){
                //                     wireguard_setup((netif *)PPP.netif());
                //                 }
                //             }
                //     }
                //     IPAddress vpnIP;
                //     vpnIP.fromString(String(config.wg_local_address));
                //     log_d("Ping VPN to %s", vpnIP.toString().c_str());
                //     if (ping_start(vpnIP, 2, 0, 0, 10) == true)
                //     {
                //         log_d("VPN Ping Success!");
                //     }
                //     else
                //     {
                //         log_d("VPN Ping Fail!");
                //         wireguard_remove();
                //         delay(1000);
                //         wireguard_setup(NULL);
                            
                //     }
                // }
                #ifdef PPPOS
                if(config.ppp_enable)
                {
                    if (PPP.connected())
                    {
                        //IPAddress pppIP(pppStatus.ip);
                        log_d("Ping PPP to %s", PPP.localIP().toString().c_str());
                        if ((PPP.linkUp()==true)&&(ping_start(PPP.localIP(), 2, 0, 0, 30) == true))
                        {
                            log_d("PPP Ping Success!!");
                        }
                        else
                        {
                            log_d("PPP Ping Fail!");
                            PPPOS_Start();
                            pppTimeout = millis() + (600 * 1000);
                        }
                    }
                }
                #endif
            }
        }
    } // for loop
}

#if defined OLED || defined ST7735_160x80
// Routine
void line_angle(signed int startx, signed int starty, unsigned int length, unsigned int angle, unsigned int color)
{
    display.drawLine(startx, starty, (startx + length * cosf(angle * 0.017453292519)), (starty + length * sinf(angle * 0.017453292519)), color);
}

int xSpiGlcdSelFontHeight = 8;
int xSpiGlcdSelFontWidth = 5;

void compass_label(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angleNew;
    // ushort Color[2];
    uint8_t x_N, y_N, x_S, y_S;
    int x[4], y[4], i;
    int xOffset, yOffset;
    yOffset = (xSpiGlcdSelFontHeight / 2);
    xOffset = (xSpiGlcdSelFontWidth / 2);
    // GLCD_WindowMax();
    angle += 270.0F;
    angleNew = angle;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x[i] = startx + (length * cosf(angleNew * 0.017453292519));
        y[i] = starty + (length * sinf(angleNew * 0.017453292519));
        x[i] -= xOffset;
        y[i] -= yOffset;
        angleNew += 90.0F;
    }
    angleNew = angle + 45.0F;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x_S = startx + ((length - 3) * cosf(angleNew * 0.017453292519));
        y_S = starty + ((length - 3) * sinf(angleNew * 0.017453292519));
        x_N = startx + ((length + 3) * cosf(angleNew * 0.017453292519));
        y_N = starty + ((length + 3) * sinf(angleNew * 0.017453292519));
        angleNew += 90.0F;
        display.drawLine(x_S, y_S, x_N, y_N, color);
    }
    display.drawCircle(startx, starty, length, color);
    display.setFont();
    display.drawChar((uint8_t)x[0], (uint8_t)y[0], 'N', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[1], (uint8_t)y[1], 'E', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[2], (uint8_t)y[2], 'S', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[3], (uint8_t)y[3], 'W', WHITE, BLACK, 1);
}

void compass_arrow(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angle1, angle2;
    int xdst, ydst, x1sta, y1sta, x2sta, y2sta;
    int length2 = length / 2;
    angle += 270.0F;
    if (angle > 360.0F)
        angle -= 360.0F;
    xdst = startx + length * cosf(angle * 0.017453292519);
    ydst = starty + length * sinf(angle * 0.017453292519);
    angle1 = angle + 135.0F;
    if (angle1 > 360.0F)
        angle1 -= 360.0F;
    angle2 = angle + 225.0F;
    if (angle2 > 360.0F)
        angle2 -= 360.0F;
    x1sta = startx + length2 * cosf(angle1 * 0.017453292519);
    y1sta = starty + length2 * sinf(angle1 * 0.017453292519);
    x2sta = startx + length2 * cosf(angle2 * 0.017453292519);
    y2sta = starty + length2 * sinf(angle2 * 0.017453292519);
    display.drawLine(startx, starty, xdst, ydst, color);
    display.drawLine(xdst, ydst, x1sta, y1sta, color);
    display.drawLine(x1sta, y1sta, startx, starty, color);
    display.drawLine(startx, starty, x2sta, y2sta, color);
    display.drawLine(x2sta, y2sta, xdst, ydst, color);
}

unsigned long disp_delay = 0;
void dispTxWindow(txDisp txs)
{
    if (config.tx_display == false)
        return;

