nakhonthai/ESP32APRS_LoRa/src/main.cpp
#ifdef OLED
#ifdef SH1106
            display.SH1106_command(0xE4);
#else
            display.ssd1306_command(0xE4);
#endif
            delay(10);
            display.clearDisplay();

            if (dispPush)
            {
                disp_delay = 600 * 1000;
                display.drawRoundRect(0, 0, 128, 16, 3, WHITE);
            }
            else
            {
                disp_delay = config.dispDelay * 1000;
            }
            timeHalfSec = millis() + disp_delay;
            // display.fillRect(0, 0, 128, 16, WHITE);
            const uint8_t *ptrSymbol;
            uint8_t symIdx = aprs.symbol[1] - 0x21;
            if (symIdx > 95)
                symIdx = 0;
            if (aprs.symbol[0] == '/')
            {
                ptrSymbol = &Icon_TableA[symIdx][0];
            }
            else if (aprs.symbol[0] == '\\')
            {
                ptrSymbol = &Icon_TableB[symIdx][0];
            }
            else
            {
                if (aprs.symbol[0] < 'A' || aprs.symbol[0] > 'Z')
                {
                    aprs.symbol[0] = 'N';
                    aprs.symbol[1] = '&';
                    symIdx = 5; // &
                }
                ptrSymbol = &Icon_TableB[symIdx][0];
            }
            display.drawYBitmap(0, 0, ptrSymbol, 16, 16, WHITE);
            if (!(aprs.symbol[0] == '/' || aprs.symbol[0] == '\\'))
            {
                display.drawChar(5, 4, aprs.symbol[0], BLACK, WHITE, 1);
                display.drawChar(6, 5, aprs.symbol[0], BLACK, WHITE, 1);
            }
#ifdef SSD1306_72x40
            display.setFont();
            display.setTextColor(BLACK);
            display.print(src_call);

            // if (aprs.srcname_len > 0)
            // {
            //     memset(&itemname, 0, sizeof(itemname));
            //     memcpy(&itemname, aprs.srcname, aprs.srcname_len);
            //     // Serial.println(itemname);
            //     display.setCursor(16, 0);
            //     display.print(itemname);
            //     display.setCursor(16, 7);
            //     display.print(src_call);
            // }
            // else
            // {
            //     display.setCursor(16, 4);
            //     display.print(src_call);
            // }

            display.setTextColor(WHITE);

            if (aprs.packettype & T_TELEMETRY)
            {
                bool show = false;
                int idx = tlmList_Find((char *)src_call.c_str());
                if (idx < 0)
                {
                    idx = tlmListOld();
                    if (idx > -1)
                        memset(&Telemetry[idx], 0, sizeof(Telemetry_struct));
                }
                if (idx > -1)
                {
                    Telemetry[idx].time = now();
                    strcpy(Telemetry[idx].callsign, (char *)src_call.c_str());

                    // for (int i = 0; i < 3; i++) Telemetry[idx].UNIT[i][5] = 0;
                    if (aprs.flags & F_UNIT)
                    {
                        memcpy(Telemetry[idx].UNIT, aprs.tlm_unit.val, sizeof(Telemetry[idx].UNIT));
                    }
                    else if (aprs.flags & F_PARM)
                    {
                        memcpy(Telemetry[idx].PARM, aprs.tlm_parm.val, sizeof(Telemetry[idx].PARM));
                    }
                    else if (aprs.flags & F_EQNS)
                    {
                        for (int i = 0; i < 15; i++)
                            Telemetry[idx].EQNS[i] = aprs.tlm_eqns.val[i];
                    }
                    else if (aprs.flags & F_BITS)
                    {
                        Telemetry[idx].BITS_FLAG = aprs.telemetry.bitsFlag;
                    }
                    else if (aprs.flags & F_TLM)
                    {
                        for (int i = 0; i < 5; i++)
                            Telemetry[idx].VAL[i] = aprs.telemetry.val[i];
                        Telemetry[idx].BITS = aprs.telemetry.bits;
                        show = true;
                    }

                    for (int i = 0; i < 4; i++)
                    { // Cut length
                        if (strstr(Telemetry[idx].PARM[i], "RxTraffic") != 0)
                            sprintf(Telemetry[idx].PARM[i], "RX");
                        if (strstr(Telemetry[idx].PARM[i], "TxTraffic") != 0)
                            sprintf(Telemetry[idx].PARM[i], "TX");
                        if (strstr(Telemetry[idx].PARM[i], "RxDrop") != 0)
                            sprintf(Telemetry[idx].PARM[i], "DROP");
                        Telemetry[idx].PARM[i][6] = 0;
                        Telemetry[idx].UNIT[i][3] = 0;
                        for (int a = 0; a < 3; a++)
                        {
                            if (Telemetry[idx].UNIT[i][a] == '/')
                                Telemetry[idx].UNIT[i][a] = 0;
                        }
                    }

                    for (int i = 0; i < 5; i++)
                    {
                        if (Telemetry[idx].PARM[i][0] == 0)
                        {
                            sprintf(Telemetry[idx].PARM[i], "CH%d", i + 1);
                        }
                    }
                }
                if (show || filter == false)
                {
                    display.fillRect(0, 0, 72, 9, WHITE);
                    display.setTextColor(BLACK);
                    display.setCursor(10, 1);
                    display.print("TELEMETRY");
                    display.setFont();
                    display.setTextColor(WHITE);
                    display.setCursor(0, 12);
                    // display.print(Telemetry[idx].PARM[0]);
                    // display.print(":");

                    if (fmod(Telemetry[idx].VAL[0], 1) == 0)
                        display.print(Telemetry[idx].VAL[0], 0);
                    else
                        display.print(Telemetry[idx].VAL[0], 1);
                    display.print(Telemetry[idx].UNIT[0]);
                    display.setCursor(20, 12);
                    // display.print(Telemetry[idx].PARM[1]);
                    // display.print(":");
                    if (fmod(Telemetry[idx].VAL[1], 1) == 0)
                        display.print(Telemetry[idx].VAL[1], 0);
                    else
                        display.print(Telemetry[idx].VAL[1], 1);
                    display.print(Telemetry[idx].UNIT[1]);
                    display.setCursor(0, 22);
                    // display.print(Telemetry[idx].PARM[2]);
                    // display.print(":");
                    if (fmod(Telemetry[idx].VAL[2], 1) == 0)
                        display.print(Telemetry[idx].VAL[2], 0);
                    else
                        display.print(Telemetry[idx].VAL[2], 1);
                    display.print(Telemetry[idx].UNIT[2]);
                    display.setCursor(21, 22);
                    // display.print(Telemetry[idx].PARM[3]);
                    // display.print(":");
                    if (fmod(Telemetry[idx].VAL[3], 1) == 0)
                        display.print(Telemetry[idx].VAL[3], 0);
                    else
                        display.print(Telemetry[idx].VAL[3], 1);
                    display.print(Telemetry[idx].UNIT[3]);
                    display.setCursor(0, 32);
                    // display.print(Telemetry[idx].PARM[4]);
                    // display.print(":");
                    display.print(Telemetry[idx].VAL[4], 1);
                    display.print(Telemetry[idx].UNIT[4]);

                    // display.setCursor(4, 55);
                    // display.print("BIT");
                    // uint8_t bit = Telemetry[idx].BITS;
                    // for (int i = 0; i < 8; i++)
                    // {
                    //     if (bit & 0x80)
                    //     {
                    //         display.fillCircle(30 + (i * 12), 58, 3, WHITE);
                    //     }
                    //     else
                    //     {
                    //         display.drawCircle(30 + (i * 12), 58, 3, WHITE);
                    //     }
                    //     bit <<= 1;
                    // }
                    display.display();
                }
                return;
            }
            else if (aprs.packettype & T_STATUS)
            {
                display.fillRect(0, 0, 72, 9, WHITE);
                display.setTextColor(BLACK);
                display.setCursor(10, 1);
                display.print("STATUS");

                display.setFont();
                display.setCursor(0, 10);
                // memset(&text[0], 0, sizeof(text));
                // memcpy(&text[0], aprs.comment, aprs.comment_len);
                display.setTextColor(WHITE);
                display.print(aprs.comment);
                display.display();
                return;
            }
            else if (aprs.packettype & T_QUERY)
            {
                display.fillRect(0, 0, 72, 9, WHITE);
                display.setTextColor(BLACK);
                display.setCursor(10, 1);
                display.print("?QUERY?");
                // memset(&text[0], 0, sizeof(text));
                // memcpy(&text[0], aprs.comment, aprs.comment_len);
                display.setFont();
                display.setTextColor(WHITE);
                display.setCursor(2, 10);
                display.print(aprs.comment);
                display.display();
                return;
            }
            else if (aprs.packettype & T_MESSAGE)
            {
                if (aprs.msg.is_ack == 1)
                {
                }
                else if (aprs.msg.is_rej == 1)
                {
                }
                else
                {
                    display.fillRect(0, 0, 72, 9, WHITE);
                    display.setTextColor(BLACK);
                    display.setCursor(10, 1);
                    display.print("MESSAGE");
                    display.setCursor(0, 10);
                    display.print("{");
                    // char txtID[7];
                    // memset(txtID, 0, sizeof(txtID));
                    // strncpy(&txtID[0], aprs.msg.msgid, aprs.msg.msgid_len);
                    // int msgid = atoi(txtID);
                    //  display.print(msgid, DEC);
                    // display.printf("%s", txtID);
                    // display.print("}");
                    //  memset(&text[0], 0, sizeof(text));
                    //  memcpy(&text[0], aprs.comment, aprs.comment_len);
                    display.setFont();
                    display.setTextColor(WHITE);
                    // display.setCursor(2, 10);
                    // display.print("To: ");
                    // memset(text, 0, sizeof(text));
                    // strncpy(&text[0], aprs.dstname, aprs.dstname_len);
                    // display.print(text);
                    // String mycall = "";
                    // if (config.igate_ssid > 0)
                    //     mycall = String(config.igate_mycall) + String("-") + String(config.igate_ssid, DEC);
                    // else
                    //     mycall = String(config.igate_mycall);
                    // if (strcmp(mycall.c_str(), text) == 0)
                    // {
                    //     display.setCursor(2, 54);
                    //     display.print("ACK:");
                    //     display.println(msgid);
                    //     String rawData = sendIsAckMsg(src_call, txtID);
                    //     log_d("IGATE_MSG: %s", rawData.c_str());
                    //     //if (config.igate_loc2rf)
                    //     { // IGATE SEND POSITION TO RF
                    //         char *rawP = (char *)malloc(rawData.length());
                    //         memcpy(rawP, rawData.c_str(), rawData.length());
                    //         pkgTxPush(rawP, rawData.length(), 0);
                    //         free(rawP);
                    //     }
                    //     // if (config.igate_loc2inet)
                    //     // { // IGATE SEND TO APRS-IS
                    //     //     if (aprsClient.connected())
                    //     //     {
                    //     //         aprsClient.println(rawData); // Send packet to Inet
                    //     //     }
                    //     // }
                    // }
                    memset(text, 0, sizeof(text));
                    strncpy(&text[0], aprs.msg.body, aprs.msg.body_len);
                    display.setCursor(2, 10);
                    display.print("Msg: ");
                    display.println(text);
                    display.display();
                }
                return;
            }
            display.setFont();
            display.drawFastHLine(0, 16, 70, WHITE);
            // display.drawFastVLine(48, 16, 48, WHITE);
            display.setCursor(16, 4);
            if (aprs.srcname_len > 0)
            {
                memset(&itemname, 0, sizeof(itemname));
                memcpy(&itemname, aprs.srcname, aprs.srcname_len);
                // Serial.println(itemname);
                display.print(itemname);
            }
            else
            {
                display.print(src_call);
            }

